export const mkBgRules = `
Ј [Аа] > Я;
ј [Аа] > я;

Ј [Уу] > Ю;
ј [Уу] > ю;

[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊбвгдѕжзклмнпрстфхцчшљњ] { ЈО > ЬО;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊбвгдѕжзклмнпрстфхцчшљњ] { јО > ьО;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊбвгдѕжзклмнпрстфхцчшљњ] { Јо > Ьо;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊбвгдѕжзклмнпрстфхцчшљњ] { јо > ьо;

ЈО > ЙО;
јО > йО;
Јо > Йо;
јо > йо;

[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊбвгдѕжзклмнпрстфхцчшљњ] { ЈЕ > ИЕ;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊбвгдѕжзклмнпрстфхцчшљњ] { јЕ > иЕ;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊбвгдѕжзклмнпрстфхцчшљњ] { Је > Ие;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊбвгдѕжзклмнпрстфхцчшљњ] { је > ие;

ЈЕ > ЙЕ;
јЕ > йЕ;
Је > Йе;
је > йе;

Ј > Й;
ј > й;

ЌА > КЯ;
ќА > кЯ;
Ќа > Кя;
ќа > кя;

ЌУ > КЮ;
ќУ > кЮ;
Ќу > Кю;
ќу > кю;

ЌО > КЬО;
ќО > кЬО;
Ќо > Кьо;
ќо > кьо;

Ќ > К;
ќ > к;

ЃА > ГЯ;
ѓА > гЯ;
Ѓа > Гя;
ѓа > гя;

ЃУ > ГЮ;
ѓУ > гЮ;
Ѓу > Гю;
ѓу > гю;

ЃО > ГЬО;
ѓО > гЬО;
Ѓо > Гьо;
ѓо > гьо;

Ѓ > Г;
ѓ > г;

ЉА > ЛЯ;
љА > лЯ;
Ља > Ля;
ља > ля;

ЉУ > ЛЮ;
љУ > лЮ;
Љу > Лю;
љу > лю;

ЉО > ЛЬО;
љО > лЬО;
Љо > Льо;
љо > льо;

Љ > Л;
љ > л;

ЊА > НЯ;
њА > нЯ;
Ња > Ня;
ња > ня;

ЊУ > НЮ;
њУ > нЮ;
Њу > Ню;
њу > ню;

ЊО > НЬО;
њО > нЬО;
Њо > Ньо;
њо > ньо;

Њ > Н;
њ > н;

[:Lu:] { Ѕ > ДЗ;
Ѕ } [:Lu:] > ДЗ;
Ѕ > Дз;
ѕ > дз;

[:Lu:] { Џ > ДЖ;
Џ } [:Lu:] > ДЖ;
Џ > Дж;
џ > дж;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [ЙйьЬ] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [еиоъЕИОЪ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [еиоъЕИОЪ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { и [аяАЯ] > я;
[аеиоуъюяАЕИОУЪЮЯ] { И [аяАЯ] > Я;
[аеиоуъюяАЕИОУЪЮЯ] { и [уюУЮ] > ю;
[аеиоуъюяАЕИОУЪЮЯ] { И [уюУЮ] > Ю;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ьО > йО;
[аеиоуъюяАЕИОУЪЮЯ] { Ьо > Йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ьЕ > йЕ;
[аеиоуъюяАЕИОУЪЮЯ] { Ье > Йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;

::Null;

[йя] [аА] > я;
[ЙЯ] [аА] > Я;

[йю] [уУ] > ю;
[ЙЮ] [уУ] > Ю;

ш [тТ] > щ;
Ш [тТ] > Щ;
`;
