export const mkIpaRules = `
::Lower;

н } [кг] > ŋ;
л } [еиј] > l;

б } [пфктќшсцчх] > p;
в } [пфктќшсцчх] > f;
г } [пфктќшсцчх] > k;
д } [пфктќшсцчх] > t;
ѓ } [пфктќшсцчх] > c;
ж } [пфктќшсцчх] > ʃ;
з } [пфктќшсцчх] > s;
ѕ } [пфктќшсцчх] > t͡s;
џ } [пфктќшсцчх] > t͡ʃ;

п } [бгдѓжзѕџ] > b;
т } [бгдѓжзѕџ] > d;
к } [бгдѓжзѕџ] > ɡ;
ќ } [бгдѓжзѕџ] > ɟ;
ш } [бгдѓжзѕџ] > ʒ;
с } [бгдѓжзѕџ] > z;
ц } [бгдѓжзѕџ] > d͡z;
ч } [бгдѓжзѕџ] > d͡ʒ;

б } [^[:L:][:M:]] > p;
в } [^[:L:][:M:]] > f;
г } [^[:L:][:M:]] > k;
д } [^[:L:][:M:]] > t;
ѓ } [^[:L:][:M:]] > c;
ж } [^[:L:][:M:]] > ʃ;
з } [^[:L:][:M:]] > s;
ѕ } [^[:L:][:M:]] > t͡s;
џ } [^[:L:][:M:]] > t͡ʃ;

а > a;
б > b;
в > v;
г > ɡ;
д > d;
ѓ > ɟ;
е > ɛ;
ж > ʒ;
з > z;
ѕ > d͡z;
и > i;
ј > j;
к > k;
ќ > c;
л > ɫ;
љ > l;
м > m;
н > n;
њ > ɲ;
о > ɔ;
п > p;
р > r;
с > s;
т > t;
у > u;
ф > f;
х > x;
ц > t͡s;
ч > t͡ʃ;
џ > d͡ʒ;
ш > ʃ;
\\' > ə;
`;
