export const mkKkRules = `
::NFC;

ЉА > ЛЯ;
љА > лЯ;
Ља > Ля;
ља > ля;

ЉЕ > ЛЕ;
љЕ > лЕ;
Ље > Ле;
ље > ле;

ЉИ > ЛИ;
љИ > лИ;
Љи > Ли;
љи > ли;

ЉО > ЛЁ;
љО > лЁ;
Љо > Лё;
љо > лё;

ЉУ > ЛЮ;
љУ > лЮ;
Љу > Лю;
љу > лю;

Љ } [:Lu:] > ЛЬ;
[:Lu:] { Љ > ЛЬ;
Љ > Ль;
љ > ль;

ЊА > НЯ;
њА > нЯ;
Ња > Ня;
ња > ня;

ЊЕ > НЕ;
њЕ > нЕ;
Ње > Не;
ње > не;

ЊИ > НИ;
њИ > нИ;
Њи > Ни;
њи > ни;

ЊО > НЁ;
њО > нЁ;
Њо > Нё;
њо > нё;

ЊУ > НЮ;
њУ > нЮ;
Њу > Ню;
њу > ню;

Њ } [:Lu:] > НЬ;
[:Lu:] { Њ > НЬ;
Њ > Нь;
њ > нь;

ЌА > КЯ;
ќА > кЯ;
Ќа > Кя;
ќа > кя;

ЌЕ > КЕ;
ќЕ > кЕ;
Ќе > Ке;
ќе > ке;

ЌИ > КИ;
ќИ > кИ;
Ќи > Ки;
ќи > ки;

ЌО > КЁ;
ќО > кЁ;
Ќо > Кё;
ќо > кё;

ЌУ > КЮ;
ќУ > кЮ;
Ќу > Кю;
ќу > кю;

Ќ } [:Lu:] > КЬ;
[:Lu:] { Ќ > КЬ;
Ќ > Кь;
ќ > кь;

ЃА > ГЯ;
ѓА > гЯ;
Ѓа > Гя;
ѓа > гя;

ЃЕ > ГЕ;
ѓЕ > гЕ;
Ѓе > Ге;
ѓе > ге;

ЃИ > ГИ;
ѓИ > гИ;
Ѓи > Ги;
ѓи > ги;

ЃО > ГЁ;
ѓО > гЁ;
Ѓо > Гё;
ѓо > гё;

ЃУ > ГЮ;
ѓУ > гЮ;
Ѓу > Гю;
ѓу > гю;

Ѓ } [:Lu:] > ГЬ;
[:Lu:] { Ѓ > ГЬ;
Ѓ > Гь;
ѓ > гь;

Ѕ } [:Lu:] > ДЗ;
[:Lu:] { Ѕ > ДЗ;
Ѕ > Дз;
ѕ > дз;

Џ } [:Lu:] > ДЖ;
[:Lu:] { Џ > ДЖ;
Џ > Дж;
џ > дж;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈА > ЬЯ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { јА > ьЯ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Ја > Ья;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ја > ья;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈЕ > ЬЕ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { јЕ > ьЕ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Је > Ье;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { је > ье;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈО > ЬО;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { јО > ьО;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Јо > Ьо;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { јо > ьо;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈУ > ЬЮ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { јУ > ьЮ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Ју > Ью;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ју > ью;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈИ > ЬИ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { јИ > ьИ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Ји > Ьи;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ји > ьи;

Ј [аА] > Я;
ј [аА] > я;

Ј [еЕ] > Е;
ј [еЕ] > е;

ЈО > ЙО;
јО > йО;
Јо > Йо;
јо > йо;

Ј [уУ] > Ю;
ј [уУ] > ю;

Ј [иИ] > И;
ј [иИ] > и;

Ј > Й;
ј > й;

::Null;

[^[:L:][:M:]] { Ң > Н;
[^[:L:][:M:]] { ң > н;

[ҮҰ] [уУ] > У;
[үұ] [уУ] > у;

::Null;

[Әә] { [Әә] > ;
[Өө] { [Өө] > ;
[Уу] { [Уу] > ;
[Үү] { [Үү] > ;
[Ұұ] { [Ұұ] > ;
[Іі] { [Іі] > ;
[Ғғ] { [Ғғ] > ;
[Ңң] { [Ңң] > ;
[Һһ] { [Һһ] > ;
[Ёё] { [Ёё] > ;
[Щщ] { [Щщ] > ;
[Йй] { [Йй] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
[ъЪ] } [^[:L:][:M:]] > ;
[аәеёиоөуұүъыіэюяАӘЕЁИОӨУҰҮЪЫІЭЮЯ] { [ъЪ] } [аәеёиоөуұүъыіэюяАӘЕЁИОӨУҰҮЪЫІЭЮЯ] > ;

::Null;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йа > ья;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йА > ьЯ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йа > Ья;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙА > ЬЯ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йо > ьё;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йО > ьЁ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йо > Ьё;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙО > ЬЁ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йе > ье;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йЕ > ьЕ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йе > Ье;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙЕ > ЬЕ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йу > ью;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йУ > ьЮ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йу > Ью;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙУ > ЬЮ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йи > ьи;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йИ > ьИ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йи > Ьи;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙИ > ЬИ;

[^[:L:][:M:]] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > и;
[^[:L:][:M:]] { Й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > И;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { й } [^[:L:][:M:]] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Й } [^[:L:][:M:]] > И;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > И;

::Null;

Қ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > К;
қ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > к;
Ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > Г;
ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > г;

[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { Қ > К;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { қ > к;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { Ғ > Г;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { ғ > г;
`;
