export const mkKkRules = `
::NFC;

ЉА > ЛЯ;
Ља > Ля;
ља > ля;

ЉЕ > ЛЕ;
Ље > Ле;
ље > ле;

ЉИ > ЛИ;
Љи > Ли;
љи > ли;

ЉО > ЛЁ;
Љо > Лё;
љо > лё;

ЉУ > ЛЮ;
Љу > Лю;
љу > лю;

Љ } [:Lu:] > ЛЬ;
[:Lu:] { Љ > ЛЬ;
Љ > Ль;
љ > ль;

ЊА > НЯ;
Ња > Ня;
ња > ня;

ЊЕ > НЕ;
Ње > Не;
ње > не;

ЊИ > НИ;
Њи > Ни;
њи > ни;

ЊО > НЁ;
Њо > Нё;
њо > нё;

ЊУ > НЮ;
Њу > Ню;
њу > ню;

Њ } [:Lu:] > НЬ;
[:Lu:] { Њ > НЬ;
Њ > Нь;
њ > нь;

ЌА > КЯ;
Ќа > Кя;
ќа > кя;

ЌЕ > КЕ;
Ќе > Ке;
ќе > ке;

ЌИ > КИ;
Ќи > Ки;
ќи > ки;

ЌО > КЁ;
Ќо > Кё;
ќо > кё;

ЌУ > КЮ;
Ќу > Кю;
ќу > кю;

Ќ } [:Lu:] > КЬ;
[:Lu:] { Ќ > КЬ;
Ќ > Кь;
ќ > кь;

ЃА > ГЯ;
Ѓа > Гя;
ѓа > гя;

ЃЕ > ГЕ;
Ѓе > Ге;
ѓе > ге;

ЃИ > ГИ;
Ѓи > Ги;
ѓи > ги;

ЃО > ГЁ;
Ѓо > Гё;
ѓо > гё;

ЃУ > ГЮ;
Ѓу > Гю;
ѓу > гю;

Ѓ } [:Lu:] > ГЬ;
[:Lu:] { Ѓ > ГЬ;
Ѓ > Гь;
ѓ > гь;

Ѕ } [:Lu:] > ДЗ;
[:Lu:] { Ѕ > ДЗ;
Ѕ > Дз;
ѕ > дз;

Џ } [:Lu:] > ДЖ;
[:Lu:] { Џ > ДЖ;
Џ > Дж;
џ > дж;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈА > ЬЯ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Ја > Ья;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ја > ья;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈЕ > ЬЕ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Је > Ье;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { је > ье;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈО > ЬО;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Јо > Ьо;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { јо > ьо;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈУ > ЬЮ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Ју > Ью;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ју > ью;

[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ЈИ > ЬИ;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { Ји > Ьи;
[БВГДЃЖЗЅКЌЛЉМНЊПРСТФХЦЧЏШбвгдѓжзѕкќлљмнњпрстфхцчџш] { ји > ьи;

ЈА > Я;
Ја > Я;
ја > я;

ЈЕ > Е;
Је > Е;
је > е;

ЈО > ЙО;
Јо > Йо;
јо > йо;

ЈУ > Ю;
Ју > Ю;
ју > ю;

ЈИ > И;
Ји > И;
ји > и;

Ј > Й;
ј > й;

::Null;

[^[:L:][:M:]] { Ң > Н;
[^[:L:][:M:]] { ң > н;

[ҮҰ] У > У;
[ҮҰ] у > У;
[үұ] У > У;
[үұ] у > у;

::Null;

[Әә] { [Әә] > ;
[Өө] { [Өө] > ;
[Уу] { [Уу] > ;
[Үү] { [Үү] > ;
[Ұұ] { [Ұұ] > ;
[Іі] { [Іі] > ;
[Ғғ] { [Ғғ] > ;
[Ңң] { [Ңң] > ;
[Һһ] { [Һһ] > ;
[Ёё] { [Ёё] > ;
[Щщ] { [Щщ] > ;
[Йй] { [Йй] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
[ъЪ] } [^[:L:][:M:]] > ;
[аәеёиоөуұүъыіэюяАӘЕЁИОӨУҰҮЪЫІЭЮЯ] { [ъЪ] } [аәеёиоөуұүъыіэюяАӘЕЁИОӨУҰҮЪЫІЭЮЯ] > ;

::Null;

[^[:L:][:M:]] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > и;
[^[:L:][:M:]] { Й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > И;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { й } [^[:L:][:M:]] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Й } [^[:L:][:M:]] > И;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > И;

::Null;

Қ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > К;
қ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > к;
Ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > Г;
ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > г;

[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { Қ > К;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { қ > к;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { Ғ > Г;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { ғ > г;
`;
