export const mkRuRules = `
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Ја > Ья;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈА > ЬЯ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ја > ья;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Ју > Ью;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈУ > ЬЮ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ју > ью;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Је > Ье;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈЕ > ЬЕ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { је > ье;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Јо > Ьо;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈО > ЬО;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { јо > ьо;

Ја > Я;
ЈА > Я;
ја > я;
Ју > Ю;
ЈУ > Ю;
ју > ю;
Је > Е;
ЈЕ > Е;
је > е;
Јо > Йо;
ЈО > ЙО;
јо > йо;

Ј > Й;
ј > й;

Ља > Ля;
ЉА > ЛЯ;
ља > ля;
Љу > Лю;
ЉУ > ЛЮ;
љу > лю;
Љо > Льо;
ЉО > ЛЬО;
љо > льо;
Ље > Ле;
ЉЕ > ЛЕ;
ље > ле;
Љи > Ли;
ЉИ > ЛИ;
љи > ли;
Љ } [:Ll:] > Ль;
Љ > ЛЬ;
љ > ль;

Ња > Ня;
ЊА > НЯ;
ња > ня;
Њу > Ню;
ЊУ > НЮ;
њу > ню;
Њо > Ньо;
ЊО > НЬО;
њо > ньо;
Ње > Не;
ЊЕ > НЕ;
ње > не;
Њи > Ни;
ЊИ > НИ;
њи > ни;
Њ } [:Ll:] > Нь;
Њ > НЬ;
њ > нь;

Ѓа > Гя;
ЃА > ГЯ;
ѓа > гя;
Ѓу > Гю;
ЃУ > ГЮ;
ѓу > гю;
Ѓо > Гьо;
ЃО > ГЬО;
ѓо > гьо;
Ѓе > Ге;
ЃЕ > ГЕ;
ѓе > ге;
Ѓи > Ги;
ЃИ > ГИ;
ѓи > ги;
Ѓ } [:Ll:] > Гь;
Ѓ > ГЬ;
ѓ > гь;

Ќа > Кя;
ЌА > КЯ;
ќа > кя;
Ќу > Кю;
ЌУ > КЮ;
ќу > кю;
Ќо > Кьо;
ЌО > КЬО;
ќо > кьо;
Ќе > Ке;
ЌЕ > КЕ;
ќе > ке;
Ќи > Ки;
ЌИ > КИ;
ќи > ки;
Ќ } [:Ll:] > Кь;
Ќ > КЬ;
ќ > кь;

Ѕ } [:Ll:] > Дз;
Ѕ > ДЗ;
ѕ > дз;

Џ } [:Ll:] > Дж;
Џ > ДЖ;
џ > дж;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[Ёё] { [Ёё] > ;
[Йй] { [Йй] > ;
[Хх] { [Хх] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ыы] { [Ыы] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;

::Null;

[щЩъЪыЫьЬ] { [ий] [аА] > я;
[щЩъЪыЫьЬ] { [ИЙ] [аА] > Я;
[щЩъЪыЫьЬ] { [ий] [оО] > ё;
[щЩъЪыЫьЬ] { [ИЙ] [оО] > Ё;
[щЩъЪыЫьЬ] { [ий] [еЕ] > е;
[щЩъЪыЫьЬ] { [ИЙ] [еЕ] > Е;
[щЩъЪыЫьЬ] { [ий] [уУ] > ю;
[щЩъЪыЫьЬ] { [ИЙ] [уУ] > Ю;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йа > ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йА > ьЯ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йа > Ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙА > ЬЯ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йО > ьЁ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йо > Ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙО > ЬЁ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йе > ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЕ > ьЕ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йе > Ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЕ > ЬЕ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йу > ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йУ > ьЮ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йу > Ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙУ > ЬЮ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йи > ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йИ > ьИ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йи > Ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙИ > ЬИ;

й [иИ] > и;
Й [иИ] > И;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [^[:L:][:M:]] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [^[:L:][:M:]] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { и } [^[:L:][:M:]] > й;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { И } [^[:L:][:M:]] > Й;

::Null;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] > ;
[ъЪ] } [^[:L:][:M:]] > ;
[ъЪ] } [аоуэыиАОУЭЫИ] > ;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { [ъЪ] > ;
[^[:L:][:M:]] { [ъЪьЬ] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
