export const mkRuRules = `
::NFC;

[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Ја > Ья;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈА > ЬЯ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { јА > ьЯ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ја > ья;

[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Ју > Ью;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈУ > ЬЮ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { јУ > ьЮ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ју > ью;

[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Је > Ье;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈЕ > ЬЕ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { јЕ > ьЕ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { је > ье;

[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Јо > Ьо;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈО > ЬО;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { јО > ьО;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { јо > ьо;

Ј [аА] > Я;
ј [аА] > я;

Ј [уУ] > Ю;
ј [уУ] > ю;

Ј [еЕ] > Е;
ј [еЕ] > е;

Јо > Йо;
ЈО > ЙО;
јО > йО;
јо > йо;

Ј > Й;
ј > й;

Ља > Ля;
ЉА > ЛЯ;
љА > лЯ;
ља > ля;

Љу > Лю;
ЉУ > ЛЮ;
љУ > лЮ;
љу > лю;

Љо > Льо;
ЉО > ЛЬО;
љО > льО;
љо > льо;

Ље > Ле;
ЉЕ > ЛЕ;
љЕ > лЕ;
ље > ле;

Љи > Ли;
ЉИ > ЛИ;
љИ > лИ;
љи > ли;

[:Lu:] { Љ > ЛЬ;
Љ } [:Lu:] > ЛЬ;
Љ > Ль;
љ > ль;

Ња > Ня;
ЊА > НЯ;
њА > нЯ;
ња > ня;

Њу > Ню;
ЊУ > НЮ;
њУ > нЮ;
њу > ню;

Њо > Ньо;
ЊО > НЬО;
њО > ньО;
њо > ньо;

Ње > Не;
ЊЕ > НЕ;
њЕ > нЕ;
ње > не;

Њи > Ни;
ЊИ > НИ;
њИ > нИ;
њи > ни;

[:Lu:] { Њ > НЬ;
Њ } [:Lu:] > НЬ;
Њ > Нь;
њ > нь;

Ѓа > Гя;
ЃА > ГЯ;
ѓА > гЯ;
ѓа > гя;

Ѓу > Гю;
ЃУ > ГЮ;
ѓУ > гЮ;
ѓу > гю;

Ѓо > Гьо;
ЃО > ГЬО;
ѓО > гьО;
ѓо > гьо;

Ѓе > Ге;
ЃЕ > ГЕ;
ѓЕ > гЕ;
ѓе > ге;

Ѓи > Ги;
ЃИ > ГИ;
ѓИ > гИ;
ѓи > ги;

[:Lu:] { Ѓ > ГЬ;
Ѓ } [:Lu:] > ГЬ;
Ѓ > Гь;
ѓ > гь;

Ќа > Кя;
ЌА > КЯ;
ќА > кЯ;
ќа > кя;

Ќу > Кю;
ЌУ > КЮ;
ќУ > кЮ;
ќу > кю;

Ќо > Кьо;
ЌО > КЬО;
ќО > кьО;
ќо > кьо;

Ќе > Ке;
ЌЕ > КЕ;
ќЕ > кЕ;
ќе > ке;

Ќи > Ки;
ЌИ > КИ;
ќИ > кИ;
ќи > ки;

[:Lu:] { Ќ > КЬ;
Ќ } [:Lu:] > КЬ;
Ќ > Кь;
ќ > кь;

[:Lu:] { Ѕ > ДЗ;
Ѕ } [:Lu:] > ДЗ;
Ѕ > Дз;
ѕ > дз;

[:Lu:] { Џ > ДЖ;
Џ } [:Lu:] > ДЖ;
Џ > Дж;
џ > дж;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[лЛ] { л } [^[:L:][:M:]] > ль;
[лЛ] { Л } [^[:L:][:M:]] > ЛЬ;
[лЛ] { л } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > ль;
[лЛ] { Л } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > ЛЬ;

[Ёё] { [Ёё] > ;
[Йй] { [Йй] > ;
[Хх] { [Хх] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ыы] { [Ыы] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;

::Null;

[щЩъЪыЫьЬ] { [ий] [аА] > я;
[щЩъЪыЫьЬ] { [ИЙ] [аА] > Я;
[щЩъЪыЫьЬ] { [ий] [оО] > ё;
[щЩъЪыЫьЬ] { [ИЙ] [оО] > Ё;
[щЩъЪыЫьЬ] { [ий] [еЕ] > е;
[щЩъЪыЫьЬ] { [ИЙ] [еЕ] > Е;
[щЩъЪыЫьЬ] { [ий] [уУ] > ю;
[щЩъЪыЫьЬ] { [ИЙ] [уУ] > Ю;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йа > ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йА > ьЯ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йа > Ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙА > ЬЯ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йО > ьЁ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йо > Ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙО > ЬЁ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йе > ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЕ > ьЕ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йе > Ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЕ > ЬЕ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йу > ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йУ > ьЮ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йу > Ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙУ > ЬЮ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йи > ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йИ > ьИ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йи > Ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙИ > ЬИ;

й [иИ] > и;
Й [иИ] > И;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [^[:L:][:M:]] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [^[:L:][:M:]] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { и } [^[:L:][:M:]] > й;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { И } [^[:L:][:M:]] > Й;

::Null;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] > ;
[ъЪ] } [^[:L:][:M:]] > ;
[ъЪ] } [аоуэыиАОУЭЫИ] > ;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { [ъЪ] > ;
[^[:L:][:M:]] { [ъЪьЬ] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
