export const mkUkRules = `
::NFC;

Александар > Олександр;
Ана > Ганна;
Димитар > Дмитро;
Елена > Олена;
Јован > Іван;
Никола > Микола;
Петар > Петро;
Стефан > Степан;
Марија > Марія;
Софија > Софія;
Филип > Пилип;
Катарина > Катерина;
Ивана > Іванна;
Христијан > Християн;
Туризам > Туризм;
Хемија > Хімія;

И } [јЈ] > І;
и } [јЈ] > і;
И } [еЕ] > І;
и } [еЕ] > і;

ИО > ІО;
иО > іО;
Ио > Іо;
ио > іо;

[БПВМФбпвмф] { Ј [Аа] > ’Я;
[БПВМФбпвмф] { ј [Аа] > ’я;

[БПВМФбпвмф] { Ј [Ее] > ’Є;
[БПВМФбпвмф] { ј [Ее] > ’є;

[БПВМФбпвмф] { Ј [Уу] > ’Ю;
[БПВМФбпвмф] { ј [Уу] > ’ю;

[БПВМФбпвмф] { Ј [Ии] > ’Ї;
[БПВМФбпвмф] { ј [Ии] > ’ї;

[Лл] { Ј } [Оо] > Ь;
[Лл] { ј } [Оо] > ь;

Ј [Аа] > Я;
ј [Аа] > я;

Ј [Ее] > Є;
ј [Ее] > є;

Ј [Ии] > Ї;
ј [Ии] > ї;

ЈО > ЙО;
јО > йО;
Јо > Йо;
јо > йо;

Ј [Уу] > Ю;
ј [Уу] > ю;

Ј > Й;
ј > й;

ЉА > ЛЯ;
љА > лЯ;
Ља > Ля;
ља > ля;

ЉЕ > ЛЄ;
љЕ > лЄ;
Ље > Лє;
ље > лє;

ЉИ > ЛІ;
љИ > лІ;
Љи > Лі;
љи > лі;

ЉО > ЛЬО;
љО > лЬО;
Љо > Льо;
љо > льо;

ЉУ > ЛЮ;
љУ > лЮ;
Љу > Лю;
љу > лю;

[:Lu:] { Љ > ЛЬ;
Љ } [:Lu:] > ЛЬ;
Љ > Ль;
љ > ль;

ЊА > НЯ;
њА > нЯ;
Ња > Ня;
ња > ня;

ЊЕ > НЄ;
њЕ > нЄ;
Ње > Нє;
ње > нє;

ЊИ > НІ;
њИ > нІ;
Њи > Ні;
њи > ні;

ЊО > НЬО;
њО > нЬО;
Њо > Ньо;
њо > ньо;

ЊУ > НЮ;
њУ > нЮ;
Њу > Ню;
њу > ню;

[:Lu:] { Њ > НЬ;
Њ } [:Lu:] > НЬ;
Њ > Нь;
њ > нь;

ЃА > ҐЯ;
ѓА > ґЯ;
Ѓа > Ґя;
ѓа > ґя;

ЃЕ > ҐЄ;
ѓЕ > ґЄ;
Ѓе > Ґє;
ѓе > ґє;

ЃИ > ҐІ;
ѓИ > ґІ;
Ѓи > Ґі;
ѓи > ґі;

ЃО > ҐЬО;
ѓО > ґЬО;
Ѓо > Ґьо;
ѓо > ґьо;

ЃУ > ҐЮ;
ѓУ > ґЮ;
Ѓу > Ґю;
ѓу > ґю;

[:Lu:] { Ѓ > ҐЬ;
Ѓ } [:Lu:] > ҐЬ;
Ѓ > Ґь;
ѓ > ґь;

ЌА > КЯ;
ќА > кЯ;
Ќа > Кя;
ќа > кя;

ЌЕ > КЄ;
ќЕ > кЄ;
Ќе > Кє;
ќе > кє;

ЌИ > КІ;
ќИ > кІ;
Ќи > Кі;
ќи > кі;

ЌО > КЬО;
ќО > кЬО;
Ќо > Кьо;
ќо > кьо;

ЌУ > КЮ;
ќУ > кЮ;
Ќу > Кю;
ќу > кю;

[:Lu:] { Ќ > КЬ;
Ќ } [:Lu:] > КЬ;
Ќ > Кь;
ќ > кь;

ЛСКИ > ЛЬСЬКИЙ;
Лски > Льський;
лски > льський;

ЛСКА > ЛЬСЬКА;
Лска > Льська;
лска > льська;

ски > ський;
ска > ська;

ЦИ > ЦІ;
цИ > цІ;
Ци > Ці;
ци > ці;

[:Lu:] { Ѕ > ДЗ;
Ѕ } [:Lu:] > ДЗ;
Ѕ > Дз;
ѕ > дз;

[:Lu:] { Џ > ДЖ;
Џ } [:Lu:] > ДЖ;
Џ > Дж;
џ > дж;

ИА > ІЯ;
иА > іЯ;
Иа > Ія;
иа > ія;

[^[:L:][:M:]] { И > І;
[^[:L:][:M:]] { и > і;

[аеиоуяєіїюАЕИОУЯЄІЇЮ] { Е > Є;
[аеиоуяєіїюАЕИОУЯЄІЇЮ] { е > є;

::Null;

[іІ] { а } [^[:L:][:M:]] > я;
[іІ] { А } [^[:L:][:M:]] > Я;

[іІ] { е > є;
[іІ] { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

Ш [чЧ] > Щ;
ш [чЧ] > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { й [аА] > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { Й [аА] > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { й [еЕ] > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { Й [еЕ] > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { й [іІ] > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { Й [іІ] > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { й [уУ] > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { Й [уУ] > \\'Ю;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йа > ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йА > ьЯ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йа > Ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙА > ЬЯ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йе > ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йЕ > ьЄ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йе > Ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙЕ > ЬЄ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йі > ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йІ > ьЇ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йі > Ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙІ > ЬЇ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йу > ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йУ > ьЮ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йу > Ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙУ > ЬЮ;

й [аА] > я;
Й [аА] > Я;

й [еЕ] > є;
Й [еЕ] > Є;

й [іІ] > ї;
Й [іІ] > Ї;

й [уУ] > ю;
Й [уУ] > Ю;

::Null;

[^[:L:][:M:]] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[^[:L:][:M:]] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [^[:L:][:M:]] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { [ьЬ] } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюяЖЧШЩжчшщ] { [ьЬ] > ;
[^[:L:][:M:]] { [ьЬ] > ;
[ЬЪЙьъй] { [ЬЪьъ] > ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
