export const elIpaRules = `
::Lower;
::NFC;

αί > έ;
έι > ί;
εί > ί;
όι > ί;
οί > ί;
ού > ˈu;
ύι > ί;
υί > ί;

αι > ɛ;
ει > i;
οι > i;
ου > u;
υι > i;

αύ } [αεηιουωάέήίόύώϊϋΐΰβγδζλμνρaɛiɔu] > άv;
αύ > άf;
αυ } [αεηιουωάέήίόύώϊϋΐΰβγδζλμνρaɛiɔu] > av;
αυ > af;

εύ } [αεηιουωάέήίόύώϊϋΐΰβγδζλμνρaɛiɔu] > έv;
εύ > έf;
ευ } [αεηιουωάέήίόύώϊϋΐΰβγδζλμνρaɛiɔu] > ɛv;
ευ > ɛf;

ηύ } [αεηιουωάέήίόύώϊϋΐΰβγδζλμνρaɛiɔu] > ίv;
ηύ > ίf;
ηυ } [αεηιουωάέήίόύώϊϋΐΰβγδζλμνρaɛiɔu] > iv;
ηυ > if;

::Null;

[^[:L:][:M:]] { μπ > b;
μπ > mb;

[^[:L:][:M:]] { ντ > d;
ντ > nd;

[^[:L:][:M:]] { γκ } [εηιυέήίύϊϋΐΰɛi] > ɟ;
[^[:L:][:M:]] { γκ > g;
γκ } [εηιυέήίύϊϋΐΰɛi] > ŋɟ;
γκ > ŋg;

γγ } [εηιυέήίύϊϋΐΰɛi] > ŋɟ;
γγ > ŋg;

γχ } [εηιυέήίύϊϋΐΰɛi] > ŋç;
γχ > ŋx;

τζ > dz;
τσ > ts;

κ } [εηιυέήίύϊϋΐΰɛi] > c;
γ } [εηιυέήίύϊϋΐΰɛi] > ʝ;
χ } [εηιυέήίύϊϋΐΰɛi] > ç;

ββ > v;
κκ > k;
λλ > l;
μμ > m;
νν > n;
ππ > p;
ρρ > ɾ;
σσ > s;
ττ > t;

σ } [βγδζλμνρbdgɟʝŋmnlɾvðɣz] > z;
ς } [^[:L:][:M:]] [βγδζλμνρbdgɟʝŋmnlɾvðɣz] > z;
σ > s;
ς > s;

β > v;
γ > ɣ;
δ > ð;
ζ > z;
θ > θ;
κ > k;
λ > l;
μ > m;
ν > n;
ξ > ks;
π > p;
ρ > ɾ;
τ > t;
φ > f;
χ > x;
ψ > ps;

ά > ˈa;
έ > ˈɛ;
ή > ˈi;
ί > ˈi;
ό > ˈɔ;
ύ > ˈi;
ώ > ˈɔ;
ΐ > ˈi;
ΰ > ˈi;

ϊ > i;
ϋ > i;

α > a;
ε > ɛ;
η > i;
ι > i;
ο > ɔ;
υ > i;
ω > ɔ;

::Null;


niˈ } [aɛɔu] > ˈɲ;
liˈ } [aɛɔu] > ˈʎ;
ʝiˈ } [aɛɔu] > ˈʝ;
çiˈ } [aɛɔu] > ˈç;
ciˈ } [aɛɔu] > ˈc;

ni } [aɛɔu] > ɲ;
li } [aɛɔu] > ʎ;
ʝi } [aɛɔu] > ʝ;
çi } [aɛɔu] > ç;
ci } [aɛɔu] > c;
`;
