export const elLatnRules = `
::NFD;

[́̀͂̓̔ͅ] > ;

::Null;

ΑΫ > AI;
Αϋ > Ai;
αϋ > ai;
ΕΫ > EI;
Εϋ > Ei;
εϋ > ei;
ΗΫ > II;
Ηϋ > Ii;
ηϋ > ii;
ΟΫ > OI;
Οϋ > Oi;
οϋ > oi;
ΑΪ > AI;
Αϊ > Ai;
αϊ > ai;
ΕΪ > EI;
Εϊ > Ei;
εϊ > ei;
ΟΪ > OI;
Οϊ > Oi;
οϊ > oi;
ΥΪ > II;
Υϊ > Ii;
υϊ > ii;

ΑΥ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > AV;
Αυ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Av;
αυ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > av;
ΑΥ > AF;
Αυ > Af;
αυ > af;

ΕΥ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > EV;
Ευ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Ev;
ευ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > ev;
ΕΥ > EF;
Ευ > Ef;
ευ > ef;

ΗΥ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > IV;
Ηυ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Iv;
ηυ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > iv;
ΗΥ > IF;
Ηυ > If;
ηυ > if;

Ο [υΥ] > U;
ο [υΥ] > u;

Α [ιΙ] > E;
α [ιΙ] > e;

[ΕΟΥ] [ιΙ] > I;
[εου] [ιΙ] > i;

[^[:L:][:M:]] { Μ [πΠ] > B;
[^[:L:][:M:]] { μ [πΠ] > b;
Μ [πΠ] } [^[:L:][:M:]] > B;
μ [πΠ] } [^[:L:][:M:]] > b;
ΜΠ > MB;
μΠ > mB;
Μπ > Mb;
μπ > mb;

[^[:L:][:M:]] { Ν [τΤ] > D;
[^[:L:][:M:]] { ν [τΤ] > d;
Ν [τΤ] } [^[:L:][:M:]] > D;
ν [τΤ] } [^[:L:][:M:]] > d;
ΝΤ > ND;
νΤ > nD;
Ντ > Nd;
ντ > nd;

[^[:L:][:M:]] { Γ [κΚ] > G;
[^[:L:][:M:]] { γ [κΚ] > g;
Γ [κΚ] } [^[:L:][:M:]] > G;
γ [κΚ] } [^[:L:][:M:]] > g;
ΓΚ > NG;
γΚ > nG;
Γκ > Ng;
γκ > ng;

ΓΓ > NG;
γΓ > nG;
Γγ > Ng;
γγ > ng;

ΓΞ > NKS;
γΞ > nKS;
Γξ > Nks;
γξ > nks;

ΓΧ > NX;
γΧ > nX;
Γχ > Nx;
γχ > nx;

ΤΣ > TS;
τΣ > tS;
Τ [σς] > Ts;
τ [σς] > ts;

ΤΖ > DZ;
τΖ > dZ;
Τζ > Dz;
τζ > dz;

Α > A;
α > a;

Β > V;
β > v;

[:Lu:] { Γ > GH;
Γ } [:Lu:] > GH;
Γ > Gh;
γ > gh;

Δ > D;
δ > d;

Ε > E;
ε > e;

Ζ > Z;
ζ > z;

[:Lu:] { Θ > TH;
Θ } [:Lu:] > TH;
Θ > Th;
θ > th;

[ΙΥΗ] > I;
[ιυη] > i;

Κ > K;
κ > k;

Λ > L;
λ > l;

Μ > M;
μ > m;

Ν > N;
ν > n;

[:Lu:] { Ξ > KS;
Ξ } [:Lu:] > KS;
Ξ > Ks;
ξ > ks;

[ΟΩ] > O;
[οω] > o;

Π > P;
π > p;

Ρ > R;
ρ > r;

Σ > S;
[σς] > s;

Τ > T;
τ > t;

Φ > F;
φ > f;

Χ > X;
χ > x;

[:Lu:] { Ψ > PS;
Ψ } [:Lu:] > PS;
Ψ > Ps;
ψ > ps;

̈ > ;

::NFC;
`;
