export const elLatnCyrlRules = `
::NFC;

([γΓ] [ιηυΙΗΥ]) } [οεΟΕ] [ιίΙΊ] > $1;
([γΓ] [εοΕΟ] [ιΙ]) } [οεΟΕ] [ιίΙΊ] > $1;

[^[:L:][:M:]] { Γ [ιΙηΗυΥ] } [αεουωάέόώΑΕΟΥΩΆΈΌΎΏ] > Y;
[^[:L:][:M:]] { Γ [εΕοΟ] [ιΙ] } [αεουωάέόώΑΕΟΥΩΆΈΌΎΏ] > Y;
[^[:L:][:M:]] { γ [ιηυ] } [αεουωάέόώ] > y;
[^[:L:][:M:]] { γ [εο] ι } [αεουωάέόώ] > y;
[ΑΕΗΙΟΥΩΆΈΉΊΌΎΏΪΫ] { Γ [ΙΗΥ] } [ΑΕΟΥΩΆΈΌΎΏ] > Y;
[ΑΕΗΙΟΥΩΆΈΉΊΌΎΏΪΫ] { Γ [ΕΟ] Ι } [ΑΕΟΥΩΆΈΌΎΏ] > Y;
[αεηιουωάέήίόύώϊϋΐΰΑΕΗΙΟΥΩΆΈΉΊΌΎΏΪΫ] { γ [ιηυ] } [αεουωάέόώ] > y;
[αεηιουωάέήίόύώϊϋΐΰΑΕΗΙΟΥΩΆΈΉΊΌΎΏΪΫ] { γ [εο] ι } [αεουωάέόώ] > y;
`;
