export const kkBgRules = `
::NFC;

[сСцЦ] { кий } [^[:L:][:M:]] > ки;
[сСцЦ] { КИЙ } [^[:L:][:M:]] > КИ;

ы [йЙ] } [^[:L:][:M:]] > и;
Ы [йЙ] } [^[:L:][:M:]] > И;

[ЖЦЧШЩжцчшщЬь] { Ё > О;
[ЖЦЧШЩжцчшщЬь] { ё > о;

[БВГДЗКЛМНПРСТФХҚҒҢҺ] { Ё > ЬО;
[БВГДЗКЛМНПРСТФХҚҒҢҺбвгдзклмнпрстфхқғңһ] { Ё } [:Lu:] > ЬО;
[БВГДЗКЛМНПРСТФХҚҒҢҺбвгдзклмнпрстфхқғңһ] { Ё > Ьо;
[БВГДЗКЛМНПРСТФХҚҒҢҺбвгдзклмнпрстфхқғңһ] { ё > ьо;

[:Lu:] { Ё > ЙО;
Ё } [:Lu:] > ЙО;
Ё > Йо;
ё > йо;

Ь } [Ее] > И;
ь } [Ее] > и;

Ь } [Оо] > Ь;
ь } [Оо] > ь;

[ЬьЪъ] > ;

Ә > А;
ә > а;

Ө > О;
ө > о;

[ҮҰ] > У;
[үұ] > у;

[ІЫ] > И;
[іы] > и;

Э > Е;
э > е;

Ғ > Г;
ғ > г;

Қ > К;
қ > к;

Ң > Н;
ң > н;

Һ > Х;
һ > х;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [ЙйьЬ] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [еиоъЕИОЪ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [еиоъЕИОЪ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { и [аяАЯ] > я;
[аеиоуъюяАЕИОУЪЮЯ] { И [аяАЯ] > Я;
[аеиоуъюяАЕИОУЪЮЯ] { и [уюУЮ] > ю;
[аеиоуъюяАЕИОУЪЮЯ] { И [уюУЮ] > Ю;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ьО > йО;
[аеиоуъюяАЕИОУЪЮЯ] { Ьо > Йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ьЕ > йЕ;
[аеиоуъюяАЕИОУЪЮЯ] { Ье > Йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;

::Null;

[йя] [аА] > я;
[ЙЯ] [аА] > Я;

[йю] [уУ] > ю;
[ЙЮ] [уУ] > Ю;

ш [тТ] > щ;
Ш [тТ] > Щ;
`;
