export const kkBgRules = `
::NFC;

[сСцЦ] { кий } [^[:L:][:M:]] > ки;
[сСцЦ] { КИЙ } [^[:L:][:M:]] > КИ;

ый } [^[:L:][:M:]] > и;
ЫЙ } [^[:L:][:M:]] > И;
Ый } [^[:L:][:M:]] > И;

[ЖЦЧШЩжцчшщЬь] { Ё > О;
[ЖЦЧШЩжцчшщЬь] { ё > о;

[БВГДЗКЛМНПРСТФХҚҒҢҺбвгдзклмнпрстфхқғңһ] { Ё } [:Lu:] > ЬО;
[БВГДЗКЛМНПРСТФХҚҒҢҺбвгдзклмнпрстфхқғңһ] { Ё > Ьо;
[БВГДЗКЛМНПРСТФХҚҒҢҺбвгдзклмнпрстфхқғңһ] { ё > ьо;

Ё } [:Lu:] > ЙО;
Ё > Йо;
ё > йо;

Ь } [Ее] > И;
ь } [Ее] > и;

Ь } [Оо] > Ь;
ь } [Оо] > ь;

[ЬьЪъ] > ;

Ә > А;
ә > а;

Ө > О;
ө > о;

[ҮҰ] > У;
[үұ] > у;

[ІЫ] > И;
[іы] > и;

Э > Е;
э > е;

Ғ > Г;
ғ > г;

Қ > К;
қ > к;

Ң > Н;
ң > н;

Һ > Х;
һ > х;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [Йй] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Фф] { [Фф] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [^бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [^бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;
ъ } [^[:L:][:M:]] > и;
Ъ } [^[:L:][:M:]] > И;

::Null;

[йя] а > я;
[ЙЯ] а > Я;
[йя] А > Я;
[ЙЯ] А > Я;

[йю] у > ю;
[ЙЮ] у > Ю;
[йю] У > Ю;
[ЙЮ] У > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
