export const kkLatnRules = `
::NFC;

[AÄEIÏOÖUÜ] { Е > YE;
[AÄEIÏOÖUÜaäeiïoöuü] { Е > Ye;
[AÄEIÏOÖUÜaäeiïoöuü] { е > ye;

[ЪЬ] Е > YE;
[ЪЬ] е > Ye;
[ъь] Е > yE;
[ъь] е > ye;

[ЪЬъь] > ;

[:Lu:] { Ё > YO;
Ё } [:Lu:] > YO;
Ё > Yo;
ё > yo;

[:Lu:] { Ю > YU;
Ю } [:Lu:] > YU;
Ю > Yu;
ю > yu;

[:Lu:] { Я > YA;
Я } [:Lu:] > YA;
Я > Ya;
я > ya;

[:Lu:] { Ғ > GH;
Ғ } [:Lu:] > GH;
Ғ > Gh;
ғ > gh;

[:Lu:] { Ц > TS;
Ц } [:Lu:] > TS;
Ц > Ts;
ц > ts;

[:Lu:] { Щ > ŠČ;
Щ } [:Lu:] > ŠČ;
Щ > Šč;
щ > šč;

А > A;
а > a;

Ә > Ä;
ә > ä;

Б > B;
б > b;

В > V;
в > v;

Г > G;
г > g;

Д > D;
д > d;

[ЕЭ] > E;
[еэ] > e;

Ж > Ž;
ж > ž;

З > Z;
з > z;

[ИІ] > I;
[иі] > i;

Й > Y;
й > y;

К > K;
к > k;

Қ > Q;
қ > q;

Л > L;
л > l;

М > M;
м > m;

[НҢ] > N;
[нң] > n;

О > O;
о > o;

Ө > Ö;
ө > ö;

П > P;
п > p;

Р > R;
р > r;

С > S;
с > s;

Т > T;
т > t;

[УҰ] > U;
[уұ] > u;

Ү > Ü;
ү > ü;

Ф > F;
ф > f;

Х > X;
х > x;

Һ > H;
һ > h;

Ч > Č;
ч > č;

Ш > Š;
ш > š;

Ы > Ï;
ы > ï;
`;
