export const kkLatnRules = `
::NFC;

[AÄEIÏOÖUÜaäeiïoöuü] { Е } [:Ll:] > Ye;
[AÄEIÏOÖUÜaäeiïoöuü] { Е > YE;
[AÄEIÏOÖUÜaäeiïoöuü] { е > ye;

[ЪЬ] Е } [^[:L:][:M:]] > Ye;
[ЪЬ] Е } [:Ll:] > Ye;
[ЪЬ] Е > YE;
[ЪЬ] е > Ye;
[ъь] е > ye;

[ЪЬъь] > ;

[^[:L:][:M:]] { Ё } [^[:L:][:M:]] > Yo;
Ё } [:Ll:] > Yo;
Ё > YO;
ё > yo;

[^[:L:][:M:]] { Ю } [^[:L:][:M:]] > Yu;
Ю } [:Ll:] > Yu;
Ю > YU;
ю > yu;

[^[:L:][:M:]] { Я } [^[:L:][:M:]] > Ya;
Я } [:Ll:] > Ya;
Я > YA;
я > ya;

[^[:L:][:M:]] { Ғ } [^[:L:][:M:]] > Gh;
Ғ } [:Ll:] > Gh;
Ғ > GH;
ғ > gh;

[^[:L:][:M:]] { Ц } [^[:L:][:M:]] > Ts;
Ц } [:Ll:] > Ts;
Ц > TS;
ц > ts;

[^[:L:][:M:]] { Щ } [^[:L:][:M:]] > Šč;
Щ } [:Ll:] > Šč;
Щ > ŠČ;
щ > šč;

А > A;
а > a;

Ә > Ä;
ә > ä;

Б > B;
б > b;

В > V;
в > v;

Г > G;
г > g;

Д > D;
д > d;

[ЕЭ] > E;
[еэ] > e;

Ж > Ž;
ж > ž;

З > Z;
з > z;

[ИІ] > I;
[иі] > i;

Й > Y;
й > y;

К > K;
к > k;

Қ > Q;
қ > q;

Л > L;
л > l;

М > M;
м > m;

[НҢ] > N;
[нң] > n;

О > O;
о > o;

Ө > Ö;
ө > ö;

П > P;
п > p;

Р > R;
р > r;

С > S;
с > s;

Т > T;
т > t;

[УҰ] > U;
[уұ] > u;

Ү > Ü;
ү > ü;

Ф > F;
ф > f;

Х > X;
х > x;

Һ > H;
һ > h;

Ч > Č;
ч > č;

Ш > Š;
ш > š;

Ы > Ï;
ы > ï;
`;
