export const kkMkRules = `
::NFC;

ДЖ > Џ;
Дж > Џ;
дЖ > џ;
дж > џ;

Л } [ЯяЮюЁёЬь] > Љ;
л } [ЯяЮюЁёЬь] > љ;

Н } [ЯяЮюЁёЬь] > Њ;
н } [ЯяЮюЁёЬь] > њ;

[ЉЊљњ] { Я > А;
[ЉЊљњ] { я > а;

[ЉЊљњ] { Ю > У;
[ЉЊљњ] { ю > у;

[ЉЊљњ] { Ё > О;
[ЉЊљњ] { ё > о;

[ЉЊљњ] { Ь > ;
[ЉЊљњ] { ь > ;

Ё } [:Lu:] > ЈО;
[:Lu:] { Ё > ЈО;
Ё > Јо;
ё > јо;

Щ } [:Lu:] > ШЧ;
[:Lu:] { Щ > ШЧ;
Щ > Шч;
щ > шч;

Ю } [:Lu:] > ЈУ;
[:Lu:] { Ю > ЈУ;
Ю > Ју;
ю > ју;

Я } [:Lu:] > ЈА;
[:Lu:] { Я > ЈА;
Я > Ја;
я > ја;

Ң > Н;
ң > н;

[ӘЭ] > Е;
[әэ] > е;

Ғ > Г;
ғ > г;

Й > Ј;
й > ј;

Қ > К;
қ > к;

Ө > О;
ө > о;

[ҰҮ] > У;
[ұү] > у;

Һ > Х;
һ > х;

[ЫІ] > И;
[ыі] > и;

[ЪЬъь] > ;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

лј > љ;
Лј > Љ;
ЛЈ > Љ;
лЈ > љ;
нј > њ;
Нј > Њ;
НЈ > Њ;
нЈ > њ;
дз > ѕ;
Дз > Ѕ;
ДЗ > Ѕ;
дЗ > ѕ;
дж > џ;
Дж > Џ;
ДЖ > Џ;
дЖ > џ;

Ји > И;
ЈИ > И;
ји > и;
јИ > И;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { ј } [еЕоО] > ;
[АЕИОУаеиоу] { Ј } [еЕоО] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] } [рР] > ;

[^[:L:][:M:]] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[^[:L:][:M:]] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
