export const kkMkRules = `
::NFC;

Л } [ЯяЮюЁёЬь] > Љ;
л } [ЯяЮюЁёЬь] > љ;

Н } [ЯяЮюЁёЬь] > Њ;
н } [ЯяЮюЁёЬь] > њ;

::Null;

[ЉЊљњ] { Я > А;
[ЉЊљњ] { я > а;

[ЉЊљњ] { Ю > У;
[ЉЊљњ] { ю > у;

[ЉЊљњ] { Ё > О;
[ЉЊљњ] { ё > о;

[ЉЊљњ] { Ь > ;
[ЉЊљњ] { ь > ;

Д [жЖ] > Џ;
д [жЖ] > џ;

[:Lu:] { Ё > ЈО;
Ё } [:Lu:] > ЈО;
Ё > Јо;
ё > јо;

[:Lu:] { Щ > ШЧ;
Щ } [:Lu:] > ШЧ;
Щ > Шч;
щ > шч;

[:Lu:] { Ю > ЈУ;
Ю } [:Lu:] > ЈУ;
Ю > Ју;
ю > ју;

[:Lu:] { Я > ЈА;
Я } [:Lu:] > ЈА;
Я > Ја;
я > ја;

Ң > Н;
ң > н;

[ӘЭ] > Е;
[әэ] > е;

Ғ > Г;
ғ > г;

Й > Ј;
й > ј;

Қ > К;
қ > к;

Ө > О;
ө > о;

[ҰҮ] > У;
[ұү] > у;

Һ > Х;
һ > х;

[ЫІ] > И;
[ыі] > и;

[ЪЬъь] > ;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

Л [јЈ] > Љ;
л [јЈ] > љ;
Н [јЈ] > Њ;
н [јЈ] > њ;
Д [зЗ] > Ѕ;
д [зЗ] > ѕ;
Д [жЖ] > Џ;
д [жЖ] > џ;

Ј [иИ] > И;
ј [иИ] > и;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { [јЈ] } [еЕоО] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] } [рР] > ;

[^[:L:][:M:]] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[^[:L:][:M:]] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [^[:L:][:M:]] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [^[:L:][:M:]] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
