export const kkUkRules = `
::NFC;

Й [ІИ] > Ї;
Й [іи] > Ї;
й [ІИ] > Ї;
й [іи] > ї;

ЙЕ > Є;
Йе > Є;
йЕ > Є;
йе > є;

[ЬЪьъ] Ё } [:Lu:] > ЙО;
[ЬЪьъ] Ё > Йо;
[ЬЪьъ] ё > йо;

[^[:L:][:M:]] { Ё } [:Lu:] > ЙО;
[^[:L:][:M:]] { Ё > Йо;
[^[:L:][:M:]] { ё > йо;

[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯя'’‘\`´ʼ] { Ё } [:Lu:] > ЙО;
[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯя'’‘\`´ʼ] { Ё > Йо;
[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯя'’‘\`´ʼ] { ё > йо;

[ЖжЦцЧчШшЩщ] { Ё > О;
[ЖжЦцЧчШшЩщ] { ё > о;

Ё } [:Lu:] > ЬО;
Ё > Ьо;
ё > ьо;

[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯяЬьЪъ'’‘\`´ʼ] { Е > Є;
[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯяЬьЪъ'’‘\`´ʼ] { е > є;

[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯяЬьЪъ'’‘\`´ʼ] { [ІИ] > Ї;
[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯяЬьЪъ'’‘\`´ʼ] { [іи] > ї;

[ДдТтЗзСсЦцЧчШшЖжРр] { И > И;
[ДдТтЗзСсЦцЧчШшЖжРр] { и > и;

И > І;
и > і;

Ә > А;
ә > а;

Ө > О;
ө > о;

[ҰҮ] > У;
[ұү] > у;

Қ > К;
қ > к;

[ҒҺ] > Г;
[ғһ] > г;

Ң > Н;
ң > н;

Э > Е;
э > е;

Ы > И;
ы > и;

[Ъъ] > \\';

::Null;

і { а } [^[:L:][:M:]] > я;
І { а } [^[:L:][:M:]] > я;
і { А } [^[:L:][:M:]] > Я;
І { А } [^[:L:][:M:]] > Я;

і { е > є;
І { е > є;
і { Е > Є;
І { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

ШЧ > Щ;
Шч > Щ;
шЧ > щ;
шч > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { йа > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { йА > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { Йа > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { ЙА > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { йе > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { йЕ > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { Йе > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { ЙЕ > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { йі > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { йІ > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { Йі > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { ЙІ > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { йу > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { йУ > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { Йу > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { ЙУ > \\'Ю;

йа > я;
йА > Я;
Йа > Я;
ЙА > Я;

йе > є;
йЕ > Є;
Йе > Є;
ЙЕ > Є;

йі > ї;
йІ > Ї;
Йі > Ї;
ЙІ > Ї;

йу > ю;
йУ > Ю;
Йу > Ю;
ЙУ > Ю;

::Null;

[^[:L:][:M:]] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[^[:L:][:M:]] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [^[:L:][:M:]] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { ь } [ЯЮЄЇяюєї] > \\';
[БПВМФГҐКХРбпвмфгґкхр] { Ь } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюя] { ь > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { Ь > ;
[^[:L:][:M:]] { ь > ;
[^[:L:][:M:]] { Ь > ;
[ЖЧШЩжчшщ] { ь > ;
[ЖЧШЩжчшщ] { Ь > ;
[Ьь] } [Ьь] > ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
