export const kkUkRules = `
::NFC;

Й [іиІИ] > Ї;
й [іиІИ] > ї;

Й [еЕ] > Є;
й [еЕ] > є;

[ЬЪ] Ё > ЙО;
[ЬЪьъ] Ё > Йо;
[ЬЪьъ] ё > йо;

[^[:L:][:M:]] { Ё } [:Lu:] > ЙО;
[^[:L:][:M:]] { Ё > Йо;
[^[:L:][:M:]] { ё > йо;

[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯя'’‘\`´ʼ] { Ё } [:Lu:] > ЙО;
[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯя'’‘\`´ʼ] { Ё > Йо;
[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯя'’‘\`´ʼ] { ё > йо;

[ЖжЦцЧчШшЩщ] { Ё > О;
[ЖжЦцЧчШшЩщ] { ё > о;

[:Lu:] { Ё > ЬО;
Ё } [:Lu:] > ЬО;
Ё > Ьо;
ё > ьо;

[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯяЬьЪъ'’‘\`´ʼ] { Е > Є;
[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯяЬьЪъ'’‘\`´ʼ] { е > є;

[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯяЬьЪъ'’‘\`´ʼ] { [ІИ] > Ї;
[АаӘәЕеЄєЁёИиІіЇїОоӨөУуҰұҮүЫыЭэЮюЯяЬьЪъ'’‘\`´ʼ] { [іи] > ї;

[ДдТтЗзСсЦцЧчШшЖжРр] { И > И;
[ДдТтЗзСсЦцЧчШшЖжРр] { и > и;

И > І;
и > і;

Ә > А;
ә > а;

Ө > О;
ө > о;

[ҰҮ] > У;
[ұү] > у;

Қ > К;
қ > к;

[ҒҺ] > Г;
[ғһ] > г;

Ң > Н;
ң > н;

Э > Е;
э > е;

Ы > И;
ы > и;

[Ъъ] > \\';

::Null;

[іІ] { а } [^[:L:][:M:]] > я;
[іІ] { А } [^[:L:][:M:]] > Я;

[іІ] { е > є;
[іІ] { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

Ш [чЧ] > Щ;
ш [чЧ] > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { й [аА] > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { Й [аА] > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { й [еЕ] > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { Й [еЕ] > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { й [іІ] > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { Й [іІ] > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { й [уУ] > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { Й [уУ] > \\'Ю;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йа > ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йА > ьЯ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йа > Ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙА > ЬЯ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йе > ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йЕ > ьЄ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йе > Ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙЕ > ЬЄ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йі > ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йІ > ьЇ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йі > Ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙІ > ЬЇ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йу > ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йУ > ьЮ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йу > Ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙУ > ЬЮ;

й [аА] > я;
Й [аА] > Я;

й [еЕ] > є;
Й [еЕ] > Є;

й [іІ] > ї;
Й [іІ] > Ї;

й [уУ] > ю;
Й [уУ] > Ю;

::Null;

[^[:L:][:M:]] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[^[:L:][:M:]] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [^[:L:][:M:]] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { [ьЬ] } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюяЖЧШЩжчшщ] { [ьЬ] > ;
[^[:L:][:M:]] { [ьЬ] > ;
[ЬЪЙьъй] { [ЬЪьъ] > ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
