export const thIpaRules = `
::NFC;

ปตท > pɔːtɔːtʰɔː;
ออลล์ > ʔɔːn;
คอร์ปอเรชั่น > kʰɔːpɔːreːtɕʰan;
อินโฟร์ > ʔinfoː;
เซอร์วิส > sɤːwit̚;
แอดวานซ์ > ʔɛːt̚waːn;
มหา > mahaː;
นคร > nakʰɔːn;
อุดร > ʔudɔːn;
พงศ์ > pʰoŋ;
พงศ } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮเแโใไ] > pʰoŋs;
พงษ์ > pʰoŋ;
ชยพล > tɕʰajapʰon;
วัฒน > wat̚tʰanaʔ;

::Null;

ๆ > ː;
ฯ > ;

[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] [ัิีึืุู] [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] ์ > ;
[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] [ิีึืุู] ์ > ;
ษ ณ ์ > ;
ท ร ์ > ;
ต ร ์ > ;
ิ ด ์ > ิ;
ุ ธ ์ > ุ;
ฎ ร ์ > ;
[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] ์ > ;
์ > ;

::Null;

เ ( ห [งญนณมยรลฬว] ) > $1 เ;
เ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] [รลว] ) } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮะาัิีึืุู] > $1 เ;
เ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] ) > $1 เ;
แ ( ห [งญนณมยรลฬว] ) > $1 แ;
แ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] [รลว] ) } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮะาัิีึืุู] > $1 แ;
แ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] ) > $1 แ;
โ ( ห [งญนณมยรลฬว] ) > $1 โ;
โ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] [รลว] ) } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮะาัิีึืุู] > $1 โ;
โ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] ) > $1 โ;
ใ ( ห [งญนณมยรลฬว] ) > $1 ใ;
ใ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] [รลว] ) } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮะาัิีึืุู] > $1 ใ;
ใ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] ) > $1 ใ;
ไ ( ห [งญนณมยรลฬว] ) > $1 ไ;
ไ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] [รลว] ) } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮะาัิีึืุู] > $1 ไ;
ไ ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] ) > $1 ไ;

[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] { อ } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] > ɔː;
[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] { อ } [^[:L:][:M:]] > ɔː;

::Null;

จร } [ิี] > tɕ;
[ศส] ร } [ะาัิีึืุูเแโใไ่้๊๋็อว] > s;
[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] { ทร > tʰr;
ทร } [ูี] > tʰr;
ทร > s;
ห } [งญนณมยรลฬว] > ;

::Null;

เ ี ( [่้๊๋็] ) ย > ia $1;
เ ื ( [่้๊๋็] ) อ > ɯa $1;
เ ( [่้๊๋็] ) า ะ > ɔʔ $1;
เ ( [่้๊๋็] ) อ ะ > ɤʔ $1;
แ ( [่้๊๋็] ) ะ > ɛʔ $1;
เ ( [่้๊๋็] ) ะ > eʔ $1;
เ ( [่้๊๋็] ) า > aw $1;
เ ( [่้๊๋็] ) อ > ɤː $1;
ั ( [่้๊๋็] ) ว ะ > uaʔ $1;
ั ( [่้๊๋็] ) ว > ua $1;
ิ ( [่้๊๋็] ) ว > iw $1;
ี ( [่้๊๋็] ) ย > ia $1;
ื ( [่้๊๋็] ) อ > ɯa $1;

[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] { รร } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] > a;
[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] { รร } [^[:L:][:M:]] > an;

เ ีย > ia;
เ ือ > ɯa;
เาะ > ɔʔ;
เอะ > ɤʔ;
แะ > ɛʔ;
เะ > eʔ;
เา > aw;
เอ > ɤː;
เ ็ > e;
แ ็ > ɛ;
เ ิ > ɤː;
เ > eː;
แ > ɛː;
โ > oː;
[ไใ] ย > aj;
ใ > aj;
ไ > aj;

ัวะ > uaʔ;
ัว > ua;
[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] { ว } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] > ua;
[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] [่้๊๋็] { ว } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] > ua;
ิว > iw;

ฤ { า > rɯː;
ฦ { า > lɯː;
ฤ > rɯ;
ฦ > lɯ;

อัย > aj;
ัย > aj;
ำ > am;
า > aː;
ะ > aʔ;
ิ > i;
ี > iː;
ึ > ɯ;
ือ > ɯː;
ื > ɯː;
ุ > u;
ู > uː;
ั > a;

[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] { ร } [^[:L:][:M:]] > ɔː n;
บ { ร } ิ > ɔː ร;
ส { ม } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] > o ม;
ก { ม } ล > o ม;
ช { น } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] > o น;
ธ { น } า > aʔ น;
[กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] { ( [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮ] ) } [^[:L:][:M:]] > o $1;

::Null;

พ } ร > pʰ;
พ } ง > pʰ;
พ } ล > pʰ;
ภ } ร > pʰ;
ธ } ร > tʰ;

[aɛeoɔɤʔ่้๊๋็ːiuɯ] { [กขฃคฅฆ] } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮเแโใไ] > k̚;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { [จฉชซฌฎฏฐฑฒดตถทธศษส] } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮเแโใไ] > t̚;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { [บปผฝพฟภ] } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮเแโใไ] > p̚;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { [นณรลฬญ] } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮเแโใไ] > n;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { ง } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮเแโใไ] > ŋ;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { ม } [กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรลวศษสหฬอฮเแโใไ] > m;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { [กขฃคฅฆ] } [^[:L:][:M:]] > k̚;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { [จฉชซฌฎฏฐฑฒดตถทธศษส] } [^[:L:][:M:]] > t̚;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { [บปผฝพฟภ] } [^[:L:][:M:]] > p̚;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { [นณรลฬญ] } [^[:L:][:M:]] > n;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { ง } [^[:L:][:M:]] > ŋ;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { ม } [^[:L:][:M:]] > m;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { ย } [^[:L:][:M:]] > j;
[aɛeoɔɤʔ่้๊๋็ːiuɯ] { ว } [^[:L:][:M:]] > w;

::Null;

ก > k;
[ขฃคฅฆ] > kʰ;
ง > ŋ;
จ > tɕ;
[ฉชฌ] > tɕʰ;
[ซศษส] > s;
ญ > j;
[ฎด] > d;
[ฏต] > t;
[ฐฑฒถทธ] > tʰ;
[ณน] > n;
บ > b;
ป > p;
[ผพภ] > pʰ;
[ฝฟ] > f;
ม > m;
ย > j;
ร > r;
[ลฬ] > l;
ว > w;
[หฮ] > h;
อ > ʔ;

::Null;

( [่้๊๋] ) ( [aɛeoɔɤiuɯ]+ ː? [kpt] ̚ ) > $2 $1;
( [่้๊๋] ) ( [aɛeoɔɤiuɯ]+ ː? [mnŋjw] ) > $2 $1;
( [่้๊๋] ) ( [aɛeoɔɤiuɯ]+ ː? ) > $2 $1;
( [่้๊๋] ) ( [kpt] ̚ ) > $2 $1;
( [่้๊๋] ) ( [mnŋjw] ) > $2 $1;

::Null;

่ > ˥˧;
[้๊] > ˥;
๋ > ˩˥;
[็ํฺ] > ;
`;
