export const ipaKkRules = `
::Null;
::NFC;

ʲ > j;
ʷ > w;
[ɚɝ] > er;
˞ > r;

[ˈ'’ˌ̧̇ːˠˤ˥˧˩̝̟̥̩̪̯͈̃̊̚͡ʼʰʱ] > ;

::Null;

[ɯɤʌưɘɪɨiĩ] [jʝɥ] > и;
[uʊũyʉʏɯɤʌưɘɪɨiĩ] w > у;
[jʝɥ] [aɑɒɐăâ] > я;
[jʝɥ] [uʊũyʉʏ] > ю;
[jʝɥ] [oɔôõœøɵơ] > ё;
[jʝɥ] [eêẽæɛɜę] > е;
[ʃɕʂ] [tʈť] [ʃɕʂç] > щ;
[tʈť] [ʃɕʂç] > ч;
[dɖɗďð] [ʒʑʐž] > дж;
[tʈť] s > ц;

::Null;

[^[:L:][:M:]] { [eêẽɛ] > э;
[aɑɒɐăâæɛɜęəeêẽoɔôõœøɵơuũʊyʉʏɯɤʌưɘɪɨiĩ] { [eêẽɛ] > э;
[aɑɒɐăâæɛɜęəeêẽoɔôõœøɵơuũʊyʉʏɯɤʌưɘэ] { [ɪɨi] > й;
[aɑɒɐăâæɛɜęəeêẽoɔôõœøɵơuũʊyʉʏɯɤʌưɘэ] { [ʊu] > у;

::Null;

[aɑɒɐăâʌ] > а;
[æɜę] > ә;
[eêẽɛə] > е;
[oɔôõ] > о;
[œøɵơ] > ө;
[uũ] > у;
ʊ > ұ;
[yʉʏ] > ү;
[ɯɤưɘ] > ы;
[iĩɪɨ] > и;
[bɓβ] > б;
[vʋ] > в;
[gɡɟ] > г;
[ɣɢɰ] > ғ;
[dɖɗďð] > д;
[ʒʑʐž] > ж;
z > з;
[jʝɥ] > й;
[kc] > к;
q > қ;
[lɫɭʎ] > л;
[mɱ] > м;
[nɳɲ] > н;
ŋ > ң;
[pɸ] > п;
[rɾɹɽʀʁ] > р;
s > с;
[tʈťθ] > т;
f > ф;
[xχç] > х;
[hɦħɧ] > һ;
w > у;
č > ч;
[ʃɕʂ] > ш;
[ʔʕ] > ;

::Null;

[^[:L:][:M:]] { ң > н;
[үұ] у > у;

::Null;

ә { ә > ;
ө { ө > ;
у { у > ;
ү { ү > ;
ұ { ұ > ;
і { і > ;
ғ { ғ > ;
ң { ң > ;
һ { һ > ;
ё { ё > ;
щ { щ > ;
й { й > ;
[ьъй] { [ьъ] > ;
ъ } [^[:L:][:M:]] > ;
[аәеёиоөуұүъыіэюя] { ъ } [аәеёиоөуұүъыіэюя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъ] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъ] { й } [^[:L:][:M:]] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъ] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъ] > и;

::Null;

қ } [бвгғджзйкқлмнңпрстфхһцчшщьъ]* [әеіөүэ] > к;
ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъ]* [әеіөүэ] > г;
[әеіөүэ] [бвгғджзйкқлмнңпрстфхһцчшщьъ]* { қ > к;
[әеіөүэ] [бвгғджзйкқлмнңпрстфхһцчшщьъ]* { ғ > г;
`;
