export const ipaUrRules = `
::Null;

[^[:L:][:M:]] { [ʔʼ] > ;

ẽ > e ̃;
ĩ > i ̃;
õ > o ̃;
ũ > u ̃;

['’ˈˌ̧̇ːˠˤ˥˧˩̝̟̥̩̪̯͈̊̚͡] > ;

０ > 0;
１ > 1;
２ > 2;
３ > 3;
４ > 4;
５ > 5;
６ > 6;
７ > 7;
８ > 8;
９ > 9;

::Null;

[^[:L:][:M:]] { [eɛ] [ɪi] > ای;
[^[:L:][:M:]] { [oɔ] [ʊu] > او;
[eɛ] [ɪi] } [^[:L:][:M:]] > ے;
[eɛ] [ɪi] > ی;
[oɔ] [ʊu] > و;
[^[:L:][:M:]] { [iɪɨyʏ] > ای;
[^[:L:][:M:]] { [uʊʉɯưoɔøɵơôœɤ] > او;
[^[:L:][:M:]] { [eɛɜęêɘ] > ای;
[^[:L:][:M:]] { [aɑæɒâɐ] > آ;
[^[:L:][:M:]] { [ɚɝ] > ار;
[^[:L:][:M:]] { [əʌă] > ا;
[اآو] { [eɛɜęêɘ] } [^[:L:][:M:]] > ئے;
[eɛɜęêɘ] } [^[:L:][:M:]] > ے;
[əă] } [^[:L:][:M:]] > ا;
ɐ } [^[:L:][:M:]] > ر;
[aɑæɒâɐ] > ا;
[ɚɝ] > ر;
[əʌă] > ;
[iɪɨyʏ] } j > ;
ی { [eɛɜęêɘ] > ئ;
[eɛɜęêɘ] } j > ئ;
[iɪɨyʏ] > ی;
[uʊʉɯưoɔøɵơôœɤ] > و;
[اآو] { [eɛɜęêɘ] > ئ;
[eɛɜęêɘ] > ی;
̃ } [^[:L:][:M:]] > ں;
̃ > ن;
[bɓ] > ب;
p > پ;
[tʈ] [ʃɕʂç] > چ;
[dɖ] [ʒʐʑž] > ج;
[tť] > ت;
ʈ > ٹ;
[dď] > د;
ð > ذ;
[ɖɗ] > ڈ;
k > ک;
[gɡɢ] > گ;
q > ق;
s > س;
z > ز;
[xχ] > خ;
ɣ > غ;
[ʃɕʂç] > ش;
[ʒʐʑž] > ژ;
č > چ;
c > ک;
[اآو] { j > ئی;
j > ی;
ʝ > ج;
ɟ > گ;
[mɱ] > م;
[nɲɳ] > ن;
ŋ } ʲ* [kqcɡgɢɟɣɠ] > ن;
ŋ > نگ;
[rɾɹʀʁ] > ر;
ɽ > ڑ;
[lɫɭʎ] > ل;
[fɸ] > ف;
[vʋβwɰɥ] > و;
[hɦɧ] > ہ;
ħ > ح;
ʕ > ع;
[ʔʼ] > ء;
θ > ث;
[ʰʱ] > ھ;
ʲ } [eɛɪi] > ;
ʲ } [^[:L:][:M:]] > ;
ʲ } [jbcdfghklmnpqrstvwxzçðħŋɟɡɣɦɫɭɰɱɲɳɴɸɹɽɾʀʁʂʃʈʋʎʐʑʒʔʕβθχčžťďɖɗɓɕɧʝ] > ;
ʲ > ی;
ʷ > و;

::Null;

\\? > ؟;
';' > ؛;
',' } [^0-9٠-٩۰-۹] > ،;



::Null;

ے } [:L:] > ی;
ں } [:L:] > ن;
[^[:L:][:M:]] { ھ > ہ;
[اآویے] { ھ > ہ;
`;
