export const ipaBgRules = `
::Null;

[͈̚ʰʱʷ'’ʼˈ̇ˌ̧ˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[jʝɥʲ] [aɑɐăâæ] > я;
[jʝɥʲ] [uʊũʉɯư] > ю;
[^[:L:][:M:]] { [jʝɥʲ] [oɔôõɵɒ] > йо;
[jʝɥʲ] [oɔôõɵɒ] > ьо;
[^[:L:][:M:]] { [jʝɥʲ] [eɛęẽêœø] > йе;
[jʝɥʲ] [eɛęẽêœø] > е;
[jʝɥʲ] [yʏ] > ю;
[jʝɥʲ] [iɪĩɨ] > и;
[jʝɥʲ] [əɘʌɤơɜ] > я;
[jʝɥʲ] [ɚɝ] > яр;
[jʝɥʲ] > й;
[ɚɝ] > ър;

[tʈť] s > ц;
[dɖɗď] z > дз;
[tʈť] [ʃɕʂ] > ч;
[dɖɗď] [ʒʐʑž] > дж;
ʃ [tʈťθ] > щ;

[aɑɐăâæ] > а;
[eɛęẽêœø] > е;
[yʏ] > ю;
[iɪĩɨ] [iɪĩɨː] > ий;
[iɪĩɨ] > и;
[oɔôõɵɒ{oʊ}] > о;
[uʊũʉɯư] > у;
[əɘʌɤơɜ] } [^[:L:][:M:]] > а;
[əɘʌɤơɜ] > ъ;

[bɓ] > б;
[vʋwβ] > в;
[gɡɢɣɰɟ] > г;
[dɖɗďð] > д;
[ʒʐʑž] > ж;
z > з;
[ckq] > к;
[lɫɭʎ] > л;
[mɱ] > м;
[nɲɳŋ] > н;
p > п;
[rɾɹɽʀʁ] > р;
[sɕ] > с;
[tʈťθ] > т;
[fɸ] > ф;
[hxχħɦɧç] > х;
[ʃʂ] > ш;
č > ч;
[ʔʕː] > ;

::Null;

б { б > ;
в { в > ;
г { г > ;
ж { ж > ;
й { й > ;
м { м > ;
п { п > ;
с { с > ;
ф { ф > ;
ц { ц > ;
ч { ч > ;
ш { ш > ;
щ { щ > ;
ъ { ъ > ;
ь { ь > ;
ю { ю > ;
я { я > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщ] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[аеиоуъюя] { и } [^бвгджзйклмнпрстфхцчшщ] > й;
[аеиоуъюя] { ьо > йо;
[аеиоуъюя] { ье > йе;

ь } [^[:L:][:M:]] > ;
ь } [^о] > ;

::Null;

[йя] а > я;
[йю] у > ю;
шт > щ;
`;
