export const ipaFaRules = `
::Null;
::NFC;

ẽ > e ̃;
ĩ > i ̃;
õ > o ̃;
ũ > u ̃;

[ʰʱʲʷ'’ʼˈˌ̧̇ːˠˤ˥˧˩̝̟̥̩̪̯͈̊̚͡] > ;

０ > 0;
１ > 1;
２ > 2;
３ > 3;
４ > 4;
５ > 5;
６ > 6;
７ > 7;
８ > 8;
９ > 9;

::Null;

tʃ > چ;
dʒ > ج;
tɕ > چ;
dʑ > ج;
tʂ > چ;
dʐ > ج;
ʈʂ > چ;
ɖʐ > ج;

::Null;

[^[:L:][:M:]] { [ɑɒâ] > آ;
[^[:L:][:M:]] { [iɪɨĩ] > ای;
[^[:L:][:M:]] { [uʊũɯưʉy] > او;
[^[:L:][:M:]] { [aæɐăʌ] > اَ;
[^[:L:][:M:]] { [eɛəɜɘęêœøơẽ] > اِ;
[^[:L:][:M:]] { [oɔɵôõɤʏ] > اُ;
[aæɐăʌ] } [^[:L:][:M:]] > ا;
[eɛəɜɘęêœøơẽ] } [^[:L:][:M:]] > ه;
[oɔɵôõɤʏ] } [^[:L:][:M:]] > و;
[ɑɒâiɪɨĩyuʊũɯưʉaæɐăʌeɛəɜɘɚɝęêœøơẽoɔɵôõɤʏآایوَُِ] { [aæɐăʌ] > اَ;
[ɑɒâiɪɨĩyuʊũɯưʉaæɐăʌeɛəɜɘɚɝęêœøơẽoɔɵôõɤʏآایوَُِ] { [eɛəɜɘɚɝęêœøơẽ] > اِ;
[ɑɒâiɪɨĩyuʊũɯưʉaæɐăʌeɛəɜɘɚɝęêœøơẽoɔɵôõɤʏآایوَُِ] { [oɔɵôõɤʏ] > اُ;

::Null;

[oɔɵôõɤ] } ̃ > و;
̃ > ن;
[ɑɒâ] > ا;
[iɪɨĩ] > ی;
[uʊũɯưʉy] > و;
[aæɐăʌ] > َ;
[ɚɝ] > ر;
[eɛəɜɘęêœøơẽ] > ِ;
[oɔɵôõɤʏ] > ُ;
[bɓ] > ب;
p > پ;
[tťʈ] > ت;
θ > ث;
[dďɖɗ] > د;
ð > ذ;
[ck] > ک;
[gɡ] > گ;
[qɢ] > ق;
ɟ > گ;
ʔ > ء;
ʕ > ع;
[fɸ] > ف;
[vʋβwɰɥ] > و;
s > س;
z > ز;
[ʃɧçɕʂ] > ش;
[ʒžʐʑ] > ژ;
č > چ;
[xχ] > خ;
ɣ > غ;
[hɦ] > ه;
ħ > ح;
[mɱ] > م;
[nɲɳ] > ن;
ŋ } ʲ* [kqcɡgɢɟɣɠ] > ن;
ŋ > نگ;
[lɫɭʎ] > ل;
[rɾɹɽʀʁ] > ر;
[jʝ] > ی;



::Null;

\\? > ؟;
';' > ؛;
',' } [^0-9٠-٩۰-۹] > ،;
ی ی { ی+ > ;
`;
