export const ipaHeRules = `
::Null;
::NFD;

ç } [^[:L:][:M:]] > ך;
ç > כ;

[͈̚ˈˌː'’̇ˑ̇˥˦˧˨˩ˤʷʲʱʰˠⁿˡ̪̺̻̥̬̚ʴʵʶˢˣꜛꜜ↑↓↗↘ʼ͜͡‖|̧̩̯̟̊˞̨̛̝̂̆] > ;

０ > 0;
１ > 1;
２ > 2;
３ > 3;
４ > 4;
５ > 5;
６ > 6;
７ > 7;
８ > 8;
９ > 9;

::Null;

b { b+ > ;
d { d+ > ;
f { f+ > ;
g { g+ > ;
ɡ { ɡ+ > ;
h { h+ > ;
k { k+ > ;
l { l+ > ;
ɫ { ɫ+ > ;
m { m+ > ;
n { n+ > ;
ɲ { ɲ+ > ;
ɳ { ɳ+ > ;
p { p+ > ;
q { q+ > ;
r { r+ > ;
ɾ { ɾ+ > ;
ʁ { ʁ+ > ;
ɹ { ɹ+ > ;
ɽ { ɽ+ > ;
s { s+ > ;
ʃ { ʃ+ > ;
t { t+ > ;
ʈ { ʈ+ > ;
ɖ { ɖ+ > ;
v { v+ > ;
w { w+ > ;
x { x+ > ;
χ { χ+ > ;
z { z+ > ;
ʒ { ʒ+ > ;
θ { θ+ > ;
ð { ð+ > ;
ħ { ħ+ > ;
ʕ { ʕ+ > ;
ɣ { ɣ+ > ;
c { c+ > ;
ɟ { ɟ+ > ;
ʔ { ʔ+ > ;

::Null;

tʃ } [^[:L:][:M:]] > ץ׳;
tɕ } [^[:L:][:M:]] > ץ׳;
ʈʂ } [^[:L:][:M:]] > ץ׳;
tʃ > צ׳;
dʒ > ג׳;
ts } [^[:L:][:M:]] > ץ;
ts > צ;
dz > ז;
tɕ > צ׳;
dʑ > ג׳;
ʈʂ > צ׳;
ɖʐ > ג׳;
č } [^[:L:][:M:]] > ץ׳;
č > צ׳;
ž > ז׳;
ď > ג;
ť > ק;

[bɓʙ] > ב;
[vʋʍwɥβ] > ו;
[f] } [^[:L:][:M:]] > ף;
[fpɸƥ] > פ;
[mɱ] } [^[:L:][:M:]] > ם;
[mɱ] > מ;
[tʈt̪] > ט;
[dɖd̪dʱɗ] > ד;
[θ] > ת;
[ð] > ד;
[nɲɳɴ] } [^[:L:][:M:]] > ן;
[nɲɳɴ] > נ;
ŋ } ʲ* [kqcɡgɢɠɟʄɣ] > נ;
ŋ > נג;
[sʂɕ] > ס;
[zʐʑ] > ז;
[ʃɧ] > ש;
[ʒ] > ז׳;
[^[:L:]'׳] { [ɝɚ] > אר;
[ɝɚ] } [rɾɹʀʁɻɽ] > ;
[rɾɹʀʁɻɽɝɚ] > ר;
[lɫʎɭʟ] > ל;
[jʝɰ] > י;
[kqc] > ק;
[ɡgɢɠɟʄɣ] > ג;
[hɦ] > ה;
[xχ] } [^[:L:][:M:]] > ך;
[xχ] > כ;
[ħʜ] > ח;
[ʕʢ] > ע;
[ʔʡ] > א;

̃ } [^[:L:][:M:]] > ן;
̃ > נ;

[^[:L:]'׳] { [aɑæɒɐʌəɤɵɞ] > א;
[^[:L:]'׳] { [eɛɘɜ] > א;
[^[:L:]'׳] { [iɪyʏɨ] > אי;
[^[:L:]'׳] { [uʊoɔœøʉɯ] > או;

[aɑæɒɐʌəɤɵɞ] } [aɑæɒɐʌəɤɵɞ] > א;
[aɑæɒɐʌəɤɵɞ] } [eɛɘɜ] > א;
[aɑæɒɐʌəɤɵɞ] } [iɪyʏɨ] > א;
[aɑæɒɐʌəɤɵɞ] } [uʊoɔœøʉɯ] > א;

[eɛɘɜ] } [aɑæɒɐʌəɤɵɞ] > א;
[eɛɘɜ] } [eɛɘɜ] > א;
[eɛɘɜ] } [iɪyʏɨ] > י;
[eɛɘɜ] } [uʊoɔœøʉɯ] > א;

[iɪ] } [aɑɐ] [^[:L:]'׳] > י;
[iɪyʏɨ] } [aɑæɒɐʌəɤɵɞ] > יא;
[iɪyʏɨ] } [eɛɘɜ] > יא;
[iɪyʏɨ] } [iɪyʏɨ] > י;
[iɪyʏɨ] } [uʊoɔœøʉɯ] > י;

[uʊoɔœøʉɯ] } [aɑæɒɐʌəɤɵɞ] > וא;
[uʊoɔœøʉɯ] } [eɛɘɜ] > וא;
[uʊoɔœøʉɯ] } [iɪyʏɨ] > וא;
[uʊoɔœøʉɯ] } [uʊoɔœøʉɯ] > ;

[aɑæɒɐʌəɤɵɞ] } [^[:L:]'׳] > ה;
[eɛɘɜ] } [^[:L:]'׳] > ה;
[iɪyʏɨ] } [^[:L:]'׳] > י;
[uʊoɔœøʉɯ] } [^[:L:]'׳] > ו;

[aɑæɒɐʌəɤɵɞ] > ;
[eɛɘɜ] > ;
[iɪyʏɨ] > י;
[uʊoɔœøʉɯ] > ו;

::Null;

יי { י > ;
וו { ו > ;

ך } [:L:] > כ;
ם } [:L:] > מ;
ן } [:L:] > נ;
ף } [:L:] > פ;
ץ } [:L:] > צ;
כ } [^[:L:][:M:]] > ך;
מ } [^[:L:][:M:]] > ם;
נ } [^[:L:][:M:]] > ן;
צ } [^[:L:]'׳] > ץ;
`;
