export const ipaHeRules = `
::Null;
::NFD;

ç } [^[:L:][:M:]] > ך;
ç > כ;

[͈̚ˈˌː'’̇ˑ̇˥˦˧˨˩ˤʷʲʱʰˠⁿˡ̪̺̻̥̬̚ʴʵʶˢˣꜛꜜ↑↓↗↘ʼ͜͡‖|̧̩̯̟̊˞̨̛̝̂̆] > ;

::Null;

tʃ } [^[:L:][:M:]] > ץ׳;
tɕ } [^[:L:][:M:]] > ץ׳;
ʈʂ } [^[:L:][:M:]] > ץ׳;
tʃ > צ׳;
dʒ > ג׳;
ts } [^[:L:][:M:]] > ץ;
ts > צ;
dz > ז;
tɕ > צ׳;
dʑ > ג׳;
ʈʂ > צ׳;
ɖʐ > ג׳;
č } [^[:L:][:M:]] > ץ׳;
č > צ׳;
ž > ז׳;
ď > ג;
ť > ק;

[bɓʙ] > ב;
[vʋʍwɥβ] > ו;
[f] } [^[:L:][:M:]] > ף;
[fpɸƥ] > פ;
[mɱ] } [^[:L:][:M:]] > ם;
[mɱ] > מ;
[tʈt̪] > ט;
[dɖd̪dʱɗ] > ד;
[θ] > ת;
[ð] > ד;
[nɲɳɴ] } [^[:L:][:M:]] > ן;
[nɲɳɴ] > נ;
ŋ } [ɡgɢɠɟʄɣ] > נ;
ŋ > נג;
[sʂɕ] > ס;
[zʐʑ] > ז;
[ʃɧ] > ש;
[ʒ] > ז׳;
[^[:L:]'׳] { [ɝɚ] > אר;
[rɾɹʀʁɻɽɝɚ] > ר;
[lɫʎɭʟ] > ל;
[jʝɰ] > י;
[kqc] > ק;
[ɡgɢɠɟʄɣ] > ג;
[hɦ] > ה;
[xχ] } [^[:L:][:M:]] > ך;
[xχ] > כ;
[ħʜ] > ח;
[ʕʢ] > ע;
[ʔʡ] > א;

̃ } [^[:L:][:M:]] > ן;
̃ > נ;

[^[:L:]'׳] { [aɑæɒɐʌəɤɵɞ] > א;
[^[:L:]'׳] { [eɛɘɜ] > א;
[^[:L:]'׳] { [iɪyʏɨ] > אי;
[^[:L:]'׳] { [uʊoɔœøʉɯ] > או;

[aɑæɒɐʌəɤɵɞ] } [aɑæɒɐʌəɤɵɞ] > א;
[aɑæɒɐʌəɤɵɞ] } [eɛɘɜ] > א;
[aɑæɒɐʌəɤɵɞ] } [iɪyʏɨ] > א;
[aɑæɒɐʌəɤɵɞ] } [uʊoɔœøʉɯ] > א;

[eɛɘɜ] } [aɑæɒɐʌəɤɵɞ] > א;
[eɛɘɜ] } [eɛɘɜ] > א;
[eɛɘɜ] } [iɪyʏɨ] > י;
[eɛɘɜ] } [uʊoɔœøʉɯ] > א;

[iɪyʏɨ] } [aɑæɒɐʌəɤɵɞ] > יא;
[iɪyʏɨ] } [eɛɘɜ] > יא;
[iɪyʏɨ] } [iɪyʏɨ] > י;
[iɪyʏɨ] } [uʊoɔœøʉɯ] > י;

[uʊoɔœøʉɯ] } [aɑæɒɐʌəɤɵɞ] > וא;
[uʊoɔœøʉɯ] } [eɛɘɜ] > וא;
[uʊoɔœøʉɯ] } [iɪyʏɨ] > וא;
[uʊoɔœøʉɯ] } [uʊoɔœøʉɯ] > ;

[aɑæɒɐʌəɤɵɞ] } [^[:L:]'׳] > ה;
[eɛɘɜ] } [^[:L:]'׳] > ה;
[iɪyʏɨ] } [^[:L:]'׳] > י;
[uʊoɔœøʉɯ] } [^[:L:]'׳] > ו;

[aɑæɒɐʌəɤɵɞ] > ;
[eɛɘɜ] > ;
[iɪyʏɨ] > י;
[uʊoɔœøʉɯ] > ו;

::Null;

יי { י > ;
וו { ו > ;

ך } [:L:] > כ;
ם } [:L:] > מ;
ן } [:L:] > נ;
ף } [:L:] > פ;
ץ } [:L:] > צ;
כ } [^[:L:][:M:]] > ך;
מ } [^[:L:][:M:]] > ם;
נ } [^[:L:][:M:]] > ן;
צ } [^[:L:]'׳] > ץ;
`;
