export const ipaBsRules = `
::Null;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʔʕ] > ;

tʃ > č;
tɕ > ć;
dʒ > dž;
dʑ > đ;
[^[:L:][:M:]] { ŋ > n;
[âæăɐɑɒʌ] > a;
[êęɘəɛɜẽ] > e;
[ɚɝ] > er;
[ĩɨɪʏy] > i;
[ôõøœơɔɵɤ] > o;
[ũưʉʊɯ] > u;
[cq] > k;
[ťɕ] > ć;
[ďðɖɗ] > d;
ɟ > đ;
[ɡɢɣɰ] > g;
[ħɦχx] > h;
[ʝɥ] > j;
[ɫɭ] > l;
ʎ > lj;
ɱ > m;
[ŋɳ] > n;
ɲ > nj;
[ɹɽɾʀʁ] > r;
[çɧʃʂ] > š;
ʈ > t;
[ʋβw] > v;
[ʑʒʐ] > ž;
θ > s;
ɓ > b;
ɸ > f;

::Null;

[^[:L:][:M:]] { i } [aeou] > j;

::Null;

i } [aeu] > ij;

::Null;

[čćđšž] { j > ;

::Null;

b { b > ;
c { c > ;
č { č > ;
ć { ć > ;
d { d > ;
đ { đ > ;
f { f > ;
g { g > ;
h { h > ;
j { j > ;
k { k > ;
l { l > ;
m { m > ;
n { n > ;
p { p > ;
q { q > ;
r { r > ;
s { s > ;
š { š > ;
t { t > ;
v { v > ;
w { w > ;
x { x > ;
y { y > ;
z { z > ;
ž { ž > ;
`;
