export const ipaAzRules = `
::Null;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[^[:L:][:M:]] { ʔ > ;
ʔ } [^[:L:][:M:]] > ;
ʔ > \\';

c > k;
ɟ > g;
[gɡɢ] > q;
[jɥʝ] > y;
[wʋβ] > v;
[yʉʏ] > ü;
[âăɐɑɒʌ] > a;
[ɚɝ] > er;
[æɘɜ] > ə;
[êęɛẽ] > e;
[ĩɪ] > i;
[ɨɯɤ] > ı;
[ôõơɔ] > o;
[øœɵ] > ö;
[ũưʊ] > u;
ɓ > b;
č > ç;
[ďɖɗ] > d;
ð > z;
[ɣɰ] > ğ;
[ħɦɧʕ] > h;
[ɫɭʎ] > l;
ɱ > m;
[ŋɲɳ] > n;
[ɹɽɾʀʁ] > r;
θ > s;
[ɕʂʃ] > ş;
[ťʈ] > t;
χ > x;
[žʐʑʒ] > j;
ɸ > f;

::Null;

[^[:L:][:M:]] { ı > i;
[^[:L:][:M:]] { ğ > q;
[aıou] { q } [aıou] > ğ;
[eəiöü] { k } [eəiöü] > y;
`;
