export const ipaRuRules = `
::Null;

[^[:L:][:M:]] { j [aɑɐɒâăʌ] > я;
[aɑɐɒâăʌeɛæøêęəɘɜɵɤẽoɔôõơœuʊʉũưiɪĩɨɯyʏ] { j [aɑɐɒâăʌ] > я;
[^[:L:][:M:]] { j [eɛæêęəɘɜɵɤẽ] > е;
[aɑɐɒâăʌeɛæøêęəɘɜɵɤẽoɔôõơœuʊʉũưiɪĩɨɯyʏ] { j [eɛæêęəɘɜɵɤẽ] > е;
[^[:L:][:M:]] { j [œø] > ё;
[aɑɐɒâăʌeɛæøêęəɘɜɵɤẽoɔôõơœuʊʉũưiɪĩɨɯyʏ] { j [œø] > ё;
[^[:L:][:M:]] { j [uʊʉũưyʏ] > ю;
[aɑɐɒâăʌeɛæøêęəɘɜɵɤẽoɔôõơœuʊʉũưiɪĩɨɯyʏ] { j [uʊʉũưyʏ] > ю;

[͈̚ʰʱʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

ʲ > ь;
[^[:L:][:M:]] { [ɚɝ] > эр;
[аоуыиеёюя] { [ɚɝ] > эр;
[ɚɝ] > ер;
ʎ > ль;
ɲ > нь;
[čç{tʃ}] > ч;
s > с;
[zð] > з;
[ʃʂ] > ш;
ɕ > щ;
[ʒɧʑʐž] > ж;
[mɱ] > м;
[nɳŋ] > н;
[lɫɭ] > л;
[rɹɽɾʀʁ] > р;
[bɓ] > б;
p > п;
[dɖɗď] > д;
[tʈťθ] > т;
[gɡɢɣɰ] > г;
[kqc] > к;
[vʋwβ] > в;
[fɸ] > ф;
[hɦħχx] > х;
[jʝɟɥ] > й;
[aɑɐɒâăʌ] > а;
[^[:L:][:M:]] { [eɛæêęəɘɜɵɤẽ] > э;
[аоуыиеёюя] { [eɛæêęəɘɜɵɤẽ] > э;
[eɛæêęəɘɜɵɤẽ] > е;
[œø] > ё;
[iɪĩ] > и;
[ɨɯ] > ы;
[oɔôõơ] > о;
[uʊʉũư] > у;
[yʏ] > ю;
[ʔʕ] > ;

::Null;

[жшчщ] { ы > и;

ё { ё > ;
й { й > ;
х { х > ;
ш { ш > ;
щ { щ > ;
ы { ы > ;
[ьъй] { [ьъ] > ;

::Null;

[щъыь] { [ий] а > я;
[щъыь] { [ий] о > ё;
[щъыь] { [ий] е > е;
[щъыь] { [ий] у > ю;

[бвгджзйклмнпрстфхцчшщ] { йа > ья;
[бвгджзйклмнпрстфхцчшщ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщ] { йе > ье;
[бвгджзйклмнпрстфхцчшщ] { йу > ью;
[бвгджзйклмнпрстфхцчшщ] { йи > ьи;

йи > и;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщьъ] { й } [^[:L:][:M:]] > и;
[бвгджзйклмнпрстфхцчшщьъ] { й } [бвгджзйклмнпрстфхцчшщ] > и;

[аоуэыиеёюя] { и } [^[:L:][:M:]] > й;

::Null;

[бвгджзйклмнпрстфхцчшщ] { ъ } [бвгджзклмнпрстфхцчшщ] > ;
ъ } [^[:L:][:M:]] > ;
ъ } [аоуэыи] > ;
[аоуэыиеёюя] { ъ > ;
[^[:L:][:M:]] { [ъь] > ;
[ьъй] { [ьъ] > ;
`;
