export const ipaUkRules = `
::Null;
::NFD;

[͈̚ʔʕʰʱʷ'’ˈ̇ˌː̧ˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

tʃ > ч;
dʒ > дж;
ts > ц;
dz > дз;
[:^Letter:] { ʼ > ;
ʼ } [:^Letter:] > ;
ʎ [aâăɐɑɒʌ] > ля;
ʎ æ > ля;
ʎ [eêęœɛɘəẽ] > лє;
ʎ [uũưʉʊ] > лю;
ʎ [oôõøơɔɤɵ] > льо;
ʎ [iĩyʏ] > лі;
ʎ [ɨɪɯ] > лі;
ɲ [aâăɐɑɒʌ] > ня;
ɲ æ > ня;
ɲ [eêęœɛɘəẽ] > нє;
ɲ [uũưʉʊ] > ню;
ɲ [oôõøơɔɤɵ] > ньо;
ɲ [iĩyʏ] > ні;
ɲ [ɨɪɯ] > ні;
ɕ [aâăɐɑɒʌ] > ся;
ɕ æ > ся;
ɕ [eêęœɛɘəẽ] > сє;
ɕ [uũưʉʊ] > сю;
ɕ [oôõøơɔɤɵ] > сьо;
ɕ [iĩyʏ] > сі;
ɕ [ɨɪɯ] > сі;
ʑ [aâăɐɑɒʌ] > зя;
ʑ æ > зя;
ʑ [eêęœɛɘəẽ] > зє;
ʑ [uũưʉʊ] > зю;
ʑ [oôõøơɔɤɵ] > зьо;
ʑ [iĩyʏ] > зі;
ʑ [ɨɪɯ] > зі;
[ďɟ] [aâăɐɑɒʌ] > дя;
[ďɟ] æ > дя;
[ďɟ] [eêęœɛɘəẽ] > дє;
[ďɟ] [uũưʉʊ] > дю;
[ďɟ] [oôõøơɔɤɵ] > дьо;
[ďɟ] [iĩyʏ] > ді;
[ďɟ] [ɨɪɯ] > ді;
ť [aâăɐɑɒʌ] > тя;
ť æ > тя;
ť [eêęœɛɘəẽ] > тє;
ť [uũưʉʊ] > тю;
ť [oôõøơɔɤɵ] > тьо;
ť [iĩyʏ] > ті;
ť [ɨɪɯ] > ті;
[jʝ] [aâăɐɑɒʌ] > я;
[jʝ] æ > я;
[jʝ] [eêęœɛɘəẽ] > є;
[jʝ] [uũưʉʊ] > ю;
[jʝ] [oôõøơɔɤɵ] > йо;
[jʝ] [iĩyʏ] > ї;
[jʝ] [ɨɪɯ] > ї;
ʲ [aâăɐɑɒʌ] > я;
ʲ æ > я;
ʲ [eêęœɛɘəẽ] > є;
ʲ [uũưʉʊ] > ю;
ʲ [oôõøơɔɤɵ] > ьо;
ʲ [iĩyʏ] > і;
ʲ [ɨɪɯ] > і;
[bɓ] > б;
[vwɥʋβ] > в;
[gɡɢ] > ґ;
[hɣɰɦ] > г;
[dðɖɗ] > д;
[ďɟ] > дь;
[žʐʒ] > ж;
z > з;
ʑ > зь;
[jʝ] > й;
[ckq] > к;
[lɫɭ] > л;
ʎ > ль;
[mɱ] > м;
[nŋɳ] > н;
ɲ > нь;
p > п;
[rɹɽɾʀʁ] > р;
s > с;
ɕ > сь;
[tʈθ] > т;
ť > ть;
[fɸ] > ф;
[xçχħ] > х;
č > ч;
[ɧʂʃ] > ш;
ʲ > ь;
ʼ > \\';
[aâăɐɑɒʌ] > а;
[eêęœɛɘəẽæ] > е;
[iĩyʏ] > і;
[ɨɪɯ] > и;
[oôõøơɔɤɵ] > о;
[uũưʉʊ] > у;
[ɚɝ] > ер;

::Null;

шч > щ;
й { й > ;

[бпвмфгґкхр] { йа > \\'я;
[бпвмфгґкхр] { йе > \\'є;
[бпвмфгґкхр] { йі > \\'ї;
[бпвмфгґкхр] { йу > \\'ю;

йа > я;
йе > є;
йі > ї;
йу > ю;

::Null;

[:^Letter:] { й } [бвгґджзклмнпрстфхцчшщ] > і;
[бвгґджзклмнпрстфхцчшщ] { й } [бвгґджзклмнпрстфхцчшщ] > і;

::Null;

[жчшщ] { я > а;
[жчшщ] { ю > у;
[жчшщ] { є > е;

[бпвмфгґкхр] { ь } [яюєї] > \\';
[бпвмфгґкхр] { Ь } [яюєї] > \\';

[аеєиіїоуюя] { ь > ;
[:^Letter:] { ь > ;
[жчшщ] { ь > ;
ь } ь > ;

[:^Letter:] { \\' > ;
\\' } [:^Letter:] > ;
[аеєиіїоуюя] { \\' > ;
\\' { ь > ;
ь } \\' > ;
\\' { \\' > ;
`;
