export const ipaCsRules = `
::Null;

[aɐɑɒăâæʌ] ː > á;
[eɛɜəɘêęẽ] ː > é;
[ɝɚ] ː > ér;
[iɪɨĩ] ː > í;
[oɔœɵôõøơɤ] ː > ó;
[uʊʉɯũư] ː > ú;
[yʏ] ː > ý;

[ɐɑɒăâæʌ] > a;
[ɛɜəɘêęẽ] > e;
[ɝɚ] > er;
[ɪɨĩ] > i;
[ɔœɵôõøơɤ] > o;
[ʊʉɯũư] > u;
ʏ > y;

dʲ > ď;
tʲ > ť;
nʲ > ň;
[tʈ]͡[ʃɕʂ] > č;
[tʈ] [ʃɕʂ] > č;
d [ʒʑʐ] > dž;
t͡s > c;
ts > c;
dz > dz;

ɓ > b;
c > ť;
[ɕʃʂ] > š;
[ɖɗð] > d;
ɟ > ď;
[ɡɢɣ] > g;
[ɥɦɧħ] > h;
ʝ > j;
[ɫɭʎ] > l;
ɱ > m;
[ŋɳ] > n;
ɲ > ň;
q > k;
[ɹɽɾʀʁ] > r;
[ʈθ] > t;
[ʋwβɰ] > v;
[χxç] > ch;
[ʐʑʒ] > ž;
ɸ > f;

[͈̚ːʰʱʲʷ'’ʼˈ̇ˌ̧ˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʔʕ] > ;

::Null;

uu > ú;
[^[:L:][:M:]] { ě > je;

[cjřščžťďň] { y > i;
[cjřščžťďň] { ý > í;

[cjřščžhkrgxlqwsz] { ě > e;

[ďťň] { e > ě;

::Null;

ď } [iíě] > d;
ť } [iíě] > t;
ň } [iíě] > n;
`;
