export const ipaTgRules = `
::NFC;

[ʰʱʷˈˌ̧̇ˠˤ˥˧˩̝̟̥̩̪̯͈̃̊̚͡] > ;

[^[:L:][:M:]] { [ʔʕʼ'’] > ;
[ʔʕʼ'’] > ъ;

ʲ > j;
[tťʈ] [ʃɕʂ] > ч;
[dďɖ] [ʒʑʐž] > ҷ;
[tťʈ] [sθ] > ц;
[dďɖ] z > дз;

[jʝɰɥ] [aâæăɐɑʌ] > я;
[jʝɰɥ] [ɒɔoôõøơ] > ё;
[jʝɰɥ] [uũʉʊư] > ю;
[jʝɰɥ] [eêęẽɛɜɝɘəɚ] > е;
[^[:L:][:M:]] { [eêęẽɛɜɝɘəɚ] > э;
[eêęẽɛɜɝɘəɚ] > е;
[ɵœyʏɯɤ] > ӯ;
[uũʉʊư] > у;
[aâæăɐɑʌ] > а;
[ɒɔoôõøơ] > о;

[iĩɨɪ] ː > ӣ;
ː > ;
[iĩɨɪ] > и;

ŋ > нг;
[nɲɳ] > н;
[mɱ] > м;
p > п;
[bɓ] > б;
[vʋβw] > в;
[fɸ] > ф;
[tťʈ] > т;
[dďɖɗð] > д;
[sθ] > с;
z > з;
[ʃɕʂ] > ш;
[ʒʑʐž] > ж;
[cçč] > ч;
ɟ > ҷ;
k > к;
[gɡɢ] > г;
q > қ;
[xχ] > х;
[ɣʁ] > ғ;
[hɦħɧ] > ҳ;
[lɫɭʎ] > л;
[rɾɹɽʀ] > р;
[jʝɰɥ] > й;



::Null;

щ > шч;
ц > с;
ы > и;
ь > ;

::Null;

[^[:L:][:M:]] { ъ > ;
ъ } [^[:L:][:M:]] > ;

::Null;

[^[:L:][:M:]] { ӣ > и;
ӣ } [[:L:][:M:]] > и;

::Null;

[бвгғджзйкқлмнпрстфхҳчҷш] { э > е;

::Null;

[жшчҷ] { ю > у;
[жшчҷ] { я > а;
[жшчҷ] { ё > о;
`;
