export const ipaPlRules = `
::Null;

[͈̚ʔʕ'’ˈˌː˥˧˩ʰʱʷʼ̧̇ˠˤ̝̟̥̩̪̯̊͡] > ;

::Null;

õ > ą;
ẽ > ę;
ã > ą;
ɔ̃ > ą;
ɛ̃ > ę;
[̃] > ;

::Null;

[^[:L:][:M:]] { [ɪɨʏɵ] > i;

t [ɕç] > ć;
d [ʑʝ] > dź;
tsʲ > ć;
dzʲ > dź;
sʲ > ś;
zʲ > ź;
nʲ > ń;
[ɕç] > ś;
[ʑʝ] > ź;
ɲ > ń;
ɟ > dź;
c > ć;

[tʈť] [ʃʂ] > cz;
[dɖď] [ʒʐ] > dż;
ts > c;
dz > dz;

õ > ą;
ẽ > ę;

[æăâɐɑʌ] > a;
[ɚɝ] > er;
[êɘəɛɜœ] > e;
[aąeęioóuy] { ɪ > j;
[ɪɨ] > y;
[ôøơɔɤɒ] > o;
[ũʉʊɯư] > u;
[ʏɵ] > y;
ĩ > i;

[ʈť] > t;
[ďɖɗð] > d;
č > cz;
[ħχx] > ch;
[ŋɳ] > n;
[ɡɢɣ] > g;
[ɦɧ] > h;
ɰ > ł;
ɥ > j;
[ɫw] > ł;
[ɭʎ] > l;
ɱ > m;
[ɹɽɾʀʁ] > r;
[ʂʃ] > sz;
[ʋvβ] > w;
[ʐʒž] > ż;
ɓ > b;
θ > t;
q > k;
ɸ > f;
ʲ > i;

::Null;

[ćśźńji] { y > i;

::Null;

ć } [aąeęoóu] > ci;
ć } i > c;

ś } [aąeęoóu] > si;
ś } i > s;

ź } [aąeęoóu] > zi;
ź } i > z;

ń } [aąeęoóu] > ni;
ń } i > n;
`;
