export const ipaIsRules = `
::Null;

[͈̚ʔʰʱ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[^[:L:][:M:]] { r ̥ > hr;
[^[:L:][:M:]] { l ̥ > hl;
[^[:L:][:M:]] { n ̥ > hn;
[^[:L:][:M:]] { m ̥ > hm;

a [uʊ] > á;
o [uʊ] > ó;
œ [yʏ] > au;
a [iɪ] > æ;
e { [iɪ] > i;
j [eɛ] > é;
pʰ > p;
tʰ > t;
kʰ > k;
cʰ > kj;
tʃ > s;
dʒ > s;
ʲ > j;
ʷ > v;
[cɟ] > gj;
[qɡɢ] > g;
k > g;
t > d;
[pɓ] > b;
[wɥʋ] > v;
[βɸ] > f;
θ > þ;
[ďʈɖɗť] > d;
[çɦɧħʕχ] > h;
[ɣɰʝ] > j;
ɱ > m;
ɲ > n j;
ŋ > n g;
ɳ > n;
ʎ > lj;
[ɫɭ] > l;
[ɹɽɾʀʁ] > r;
[ɕʂʃʒʐʑčžz] > s;
[ɚɝ] > er;
[ɐɑɒăâ] > a;
[ɛɜɘəêęẽ] > e;
[ɪɨĩ] > i;
i > í;
[ɔôõɤơ] > o;
o > ó;
[ʊʉũưʌɯ] > u;
u > ú;
ʏ > y;
y > ý;
[œøɵ] > ö;

::Null;

[kgh] { j } [eéiíyýæ] > ;
[^[:L:][:M:]] { ð > d;
qu } [aeiouyáéíóúýæöö] > kv;
q > k;
c } [eéiíyýæ] > s;
c > k;
w > v;
z > s;
aa > á;
ee > é;
ii > í;
oo > ó;
uu > ú;
yy > ý;
öö > ö;
ææ > æ;
`;
