export const ipaLatnRules = `
::NFD;

[aeiouyæøœɐɑɒɔɛɘəɜɨɪɯɤɵʉʊʌʏɚɝɞɶ] { [ ̃ ̨ ] } [nŋɲ] > ;
[aeiouyæøœɐɑɒɔɛɘəɜɨɪɯɤɵʉʊʌʏɚɝɞɶ] { [ ̃ ̨ ] > n;
n ̃ > ń;

c ͡ c ̧ > ć;
c c ̧ > ć;
c ̧ > x;
c ̌ > č;
s ̌ > š;
z ̌ > ž;
d ̌ > đ;
t ̌ > ć;
l ̌ > ľ;
n ̌ > ń;
o ̛ > e;
u ̛ > ï;

[ʃʒɕʑʂʐɲʎcɟʝj] { ʲ > ;

[ːˑˈˌʰʱʷˠˤʼ\\'’˥˦˧˨˩↑↓↗↘] > ;
[:Mn:] > ;

::Null;

ɛɪ > ij;
ɟʝ > đ;
tɕ > ć;
dʑ > đ;
tʃ > č;
dʒ > dž;
[tʈ] ʂ > č;
[dɖ] ʐ > dž;
tɬ > tl;
dɮ > dl;

n ʲ > ń;
l ʲ > ľ;
t ʲ > ć;
d ʲ > đ;
ʲ } j > ;
[jʝʲ] > y;

[aɐɑɒʌ] > a;
æ > ä;
[eɛəɘɜɤ] > e;
[ɚɝ] > er;
[iɪ] > i;
[ɨɯ] > ï;
[oɔ] > o;
[øœɵɞɶ] > ö;
[uʊ] > u;
[yɥʉ] > ü;
ʏ > ÿ;

[ʋⱱ] > v;
ʍ > w;
[ɫɭʟɺ] > l;
ʎ > ľ;
[ʁʀrɾɹɽɻ˞] > r;

ɱ > m;
[ɳɴ] > n;
ɲ > ń;
ŋ > ng;

[ɡɢɠʛ] > g;
[ɓβʙ] > b;
[ɗɖ] > d;
ʈ > t;
c > ć;
[ɟʄ] > đ;

ɸ > f;
θ > th;
ð > d;
[ʃɕʂɧ] > š;
[ʒʑʐ] > ž;
[ɣɰ] > gh;
χ > kh;
[ħɦʜ] > h;
ɬ > hl;
ɮ > dl;

[ʔʕʡʢ] > \\';

::NFC;
`;
