export const ipaElRules = `
::Null;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʔʕ] > ;

::Null;

[bɓ] } [bɓ] > ;
[dɖɗ] } [dɖɗ] > ;
[gɟɡɢ] } [gɟɡɢ] > ;
[tʈ]+ } [dɖ] [ʒʑ] > ;
[dɖ] [ʒʑ] > τζ;
m [bɓ] > μπ;
n [dɖɗ] > ντ;
[aâæăɐɑɒʌ] > α;
[bɓ] > μπ;
[vʋβ] > β;
θ > θ;
[ckq] > κ;
[çħhɦɧxχ] > χ;
[dďɖɗ] > ντ;
ð > δ;
[ɚɝ] > ερ;
[eêøęœɘəɛɜɤẽ] > ε;
[fɸ] > φ;
[gɟɡɢ] > γκ;
[ɣɰ] > γ;
[iĩɨɪ] [jʝ]+ > ι;
[jʝ] } [iĩɨɪ] > ;
[iĩɨɪyʏjʝɥ] > ι;
[lɫɭʎ] > λ;
[mɱ] > μ;
[nŋɲɳ] > ν;
[oôõơɔɵ] > ο;
[p] > π;
[rɹɽɾʀʁ] > ρ;
[sčɕʂʃ] > σ;
[tťʈ] > τ;
[uũưʉʊɯw] > ου;
[zžʐʑʒ] > ζ;

::Null;

ς } [:L:] > σ;
σ } [^[:L:][:M:]] > ς;
[ιΙ] [ιΙ] { [ιΙ]+ > ;
`;
