export const ipaViRules = `
::Null;

[͈̚ʔʕ'’ˈˌːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʼ̧̇] > ;

::Null;

dʒ { dʒ > ;
[dɖ] } dʒ > ;
tʃ { tʃ > ;
[tʈ] } tʃ > ;
[fɸ] { [fɸ] > ;
[dɖďɗð] { [dɖďɗð] > ;
[xχ] { [xχ] > ;
[bɓ] { [bɓ] > ;
[gɡɢɟɣɰ] { [gɡɢɟɣɰ] > ;
[ɫɭʎl] { [ɫɭʎl] > ;
[ɹɽɾʀʁr] { [ɹɽɾʀʁr] > ;
[^tʈ] [sɕʃθ] { [sɕʃθ] > ;
ʂ { ʂ > ;
[ʋβv] { [ʋβv] > ;
[^dɖ] [zʑʒžʐ] { [zʑʒžʐ] > ;

::Null;

dʒ [ʰʱ] } [iɪɨĩʲ] > g;
dʒ [ʰʱ] > gi;
dʒ } [iɪɨĩʲ] > g;
dʒ > gi;
dz > d;
tʃ > ch;
ts > x;
ŋ } [ieêyɪɨĩęɛæœøʏɵʉjʝ] > ngh;
ŋ } [ɡg] > n;
ŋ > ng;
[gɡɢɟɣɰ] } [ieêyɪɨĩęɛæœøʏɵʉjʝ] > gh;
[gɡɢɟɣɰ] > g;
[kq] } [ieêyɪɨĩęɛæœøʏɵʉjʝ] > k;
[kq] } [wʷuʊũ] > q;
[kq] } [ʰʱ] > k;
[kq] > c;
[^[:L:][:M:]] { [jʝ] } [iɪɨĩʲ] > g;
[^[:L:][:M:]] { [jʝ] > gi;
[jʝ] > y;
q { [wɥ] > u;
[^[:L:][:M:]] { [wɥ] > v;
[wɥ] > o;
[ɑɐæ] > a;
[ɛęẽ] > e;
[ɪɨĩʲ] > i;
[ɔɒõ] > o;
[ʊũʷ] > u;
[ɯ] > ư;
[ɚɝ] } [ɹɽɾʀʁr] > e;
[ɚɝ] > er;
[ɤʌəɘɜ] > ơ;
[yʏøœɵʉ] > uy;
[ɓ] > b;
[cčç] > ch;
[dɖďɗð] > đ;
[fɸ] > ph;
[ɦɧħʰʱ] > h;
[ɫɭʎ] > l;
[ɱ] > m;
[ɳ] > n;
[ɲ] > nh;
[ɹɽɾʀʁ] > r;
[sɕʃθ] > x;
[ʂ] > s;
[ťʈ] > t;
[ʋβ] > v;
[xχ] > kh;
[zʑʒžʐ] > d;

::Null;

[Xx] { [Xx] > ;
`;
