export const ipaUkRules = `
::Null;
::NFD;

[͈̚ʰʱʷ'’ˈ̇ˌː̧ˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

tʃ > ч;
dʒ > дж;
ts > ц;
dz > дз;
[^[:L:][:M:]] { ʼ > ;
ʼ } [^[:L:][:M:]] > ;
ʎ [aâăɐɑɒʌ] > ля;
ʎ æ > ля;
ʎ [eêęœɛɘəẽ] > лє;
ʎ [uũưʉʊ] > лю;
ʎ [oôõøơɔɤɵ] > льо;
ʎ [iĩyʏ] > лі;
ʎ [ɨɪɯ] > лі;
ɲ [aâăɐɑɒʌ] > ня;
ɲ æ > ня;
ɲ [eêęœɛɘəẽ] > нє;
ɲ [uũưʉʊ] > ню;
ɲ [oôõøơɔɤɵ] > ньо;
ɲ [iĩyʏ] > ні;
ɲ [ɨɪɯ] > ні;
ɕ [aâăɐɑɒʌ] > ся;
ɕ æ > ся;
ɕ [eêęœɛɘəẽ] > сє;
ɕ [uũưʉʊ] > сю;
ɕ [oôõøơɔɤɵ] > сьо;
ɕ [iĩyʏ] > сі;
ɕ [ɨɪɯ] > сі;
ʑ [aâăɐɑɒʌ] > зя;
ʑ æ > зя;
ʑ [eêęœɛɘəẽ] > зє;
ʑ [uũưʉʊ] > зю;
ʑ [oôõøơɔɤɵ] > зьо;
ʑ [iĩyʏ] > зі;
ʑ [ɨɪɯ] > зі;
[ďɟ] [aâăɐɑɒʌ] > дя;
[ďɟ] æ > дя;
[ďɟ] [eêęœɛɘəẽ] > дє;
[ďɟ] [uũưʉʊ] > дю;
[ďɟ] [oôõøơɔɤɵ] > дьо;
[ďɟ] [iĩyʏ] > ді;
[ďɟ] [ɨɪɯ] > ді;
ť [aâăɐɑɒʌ] > тя;
ť æ > тя;
ť [eêęœɛɘəẽ] > тє;
ť [uũưʉʊ] > тю;
ť [oôõøơɔɤɵ] > тьо;
ť [iĩyʏ] > ті;
ť [ɨɪɯ] > ті;

ʲ [oôõøơɔɤɵ] > ьо;
ʲ [iĩyʏɨɪɯ] > і;

[jʝ] > й;
ʲ > ь;
[bɓ] > б;
[vwɥʋβ] > в;
[gɡɢ] > ґ;
[hɣɰɦ] > г;
[dɖɗ] > д;
[ďɟ] > дь;
[ʒʑʐž] > ж;
[zð] > з;
[ckq] > к;
[lɫɭ] > л;
ʎ > ль;
[mɱ] > м;
[nŋɳ] > н;
ɲ > нь;
p > п;
[rɹɽɾʀʁ] > р;
s > с;
ɕ > сь;
[tʈθ] > т;
ť > ть;
[fɸ] > ф;
[xçχħ] > х;
č > ч;
[ɧʂʃ] > ш;

['’‘\`´ʼ] > \\';

[aâăɐɑɒʌ] > а;
[eêęœɛɘəẽæ] > е;
[ɚɝ] > ер;
[iĩyʏ] > і;
[ɨɪɯ] > и;
[oôõøơɔɤɵ] > о;
[uũưʉʊ] > у;

[ʔʕ] > ;

::Null;

і { а } [^[:L:][:M:]] > я;
і { е > є;
[аеєиіїоуюя] { і > ї;
шч > щ;
й { й > ;

[бпвмфгґкхр] { йа > \\'я;
[бпвмфгґкхр] { йе > \\'є;
[бпвмфгґкхр] { йі > \\'ї;
[бпвмфгґкхр] { йу > \\'ю;

[джзлнстцчшщ] { йа > ья;
[джзлнстцчшщ] { йе > ьє;
[джзлнстцчшщ] { йі > ьї;
[джзлнстцчшщ] { йу > ью;

йа > я;
йе > є;
йі > ї;
йу > ю;

::Null;

[^[:L:][:M:]] { й } [бвгґджзклмнпрстфхцчшщ] > і;
[бвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[бвгґджзклмнпрстфхцчшщ] { й } [бвгґджзклмнпрстфхцчшщ] > і;

::Null;

[жчшщ] { я > а;
[жчшщ] { ю > у;
[жчшщ] { є > е;

[бпвмфгґкхр] { ь } [яюєї] > \\';
[бпвмфгґкхр] { Ь } [яюєї] > \\';

[аеєиіїоуюя] { ь > ;
[^[:L:][:M:]] { ь > ;
[жчшщ] { ь > ;
[ьъй] { [ьъ] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] > ;
[аеєиіїоуюя] { ['’‘\`´ʼ] > ;
['’‘\`´ʼ] { ь > ;
ь } ['’‘\`´ʼ] > ;
['’‘\`´ʼ] { ['’‘\`´ʼ] > ;
`;
