export const ipaCaRules = `
::Null;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[âæăɐɑɒ] > a;
[ɚɝ] > er;
[êęẽɛɜɘə] > e;
[ĩɨɪ] > i;
[ôõøœơɔɵɤʌ] > o;
[ũưʉʊɯʏɥy] > u;

::Null;

t [ʃʂɕ] } [^[:L:][:M:]] > ig;
t [ʃʂɕ] > tx;
č } [^[:L:][:M:]] > ig;
č > tx;

d [ʒžʐʑ] } [ei] > tg;
d [ʒžʐʑ] } [^[:L:][:M:]] > ig;
[ʒžʐʑʝ] } [^[:L:][:M:]] > ig;
d [ʒžʐʑ] > tj;

[aeou] { [ʃʂɕ] > ix;
[ʃʂɕ] > x;

[ʒžʐʑʝ] } [ei] > g;
[ʒžʐʑʝ] > j;

[kcq] } [ei] > qu;
[kcq] > c;

[ɡɟɢɣɰ] } [ei] > gu;
[ɡɟɢɣɰ] > g;
g } [ei] > gu;

[ɲɳ] > ny;
ʎ > ll;
[ɫɭ] > l;
ŋ > ng;
ɱ > m;

ɓ > b;
[ðɖɗď] > d;
[ʈť] > t;
[aeiou] { r } [aeiou] > rr;
[ɹɽɾʀʁ] > r;
[ʋβ] > v;
θ > z;
[ħɦɧʔʕçχx] > h;
[aeiou] { s } [aeiou] > ss;

j > i;
w > u;
ɸ > f;

::Null;

n } [bpm] > m;
m } [fv] > n;

::Null;

[^[:L:][:M:]] { ss > s;
ss } [^[:L:][:M:]] > s;

[^[:L:][:M:]] { rr > r;
rr } [^[:L:][:M:]] > r;

[^[:L:][:M:]] { l[·.]l > l;
l[·.]l } [^[:L:][:M:]] > l;

::Null;

[^[:L:][:M:]] { y > i;
[^n] { y > i;

::Null;

[^[:L:][:M:]] { ['·] > ;
['·] } [^[:L:][:M:]] > ;
`;
