export const ipaViRules = `
::Null;

[͈̚ʔʕ'’ˈˌːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʼ̧̇] > ;

::Null;

ŋ } [ieêyɪɨĩęɛæœøʏɵʉjʝ] > ngh;
ŋ > ng;
[gɡɢɟɣɰ] } [ieêyɪɨĩęɛæœøʏɵʉjʝ] > gh;
[gɡɢɟɣɰ] > g;
[kq] } [ieêyɪɨĩęɛæœøʏɵʉjʝ] > k;
[kq] } [wʷuʊũ] > q;
[kq] } [ʰʱ] > k;
[kq] > c;
[:^Letter:] { [jʝ] } [iɪɨĩʲ] > g;
[:^Letter:] { [jʝ] > gi;
[jʝ] > y;
q { [wɥ] > u;
[:^Letter:] { [wɥ] > v;
[wɥ] > o;
[ɑɐæ] > a;
[ɛęẽ] > e;
[ɪɨĩʲ] > i;
[ɔɒõ] > o;
[ʊũʷ] > u;
[ɯ] > ư;
[ɚɝ] > er;
[ɤʌəɘɜ] > ơ;
[yʏøœɵʉ] > uy;
[ɓ] > b;
[cčç] > ch;
[dɖďɗð] > đ;
[fɸ] > ph;
[ɦɧħʰʱ] > h;
[ɫɭʎ] > l;
[ɱ] > m;
[ɳ] > n;
[ɲ] > nh;
[ɹɽɾʀʁ] > r;
[sɕʃθ] > x;
[ʂ] > s;
[ťʈ] > t;
[ʋβ] > v;
[xχ] > kh;
[zʑʒžʐ] > d;
`;
