export const ipaKaRules = `
::Null;

t͡ʃʼ > ჭ;
t͡ʃʰ > ჩ;
t͡ʃ > ჩ;
tʃʼ > ჭ;
tʃʰ > ჩ;
tʃ > ჩ;
t͡ɕʼ > ჭ;
t͡ɕʰ > ჩ;
t͡ɕ > ჩ;
tɕʼ > ჭ;
tɕʰ > ჩ;
tɕ > ჩ;
d͡ʑ > ჯ;
dʑ > ჯ;
ʈ͡ʂʼ > ჭ;
ʈ͡ʂʰ > ჩ;
ʈ͡ʂ > ჩ;
ʈʂʼ > ჭ;
ʈʂʰ > ჩ;
ʈʂ > ჩ;
d͡ʐ > ჯ;
dʐ > ჯ;
t͡sʼ > წ;
t͡sʰ > ც;
t͡s > ც;
tsʼ > წ;
tsʰ > ც;
ts > ც;

d͡ʒ > ჯ;
dʒ > ჯ;
d͡z > ძ;
dz > ძ;

pʼ > პ;
pʰ > ფ;
p > პ;

[tťʈ]ʼ > ტ;
[tťʈ]ʰ > თ;
[tťʈ] > ტ;

kʼ > კ;
kʰ > ქ;
k > კ;

qʼ > ყ;
qʰ > ყ;
q > ყ;

cʼ > კ;
cʰ > ქ;
c > კ;

čʼ > ჭ;
čʰ > ჩ;
č > ჩ;

ẽ > ენ;
ã > ან;
ĩ > ინ;
õ > ონ;
ũ > უნ;

[aâæăɐɑɒʌ] > ა;
[eêęɘəɛɜ] > ე;
[iɨɪyʏ] > ი;
[oôøœơɔɵɤ] > ო;
[uũưʉʊɯ] > უ;
[ɚɝ] > ერ;

[bɓ] > ბ;
[dďɖɗð] > დ;
[gɡɟ] > გ;
[vʋwɥβ] > ვ;
[zʑ] > ზ;
[ʒžʐ] > ჟ;
s > ს;
[ʃɕçʂ] > შ;
[mɱ] > მ;
[nŋɲɳ] > ნ;
[lɫɭʎ] > ლ;
[rɾɹʀɽ] > რ;
[jʝ] > ი;
[fɸ] > ფ;
θ > თ;
[xχ] > ხ;
[ɣɰɢʁ] > ღ;
[^[:L:][:M:]] { ʕ > ;
[^[:L:][:M:]] { ʔ > ;
[ʕʔ] } [aâæăɐɑɒʌeêęɘəɛɜiɨɪyʏoôøœơɔɵɤuũưʉʊɯ] > ჰ;
[ʕʔ] > ;
[hɦħɧ] > ჰ;
̃ > ნ;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̊͡] >;

::Null;

ბ { ბ > ;
გ { გ > ;
დ { დ > ;
ვ { ვ > ;
ზ { ზ > ;
თ { თ > ;
კ { კ > ;
ლ { ლ > ;
მ { მ > ;
ნ { ნ > ;
პ { პ > ;
ჟ { ჟ > ;
რ { რ > ;
ს { ს > ;
ტ { ტ > ;
ფ { ფ > ;
ქ { ქ > ;
ღ { ღ > ;
ყ { ყ > ;
შ { შ > ;
ჩ { ჩ > ;
ც { ც > ;
ძ { ძ > ;
წ { წ > ;
ჭ { ჭ > ;
ხ { ხ > ;
ჯ { ჯ > ;
ჰ { ჰ > ;
ი { ი > ;
ჲ > ი;
ჱ > ე;
ჳ > ვ;
ჴ > ხ;
ჵ > ო;
ჶ > ფ;
`;
