export const ipaMkRules = `
::Null;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

dʒ > џ;
tʃ > ч;
dz > ѕ;
ts > ц;

[aɑɐɒâă] > а;
[eɛæêęəɘɜœẽ] > е;
[ɚɝ] > ер;
[iɪĩɨyʏ] > и;
[oɔôõøơɵɤʌ] > о;
[uʊʉũưɯ] > у;

[bɓ] > б;
[vʋβw] > в;
[gɡɢɣɰ] > г;
[dɖɗð] > д;
[ɟʝď] > ѓ;
[ʒʐʑž] > ж;
z > з;
[jɥ] > ј;
[kq] > к;
[lɫɭ] > л;
ʎ > љ;
[mɱ] > м;
[nɳ] > н;
[ɲŋ] > њ;
p > п;
[rɹɽɾʀʁ] > р;
s > с;
[tʈθ] > т;
[cť] > ќ;
[fɸ] > ф;
[xχhħɦɧç] > х;
č > ч;
[ʃʂɕ] > ш;
[ʔʕ] > ;

::Null;

а { а > ;
б { б > ;
в { в > ;
г { г > ;
д { д > ;
ѓ { ѓ > ;
е { е > ;
ж { ж > ;
з { з > ;
ѕ { ѕ > ;
и { и > ;
ј { ј > ;
к { к > ;
л { л > ;
љ { љ > ;
м { м > ;
н { н > ;
њ { њ > ;
о { о > ;
п { п > ;
р { р > ;
с { с > ;
т { т > ;
ќ { ќ > ;
у { у > ;
ф { ф > ;
х { х > ;
ц { ц > ;
ч { ч > ;
џ { џ > ;
ш { ш > ;

::Null;

лј > љ;
нј > њ;
дз > ѕ;
дж > џ;

ји > и;
иа > ија;

[аеиоу] { ј } [ео] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] } р > ;

[^[:L:][:M:]] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџш] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџш] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџш] > и;
`;
