export const ipaThRules = `
::Null;
::NFD;

[ːˑʼʱʲʷˠˤ̝̟̥̩̪̯͈̣̤̬̃̊̚͡\\.\\-\\|‖‿̧̂̇\u0306\u0328] > ;

::Null;

[˥˦] > \\@H;
[ˈ'’] > \\@PRE\\_H;
[˩˨] > \\@L;
[ˌ] > \\@PRE\\_L;
˧ > ;

::Null;

\\@H \\@H > \\@H;
\\@H \\@L > \\@H;
\\@L \\@H > \\@L;
\\@L \\@L > \\@L;
\\@PRE\\_H \\@PRE\\_H > \\@PRE\\_H;
\\@PRE\\_L \\@PRE\\_L > \\@PRE\\_L;

::Null;

[iɪ][aɑ][uʊ] > \\@IAO;
[bcdfghklmnpqrstvwxzßðħŋɓɕɖɗɟɡɢɣɦɧɫɭɱɲɳɹɽɾʀʁʂʃʈʋʎʐʑʒʔʕɸθχʰç] { [jʝ] >| i;
[iɪ][oɔ][uʊ] > \\@IO;
[iɪ][oɔ] > \\@IO;
[əaɑ][iɪ] > \\@AI;
[əaɑ][uʊ] > \\@AU;
[oɔ][iɪ] > \\@OI;
[eɛ][iɪ] > \\@EI;
[oɔ][uʊ] > \\@OU;
[iɪ][əaɑɛʌ] > \\@IA;
[uʊ][eɛ][iɪ] > \\@UI;
[uʊ][əaɑoɔʌ] > \\@UA;
[iɪĩ] > \\@I;
[eêę] > \\@E;
[ɛæ] > \\@AE;
[aɑɐʌâă] > \\@A;
[ou]\u031B > \\@UE;
[uʊʉũ] > \\@U;
[oɔɒɵôõ] > \\@O;
[əɜɝɚɤœøɘ] > \\@ER;
[ɯɨơư] > \\@UE;
ʏ > \\@YU;

::Null;

[^[:L:][:M:]] [ \t\u200B]* { (\\@[AEIOUY][A-Z0-9_]*) > อ$1;
[A-Z0-9_] [ \t\u200B]* { (\\@[AEIOUY][A-Z0-9_]*) > อ$1;

::Null;

ʈʂʰ > ช;
ʈʂ > จ;
tsʰ > ช;
ts > ซ;
dz > ซ;
tɕʰ > ช;
tʃ > ช;
dʒ > จ;
tɕ > ช;
dʑ > จ;
ɟ > จ;
pʰ > พ;
tʰ > ท;
kʰ > ค;
cʰ > ช;
ʰ > ;

s } [^@] > ส;
z } [^@] > ซ;
[ʃʒ] } [^@] > ช;
s > ซ;
z > ซ;
[ʃʒcçʂʐʑɕčž] > ช;

p > ป;
[bɓβ] > บ;
[tʈť] > ต;
[dɗɖðď] > ด;
[kɡgɢɣ] > ก;
[ʔʕ] > อ;
[fvʋɸ] > ฟ;
θ > ท;
[xχʁhɦħɧ] > ฮ;
[mɱ] > ม;
[nɳ] > น;
ŋ > ง;
[ɲjʝɥy] > ย;
[lɫɭʎ] > ล;
[rɹɾʀɽ] > ร;
q > ค;
[ɰw] > ว;

::Null;

\\@IAO > เียว;
\\@IO > เียว;
\\@AI > ไ;
\\@AU > เา;
\\@OI > อย;
\\@EI > เย;
\\@OU > โว;
\\@IA > เีย;
\\@UI > ุย;
\\@UA > ัว;
\\@ER } [ก-ฮ] > เิ;
\\@ER > เอ;
\\@UE > ึ;
\\@YU > ิว;
\\@I > ิ;
\\@AE > แ;
\\@E > เ;
\\@A } [ก-ฮ] [ \t\u200B]* \\@[AEIOUY] > ะ;
\\@A } [ก-ฮ] [ \t\u200B]* [ยรลว] [ \t\u200B]* \\@[AEIOUY] > ะ;
\\@A } [ก-ฮ\u200B] > ั;
\\@A > ะ;
\\@U > ุ;
\\@O > โ;

::Null;

\\@PRE\\_H ([เแโไใ]*[ก-ฮ\u200B]) > $1 \\@H\\_DONE;
\\@PRE\\_L ([เแโไใ]*[ก-ฮ\u200B]) > $1 \\@L\\_DONE;
([ก-ฮ\u200B]) \\@H > $1 \\@H\\_DONE;
([ก-ฮ\u200B]) \\@L > $1 \\@L\\_DONE;

::Null;

[^[:L:][:M:]] { \\@PRE\\_H > ;
[^[:L:][:M:]] { \\@PRE\\_L > ;
\\@PRE\\_H > ้;
\\@PRE\\_L > ่;
\\@H\\_DONE > ้;
\\@L\\_DONE > ่;
\\@H > ้;
\\@L > ่;

::Null;

([ก-ฮ][ยรลว]?)([่-๋]?)([เแโใไ]) > $3$1$2;

::Null;

([ก-ฮ])([ัิ-ืุู])([ก-ฮ])([่-๋]) } [ก-ฮ\u200Bเแโใไ] > $1$2$4$3;
([ก-ฮ])([ัิ-ืุู])([ก-ฮ])([่-๋]) } [^[:L:][:M:]] > $1$2$4$3;
([เแโใไ])([ก-ฮ])([าะ])([่-๋]) > $1$2$4$3;
([ก-ฮ])([าะ])([่-๋]) > $1$3$2;
([ัิ-ืุู])([ก-ฮ][ฺ]?[ก-ฮ]?)([่-๋]) } [ก-ฮ\u200Bเแโใไ] > $1$3$2;
([ัิ-ืุู])([ก-ฮ][ฺ]?[ก-ฮ]?)([่-๋]) } [^[:L:][:M:]] > $1$3$2;
([เแโใไ])([ก-ฮ])([ก-ฮ])([่-๋]) } [ก-ฮ\u200Bเแโใไ] > $1$2$4$3;
([เแโใไ])([ก-ฮ])([ก-ฮ])([่-๋]) } [^[:L:][:M:]] > $1$2$4$3;
([เแโใไ])([ก-ฮ])([ัิ-ืุู])([ก-ฮ])([่-๋]) } [ก-ฮ\u200Bเแโใไ] > $1$2$3$5$4;
([เแโใไ])([ก-ฮ])([ัิ-ืุู])([ก-ฮ])([่-๋]) } [^[:L:][:M:]] > $1$2$3$5$4;
([เแโใไ])([ก-ฮ])([อ])([ก-ฮ])([่-๋]) > $1$2$5$3$4;

::Null;

ั([่-๋]?)ว([ก-ฮ]) > $1ว$2;

::Null;

([่-๋])([ัิ-ืุู]) > $2$1;

::Null;

\u200B > ;
([่-๋])\\1+ > $1;
([เแโใไ])([ก-ฮ])([ุู]) > $1$2;



::Null;

เเ > แ;

::Null;

[เแโใไ] { [เแโใไ]+ > ;

::Null;

([เแโใไ])([^ก-ฮฤฦ]) > $1อ$2;
([เแโใไ])([^[:L:][:M:]]) > $1อ$2;
([^ก-ฮฤฦะาๅำิีึืั็ํ๎ฺุู่้๊๋์])([ะาๅำิีึืั็ํ๎ฺุู่้๊๋์]) > $1อ$2;
([^[:L:][:M:]])([ะาๅำิีึืั็ํ๎ฺุู่้๊๋์]) > $1อ$2;

::Null;

([ะาๅำ]+)([ิีึืั็ํ๎ฺุู่้๊๋์]+) > $2$1;

::Null;

([่้๊๋์]+)([ิีึืั็ํ๎ฺุู]+) > $2$1;

::Null;

([ํ])([่้๊๋์]*)(า) > $2ำ;
([่้๊๋์]+)(ํ)(า) > $1ำ;
([ิีึืั็ํ๎ฺุู])([่้๊๋์]*)([ำ]+) > $1$2า;

::Null;

([ฤฦ])([ิีึืั็ํ๎ฺุู่้๊๋์]*)(า) > $1$2ๅ;
([^ฤฦ])([ิีึืั็ํ๎ฺุู่้๊๋์]*)(ๅ) > $1$2า;
([^[:L:][:M:]])([ิีึืั็ํ๎ฺุู่้๊๋์]*)(ๅ) > $1$2า;
[^[:L:][:M:]] { ๅ > า;

::Null;

([ิีึืั็ํ๎])([่้๊๋์]*)([ฺุู]+) > $1$2;
([ฺุู])([่้๊๋์]*)([ิีึืั็ํ๎]+) > $1$2;
([ิีึืัํ๎ฺุู])([่้๊๋์]*)([็]+) > $1$2;
([็])([่้๊๋์]*)([ิีึืัํ๎ฺุู]+) > $3$2;

::Null;

[ิีึืั็ํ๎] { [ิีึืั็ํ๎]+ > ;
[ฺุู] { [ฺุู]+ > ;
[่้๊๋์] { [่้๊๋์]+ > ;
[ะาๅำ] { [ะาๅำ]+ > ;
([็]+)([่้๊๋์]+) > $2;
([่้๊๋์]+)([็]+) > $1;

::NFC;
`;
