export const zhKkRules = `
[āáǎàɑɐæ] } [āáǎàɑɐæēéěèêīíǐìōóǒòūúǔùǖǘǚǜv] > a \\';
[ēéěèê] } [āáǎàɑɐæēéěèêīíǐìōóǒòūúǔùǖǘǚǜv] > e \\';
[īíǐì] } [āáǎàɑɐæēéěèêīíǐìōóǒòūúǔùǖǘǚǜv] > i \\';
[ōóǒò] } [āáǎàɑɐæēéěèêīíǐìōóǒòūúǔùǖǘǚǜv] > o \\';
[ūúǔù] } [āáǎàɑɐæēéěèêīíǐìōóǒòūúǔùǖǘǚǜv] > u \\';
[ǖǘǚǜv] } [āáǎàɑɐæēéěèêīíǐìōóǒòūúǔùǖǘǚǜv] > ü \\';

[āáǎàɑɐæ] > a;
[ēéěèê] > e;
[īíǐì] > i;
[ōóǒò] > o;
[ūúǔù] > u;
[ǖǘǚǜv] > ü;

[^[:L:][:M:]] { ['’‘\`´ʼ] > ;
['’‘\`´ʼ] } [^[:L:][:M:]] > ;

::Null;

yuan > юен;
yong > юң;
you > ю;
ya > я;
ye > е;
yi > и;
yo > ё;
yu > ю;
weng > уең;
wen > уен;
wei > уэй;
wu > у;
[jqx] { uan > үен;
[jqx] { ie > е;
[jqx] { iu > ю;
[jqx] { u > ү;
zh { ui > уй;
ch { ui > уй;
sh { ui > уй;
h { ui > уэй;
zh { i > ы;
ch { i > ы;
sh { i > ы;
[zcsr] { i > ы;
iong > юң;
üan > үен;
van > үен;
ia > я;
[jqx] { i > і;
ie > ие;
iu > ю;
ui > уй;
ai > ай;
ei > ей;
ue > үе;
üe > үе;
ve > үе;

[üv] > ү;
a > а;
o > о;
e > е;
i > и;
u > у;

::Null;

zh > ж;
ch > ч;
sh > ш;
n } g [аәоөеиуұүэы] > н;
ng > ң;
b > б;
p > п;
m > м;
f > ф;
d > д;
t > т;
n > н;
l > л;
g > г;
k > к;
h > х;
j > ж;
q > ч;
x > ш;
r > р;
z > з;
c > ц;
s > с;
w > у;
y > й;

\\' > ;

::Null;

[^[:L:][:M:]] { ң > н;
[үұ] у > у;

::Null;

ә { ә > ;
ө { ө > ;
у { у > ;
ү { ү > ;
ұ { ұ > ;
і { і > ;
ғ { ғ > ;
ң { ң > ;
һ { һ > ;
ё { ё > ;
щ { щ > ;
й { й > ;
[ьъй] { [ьъ] > ;
ъ } [^[:L:][:M:]] > ;
[аәеёиоөуұүъыіэюя] { ъ } [аәеёиоөуұүъыіэюя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъ] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъ] { й } [^[:L:][:M:]] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъ] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъ] > и;

::Null;

қ } [бвгғджзйкқлмнңпрстфхһцчшщьъ]* [әеіөүэ] > к;
ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъ]* [әеіөүэ] > г;
[әеіөүэ] [бвгғджзйкқлмнңпрстфхһцчшщьъ]* { қ > к;
[әеіөүэ] [бвгғджзйкқлмнңпрстфхһцчшщьъ]* { ғ > г;

::Title;
`;
