export const zhTgRules = `
::NFC;

[āáǎàɑɐæ] > a;
[ēéěèê] > e;
[īíǐì] > i;
[ōóǒò] > o;
[ūúǔù] > u;
[ǖǘǚǜv] > ü;

[^[:L:][:M:]] { ['’‘\`´ʼ] > ;
['’‘\`´ʼ] } [^[:L:][:M:]] > ;

::Null;

yuan > юан;
yong > юнг;
yue > юе;
yun > юн;
you > ю;
yang > янг;
ying > инг;
yin > ин;
yan > ян;
yao > яо;
ya > я;
ye > е;
yi > и;
yo > ё;
yu > ю;
wai > вай;
wei > вей;
weng > венг;
wen > вен;
wang > ванг;
wan > ван;
wa > ва;
wo > во;
wu > ву;
hui > хуэй;
juan > ҷюан;
quan > чюан;
xuan > сюан;
jue > ҷюе;
que > чюе;
xue > сюе;
jun > ҷюн;
qun > чюн;
xun > сюн;
ju > ҷю;
qu > чю;
xu > сю;
y > й;
w > в;
er > эр;
[^[:L:][:M:]] { ei > эй;
[^[:L:][:M:]] { eng > энг;
[^[:L:][:M:]] { en > эн;
[^[:L:][:M:]] { e > э;
[аеёиоуэюя] { ei > эй;
[аеёиоуэюя] { eng > энг;
[аеёиоуэюя] { en > эн;
[аеёиоуэюя] { e > э;
zh > ҷ;
ch > ч;
sh > ш;
r > ж;
z > з;
c > тс;
s > с;
j > ҷ;
q > ч;
x > с;
b > б;
p > п;
m > м;
f > ф;
d > д;
t > т;
n > н;
l > л;
g > г;
k > к;
h > х;
iang > янг;
iong > юнг;
uang > уанг;
ang > анг;
eng > енг;
ing > инг;
ong > онг;
ian > ян;
iao > яо;
uan > уан;
uai > уай;
an > ан;
en > ен;
in > ин;
un > ун;
ün > юн;
ai > ай;
ei > ей;
ao > ао;
ou > оу;
ia > я;
ie > е;
iu > ю;
ua > уа;
uo > уо;
ue > юе;
üe > юе;
ui > уй;
ü > ю;
a > а;
o > о;
e > е;
i > и;
u > у;

::Null;

ҷ { я > а;
ҷ { ю > у;
ҷ { ё > о;
ч { я > а;
ч { ю > у;
ч { ё > о;
ш { я > а;
ш { ю > у;
ш { ё > о;
ж { я > а;
ж { ю > у;
ж { ё > о;
['’‘\`´ʼ] > ;



::Null;

щ > шч;
ц > с;
ы > и;
ь > ;

::Null;

[^[:L:][:M:]] { ъ > ;
ъ } [^[:L:][:M:]] > ;

::Null;

[^[:L:][:M:]] { ӣ > и;
ӣ } [[:L:][:M:]] > и;

::Null;

[бвгғджзйкқлмнпрстфхҳчҷш] { э > е;

::Null;

[жшчҷ] { ю > у;
[жшчҷ] { я > а;
[жшчҷ] { ё > о;

::Title;
`;
