export const zhUkRules = `
[āáǎàɑɐæ] > a;
[ēéěèê] > e;
[īíǐì] > i;
[ōóǒò] > o;
[ūúǔù] > u;
[ǖǘǚǜv] > ü;

[^[:L:][:M:]] { ['’‘\`´ʼ] > ;
['’‘\`´ʼ] } [^[:L:][:M:]] > ;

::Null;

iang } [aeiouü] > яньґ;
uang } [aeiouü] > уаньґ;
ang } [aeiouü] > аньґ;
eng } [aeiouü] > еньґ;
ing } [aeiouü] > іньґ;
ong } [aeiouü] > уньґ;
iong } [aeiouü] > юньґ;

ang ['’‘\`´ʼ] > ан\\';
eng ['’‘\`´ʼ] > ен\\';
ing ['’‘\`´ʼ] > ін\\';
ong ['’‘\`´ʼ] > ун\\';
iang ['’‘\`´ʼ] > ян\\';
iong ['’‘\`´ʼ] > юн\\';
uang ['’‘\`´ʼ] > уан\\';

yang > ян;
ying > їн;
yong > юн;
yuan > юань;
yue > юе;
yun > юнь;
yao > яо;
yan > янь;
you > ю;
ya > я;
ye > є;
yin > їнь;
yi > ї;
yu > юй;
yo > йо;

wang > ван;
weng > вен;
wai > вай;
wei > вей;
wan > вань;
wen > вень;
wa > ва;
wo > во;
wu > у;

juan > цзюань;
quan > цюань;
xuan > сюань;
jue > цзюе;
que > цюе;
xue > сюе;
jun > цзюнь;
qun > цюнь;
xun > сюнь;
ju > цзюй;
qu > цюй;
xu > сюй;
jü > цзюй;
qü > цюй;
xü > сюй;

zhi > чжи;
chi > чи;
shi > ши;
ri > жи;
zi > цзи;
ci > ци;
si > си;

hui > хуей;

iang > ян;
iong > юн;
uang > уан;
ueng > уен;

ang > ан;
eng > ен;
ing > ін;
ong > ун;
ian > янь;
iao > яо;
uai > уай;
uan > уань;
üan > юань;

ai > ай;
ei > ей;
ui > уй;
ao > ао;
ou > оу;
iu > ю;
ie > є;
ia > я;
in > інь;
un > унь;
ün > юнь;
ua > уа;
uo > о;
ue > юе;
üe > юе;
er > ер;
an > ань;
en > ень;

ng > н;

zh > чж;
ch > ч;
sh > ш;
r > ж;
z > цз;
c > ц;
s > с;
b > б;
p > п;
m > м;
f > ф;
d > д;
t > т;
n > н;
l > л;
g > ґ;
k > к;
h > х;
j > цз;
q > ц;
x > с;
w > в;
y > й;

a > а;
o > о;
e > е;
i > і;
u > у;
ü > юй;

['’‘\`´ʼ] > ;

::Null;

і { а } [^[:L:][:M:]] > я;
і { е > є;
[аеєиіїоуюя] { і > ї;
шч > щ;
й { й > ;

[бпвмфгґкхр] { йа > \\'я;
[бпвмфгґкхр] { йе > \\'є;
[бпвмфгґкхр] { йі > \\'ї;
[бпвмфгґкхр] { йу > \\'ю;

йа > я;
йе > є;
йі > ї;
йу > ю;

::Null;

[^[:L:][:M:]] { й } [бвгґджзклмнпрстфхцчшщ] > і;
[бвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[бвгґджзклмнпрстфхцчшщ] { й } [бвгґджзклмнпрстфхцчшщ] > і;

::Null;

[жчшщ] { я > а;
[жчшщ] { ю > у;
[жчшщ] { є > е;

[бпвмфгґкхр] { ь } [яюєї] > \\';
[бпвмфгґкхр] { Ь } [яюєї] > \\';

[аеєиіїоуюя] { ь > ;
[^[:L:][:M:]] { ь > ;
[жчшщ] { ь > ;
ь } ь > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] > ;
[аеєиіїоуюя] { ['’‘\`´ʼ] > ;
['’‘\`´ʼ] { ь > ;
ь } ['’‘\`´ʼ] > ;
['’‘\`´ʼ] { ['’‘\`´ʼ] > ;

::Title;
`;
