export const latnBgRules = `
::Null;

dž > дж;
Dž > Дж;
dŽ > дЖ;
DŽ > ДЖ;

dz > дз;
Dz > Дз;
dZ > дЗ;
DZ > ДЗ;

ts > ц;
Ts > Ц;
tS > Ц;
TS > Ц;

th > т;
Th > Т;
tH > т;
TH > Т;

gh > г;
Gh > Г;
gH > г;
GH > Г;

kh > х;
Kh > Х;
kH > х;
KH > Х;

ij > ей;
Ij > Ей;
iJ > еЙ;
IJ > ЕЙ;

::Null;

[:^Letter:] { \\' > ;
\\' } [:^Letter:] > ;
\\' > ъ;
· > ;

ńa > ня;
Ńa > Ня;
ńA > нЯ;
ŃA > НЯ;

ńu > ню;
Ńu > Ню;
ńU > нЮ;
ŃU > НЮ;

ńo > ньо;
Ńo > Ньо;
ńO > ньО;
ŃO > НЬО;

ńe > не;
Ńe > Не;
ńE > нЕ;
ŃE > НЕ;

ńi > ни;
Ńi > Ни;
ńI > нИ;
ŃI > НИ;

ľa > ля;
Ľa > Ля;
ľA > лЯ;
ĽA > ЛЯ;

ľu > лю;
Ľu > Лю;
ľU > лЮ;
ĽU > ЛЮ;

ľo > льо;
Ľo > Льо;
ľO > льО;
ĽO > ЛЬО;

ľe > ле;
Ľe > Ле;
ľE > лЕ;
ĽE > ЛЕ;

ľi > ли;
Ľi > Ли;
ľI > лИ;
ĽI > ЛИ;

[iиIИ] { a } [:^Letter:] > я;
[iиIИ] { A } [:^Letter:] > Я;

ya > я;
Ya > Я;
yA > Я;
YA > Я;

yu > ю;
Yu > Ю;
yU > Ю;
YU > Ю;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { yo > ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { yO > ьО;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Yo > Ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { YO > ЬО;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { y [eä] > ие;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Y [eä] > Ие;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { y [EÄ] > иЕ;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Y [EÄ] > ИЕ;

y [eä] > е;
Y [eä] > Е;
y [EÄ] > Е;
Y [EÄ] > Е;

yo > йо;
Yo > Йо;
yO > йО;
YO > ЙО;

št > щ;
Št > Щ;
šT > Щ;
ŠT > Щ;

đ > дж;
Đ } [:Ll:] > Дж;
Đ > ДЖ;

ń > нь;
Ń } [:Ll:] > Нь;
Ń > НЬ;

ľ > ль;
Ľ } [:Ll:] > Ль;
Ľ > ЛЬ;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ö > ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Ö } [:Ll:] > Ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Ö > ЬО;

ö > йо;
Ö } [:Ll:] > Йо;
Ö > ЙО;

ü > ю;
Ü > Ю;

ï > ъ;
Ï > Ъ;

[ćč] > ч;
[ĆČ] > Ч;

š > ш;
Š > Ш;

ž > ж;
Ž > Ж;

x > х;
X > Х;

y > й;
Y > Й;

a > а;
A > А;

b > б;
B > Б;

d > д;
D > Д;

[eä] > е;
[EÄ] > Е;

f > ф;
F > Ф;

g > г;
G > Г;

h > х;
H > Х;

i > и;
I > И;

[kq] > к;
[KQ] > К;

l > л;
L > Л;

m > м;
M > М;

n > н;
N > Н;

o > о;
O > О;

p > п;
P > П;

r > р;
R > Р;

s > с;
S > С;

t > т;
T > Т;

[uÿ] > у;
[UŸ] > У;

[vw] > в;
[VW] > В;

z > з;
Z > З;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [Йй] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Фф] { [Фф] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й } [:^Letter:] > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й } [:^Letter:] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [^бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [^бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [:^Letter:] > ;
[ьЬ] } [^оО] > ;
ъ } [:^Letter:] > и;
Ъ } [:^Letter:] > И;

::Null;

[йя] а > я;
[ЙЯ] а > Я;
[йя] А > Я;
[ЙЯ] А > Я;

[йю] у > ю;
[ЙЮ] у > Ю;
[йю] У > Ю;
[ЙЮ] У > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
