export const latnElRules = `
::Null;

DŽ > ΤΖ;
Dž > Τζ;
dž > τζ;

DZ > ΤΖ;
Dz > Τζ;
dz > τζ;

TS > ΤΣ;
Ts } [^[:L:][:M:]] > Τς;
Ts > Τσ;
ts } [^[:L:][:M:]] > τς;
ts > τσ;

TH > Θ;
Th > Θ;
th > θ;

GH > Γ;
Gh > Γ;
gh > γ;

[:L:] { NG } [:L:] > ΓΓ;
[:L:] { Ng } [:L:] > Γγ;
[:L:] { ng } [:L:] > γγ;

KH > Χ;
Kh > Χ;
kh > χ;

IJ > ΕΙ;
Ij > Ει;
ij > ει;

::Null;

[ČĆ] } [:Ll:] > Τσ;
[ČĆ] > ΤΣ;
[čć] } [^[:L:][:M:]] > τς;
[čć] > τσ;

Đ } [:Ll:] > Τζ;
Đ > ΤΖ;
đ > τζ;

B } [:Ll:] > Μπ;
B > ΜΠ;
b > μπ;

D } [:Ll:] > Ντ;
D > ΝΤ;
d > ντ;

G } [:Ll:] > Γκ;
G > ΓΚ;
g > γκ;

U } [:Ll:] > Ου;
U > ΟΥ;
u > ου;

Ľ } [:Ll:] > Λι;
Ľ > ΛΙ;
ľ > λι;

Ń } [:Ll:] > Νι;
Ń > ΝΙ;
ń > νι;

[sš] } [^[:L:][:M:]] > ς;
[sš] > σ;
[SŠ] > Σ;
[zž] > ζ;
[ZŽ] > Ζ;
[hx] > χ;
[HX] > Χ;
[kq] > κ;
[KQ] > Κ;
[vw] > β;
[VW] > Β;

a > α;
A > Α;
[äeö] > ε;
[ÄEÖ] > Ε;
[iïüÿy] > ι;
[IÏÜŸY] > Ι;
o > ο;
O > Ο;
f > φ;
F > Φ;
l > λ;
L > Λ;
m > μ;
M > Μ;
n > ν;
N > Ν;
p > π;
P > Π;
r > ρ;
R > Ρ;
t > τ;
T > Τ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;

::Null;

ς } [:L:] > σ;
σ } [^[:L:][:M:]] > ς;
`;
