export const latnUkRules = `
::Null;

dž > дж;
Dž > Дж;
DŽ > ДЖ;

dz > дз;
Dz > Дз;
DZ > ДЗ;

ts > ц;
Ts > Ц;
TS > Ц;

th > т;
Th > Т;
TH > Т;

gh > г;
Gh > Г;
GH > Г;

ng > нг;
Ng > Нг;
NG > НГ;

kh > х;
Kh > Х;
KH > Х;

ij > ей;
Ij > Ей;
IJ > ЕЙ;

::Null;

[БбПпВвМмФфГгҐґКкХхРр] { ya > \\'я;
[БбПпВвМмФфГгҐґКкХхРр] { Ya > \\'Я;
[БбПпВвМмФфГгҐґКкХхРр] { YA > \\'Я;
[БбПпВвМмФфГгҐґКкХхРр] { ye > \\'є;
[БбПпВвМмФфГгҐґКкХхРр] { Ye > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { YE > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { yu > \\'ю;
[БбПпВвМмФфГгҐґКкХхРр] { Yu > \\'Ю;
[БбПпВвМмФфГгҐґКкХхРр] { YU > \\'Ю;
[БбПпВвМмФфГгҐґКкХхРр] { yi > \\'ї;
[БбПпВвМмФфГгҐґКкХхРр] { Yi > \\'Ї;
[БбПпВвМмФфГгҐґКкХхРр] { YI > \\'Ї;
[БбПпВвМмФфГгҐґКкХхРр] { yä > \\'є;
[БбПпВвМмФфГгҐґКкХхРр] { Yä > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { YÄ > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { yö > \\'є;
[БбПпВвМмФфГгҐґКкХхРр] { Yö > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { YÖ > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { yü > \\'ю;
[БбПпВвМмФфГгҐґКкХхРр] { Yü > \\'Ю;
[БбПпВвМмФфГгҐґКкХхРр] { YÜ > \\'Ю;
[БбПпВвМмФфГгҐґКкХхРр] { yï > \\'ї;
[БбПпВвМмФфГгҐґКкХхРр] { Yï > \\'Ї;
[БбПпВвМмФфГгҐґКкХхРр] { YÏ > \\'Ї;

ńa > ня;
Ńa > Ня;
ŃA > НЯ;
ńe > нє;
Ńe > Нє;
ŃE > НЄ;
ńu > ню;
Ńu > Ню;
ŃU > НЮ;
ńi > ні;
Ńi > Ні;
ŃI > НІ;
ńo > ньо;
Ńo > Ньо;
ŃO > НЬО;
ńä > нє;
Ńä > Нє;
ŃÄ > НЄ;
ńö > нє;
Ńö > Нє;
ŃÖ > НЄ;
ńü > ню;
Ńü > Ню;
ŃÜ > НЮ;
ńï > ни;
Ńï > Ни;
ŃÏ > НИ;
ľa > ля;
Ľa > Ля;
ĽA > ЛЯ;
ľe > лє;
Ľe > Лє;
ĽE > ЛЄ;
ľu > лю;
Ľu > Лю;
ĽU > ЛЮ;
ľi > лі;
Ľi > Лі;
ĽI > ЛІ;
ľo > льо;
Ľo > Льо;
ĽO > ЛЬО;
ľä > лє;
Ľä > Лє;
ĽÄ > ЛЄ;
ľö > лє;
Ľö > Лє;
ĽÖ > ЛЄ;
ľü > лю;
Ľü > Лю;
ĽÜ > ЛЮ;
ľï > ли;
Ľï > Ли;
ĽÏ > ЛИ;
ya > я;
Ya > Я;
YA > Я;
ye > є;
Ye > Є;
YE > Є;
yu > ю;
Yu > Ю;
YU > Ю;
yi > ї;
Yi > Ї;
YI > Ї;
yo > йо;
Yo > Йо;
YO > ЙО;
yä > є;
Yä > Є;
YÄ > Є;
yö > є;
Yö > Є;
YÖ > Є;
yü > ю;
Yü > Ю;
YÜ > Ю;
yï > ї;
Yï > Ї;
YÏ > Ї;

Ń } [:Ll:] > Нь;
Ń > НЬ;
ń > нь;
Ľ } [:Ll:] > Ль;
Ľ > ЛЬ;
ľ > ль;
Đ } [:Ll:] > Дж;
Đ > ДЖ;
đ > дж;
š > ш;
Š > Ш;
č > ч;
Č > Ч;
ž > ж;
Ž > Ж;
ć > ч;
Ć > Ч;
x > х;
X > Х;
y > й;
Y > Й;
ÿ > ї;
Ÿ > Ї;
b > б;
B > Б;
d > д;
D > Д;
f > ф;
F > Ф;
g > ґ;
G > Ґ;
h > г;
H > Г;
k > к;
K > К;
l > л;
L > Л;
m > м;
M > М;
n > н;
N > Н;
p > п;
P > П;
q > к;
Q > К;
r > р;
R > Р;
s > с;
S > С;
t > т;
T > Т;
v > в;
V > В;
w > в;
W > В;
z > з;
Z > З;
a > а;
A > А;
e > е;
E > Е;
i > і;
I > І;
o > о;
O > О;
u > у;
U > У;
ä > е;
Ä > Е;
ö > е;
Ö > Е;
ü > ю;
Ü > Ю;
ï > и;
Ï > И;

['·] > \\';

::Null;

і { а } [:^Letter:] > я;
І { а } [:^Letter:] > я;
і { А } [:^Letter:] > Я;
І { А } [:^Letter:] > Я;

і { е > є;
І { е > є;
і { Е > Є;
І { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

ШЧ > Щ;
Шч > Щ;
шЧ > щ;
шч > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { йа > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { йА > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { Йа > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { ЙА > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { йе > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { йЕ > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { Йе > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { ЙЕ > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { йі > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { йІ > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { Йі > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { ЙІ > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { йу > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { йУ > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { Йу > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { ЙУ > \\'Ю;

йа > я;
йА > Я;
Йа > Я;
ЙА > Я;

йе > є;
йЕ > Є;
Йе > Є;
ЙЕ > Є;

йі > ї;
йІ > Ї;
Йі > Ї;
ЙІ > Ї;

йу > ю;
йУ > Ю;
Йу > Ю;
ЙУ > Ю;

::Null;

[:^Letter:] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[:^Letter:] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [:^Letter:] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [:^Letter:] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { ь } [ЯЮЄЇяюєї] > \\';
[БПВМФГҐКХРбпвмфгґкхр] { Ь } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюя] { ь > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { Ь > ;
[:^Letter:] { ь > ;
[:^Letter:] { Ь > ;
[ЖЧШЩжчшщ] { ь > ;
[ЖЧШЩжчшщ] { Ь > ;
[Ьь] } [Ьь] > ;

[:^Letter:] { \\' > ;
\\' } [:^Letter:] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
