export const latnRuRules = `
::Null;

DŽ > ДЖ;
dŽ > дЖ;
Dž > Дж;
dž > дж;

DZ > ДЗ;
dZ > дЗ;
Dz > Дз;
dz > дз;

T [sS] > Ц;
t [sS] > ц;

T [hH] > Т;
t [hH] > т;

G [hH] > Г;
g [hH] > г;

K [hH] > Х;
k [hH] > х;

Š [čČ] > Щ;
š [čČ] > щ;

[^[:L:][:M:]] { IJ > ЭЙ;
[^[:L:][:M:]] { iJ > эЙ;
[^[:L:][:M:]] { Ij > Эй;
[^[:L:][:M:]] { ij > эй;
[АЕИЫОЁУЮЯаеиыоёуюя] { IJ > ЭЙ;
[АЕИЫОЁУЮЯаеиыоёуюя] { iJ > эЙ;
[АЕИЫОЁУЮЯаеиыоёуюя] { Ij > Эй;
[АЕИЫОЁУЮЯаеиыоёуюя] { ij > эй;
IJ > ЕЙ;
iJ > еЙ;
Ij > Ей;
ij > ей;

::Null;

[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YA > ЬЯ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yA > ьЯ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Ya > Ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { ya > ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [EÄ] > ЬЕ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [EÄ] > ьЕ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [eä] > Ье;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [eä] > ье;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [IÏ] > ЬИ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [IÏ] > ьИ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [iï] > Ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [iï] > ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [OÖ] > ЬЁ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [OÖ] > ьЁ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [oö] > Ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [oö] > ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [UÜ] > ЬЮ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [UÜ] > ьЮ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [uü] > Ью;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [uü] > ью;

Y [aA] > Я;
y [aA] > я;

Y [eäEÄ] > Е;
y [eäEÄ] > е;

Y [iI] > И;
y [iI] > и;

Y [ïÏ] > ЙЫ;
y [ïÏ] > йы;

Y [uüUÜ] > Ю;
y [uüUÜ] > ю;

[^[:L:][:M:]] { [EÄ] > Э;
[^[:L:][:M:]] { [eä] > э;
[АЕИЫОЁУЮЯаеиыоёуюя] { [EÄ] > Э;
[АЕИЫОЁУЮЯаеиыоёуюя] { [eä] > э;

Ľ [AÄ] > ЛЯ;
ľ [AÄ] > лЯ;
Ľ [aä] > Ля;
ľ [aä] > ля;

ĽE > ЛЕ;
ľE > лЕ;
Ľe > Ле;
ľe > ле;

ĽI > ЛИ;
ľI > лИ;
Ľi > Ли;
ľi > ли;

Ľ [OÖ] > ЛЁ;
ľ [OÖ] > лЁ;
Ľ [oö] > Лё;
ľ [oö] > лё;

Ľ [UÜ] > ЛЮ;
ľ [UÜ] > лЮ;
Ľ [uü] > Лю;
ľ [uü] > лю;

Ń [AÄ] > НЯ;
ń [AÄ] > нЯ;
Ń [aä] > Ня;
ń [aä] > ня;

ŃE > НЕ;
ńE > нЕ;
Ńe > Не;
ńe > не;

ŃI > НИ;
ńI > нИ;
Ńi > Ни;
ńi > ни;

Ń [OÖ] > НЁ;
ń [OÖ] > нЁ;
Ń [oö] > Нё;
ń [oö] > нё;

Ń [UÜ] > НЮ;
ń [UÜ] > нЮ;
Ń [uü] > Ню;
ń [uü] > ню;

[:Lu:] { Đ > ДЖ;
Đ } [:Lu:] > ДЖ;
Đ > Дж;
đ > дж;

[:Lu:] { Ľ > ЛЬ;
Ľ } [:Lu:] > ЛЬ;
Ľ > Ль;
ľ > ль;

[:Lu:] { Ń > НЬ;
Ń } [:Lu:] > НЬ;
Ń > Нь;
ń > нь;

A > А;
a > а;

B > Б;
b > б;

[ČĆ] > Ч;
[čć] > ч;

D > Д;
d > д;

[EÄ] > Е;
[eä] > е;

F > Ф;
f > ф;

G > Г;
g > г;

[HX] > Х;
[hx] > х;

I > И;
i > и;

Ï > Ы;
ï > ы;

[KQ] > К;
[kq] > к;

L > Л;
l > л;

M > М;
m > м;

N > Н;
n > н;

O > О;
o > о;

Ö > Ё;
ö > ё;

P > П;
p > п;

R > Р;
r > р;

S > С;
s > с;

Š > Ш;
š > ш;

T > Т;
t > т;

U > У;
u > у;

[ÜŸ] > Ю;
[üÿ] > ю;

[VW] > В;
[vw] > в;

Y > Й;
y > й;

Z > З;
z > з;

Ž > Ж;
ž > ж;

[^[:L:][:M:]] { ['·] > ;
['·] } [^[:L:][:M:]] > ;
\\' > ь;
· > ъ;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[лЛ] { л } [^[:L:][:M:]] > ль;
[лЛ] { Л } [^[:L:][:M:]] > ЛЬ;
[лЛ] { л } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > ль;
[лЛ] { Л } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > ЛЬ;

[Ёё] { [Ёё] > ;
[Йй] { [Йй] > ;
[Хх] { [Хх] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ыы] { [Ыы] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;

::Null;

[щЩъЪыЫьЬ] { [ий] [аА] > я;
[щЩъЪыЫьЬ] { [ИЙ] [аА] > Я;
[щЩъЪыЫьЬ] { [ий] [оО] > ё;
[щЩъЪыЫьЬ] { [ИЙ] [оО] > Ё;
[щЩъЪыЫьЬ] { [ий] [еЕ] > е;
[щЩъЪыЫьЬ] { [ИЙ] [еЕ] > Е;
[щЩъЪыЫьЬ] { [ий] [уУ] > ю;
[щЩъЪыЫьЬ] { [ИЙ] [уУ] > Ю;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йа > ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йА > ьЯ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йа > Ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙА > ЬЯ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йО > ьЁ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йо > Ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙО > ЬЁ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йе > ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЕ > ьЕ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йе > Ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЕ > ЬЕ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йу > ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йУ > ьЮ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йу > Ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙУ > ЬЮ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йи > ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йИ > ьИ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йи > Ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙИ > ЬИ;

й [иИ] > и;
Й [иИ] > И;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [^[:L:][:M:]] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [^[:L:][:M:]] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { и } [^[:L:][:M:]] > й;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { И } [^[:L:][:M:]] > Й;

::Null;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] > ;
[ъЪ] } [^[:L:][:M:]] > ;
[ъЪ] } [аоуэыиАОУЭЫИ] > ;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { [ъЪ] > ;
[^[:L:][:M:]] { [ъЪьЬ] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
