export const latnRuRules = `
::Null;

DŽ > ДЖ;
Dž > Дж;
dž > дж;

DZ > ДЗ;
Dz > Дз;
dz > дз;

TS > Ц;
Ts > Ц;
ts > ц;

TH > Т;
Th > Т;
th > т;

GH > Г;
Gh > Г;
gh > г;

KH > Х;
Kh > Х;
kh > х;

ŠČ > Щ;
Šč > Щ;
šč > щ;

[:^Letter:] { IJ > ЭЙ;
[АЕИЫОЁУЮЯаеиыоёуюя] { IJ > ЭЙ;
IJ > ЕЙ;
[:^Letter:] { Ij > Эй;
[АЕИЫОЁУЮЯаеиыоёуюя] { Ij > Эй;
Ij > Ей;
[:^Letter:] { ij > эй;
[АЕИЫОЁУЮЯаеиыоёуюя] { ij > эй;
ij > ей;

::Null;

[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [AÄ] > ЬЯ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [aä] > Ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [aä] > ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YE > ЬЕ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Ye > Ье;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { ye > ье;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [IÏ] > ЬИ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [iï] > Ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [iï] > ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [OÖ] > ЬЁ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [oö] > Ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [oö] > ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [UÜ] > ЬЮ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Y [uü] > Ью;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { y [uü] > ью;

Y [AÄ] > Я;
Y [aä] > Я;
y [aä] > я;

YE > Е;
Ye > Е;
ye > е;

YI > И;
Yi > И;
yi > и;

YÏ > ЙЫ;
Yï > Йы;
yï > йы;

Y [UÜ] > Ю;
Y [uü] > Ю;
y [uü] > ю;

[:^Letter:] { [EÄ] > Э;
[:^Letter:] { [eä] > э;
[АЕИЫОЁУЮЯаеиыоёуюя] { [EÄ] > Э;
[АЕИЫОЁУЮЯаеиыоёуюя] { [eä] > э;

ĽA > ЛЯ;
Ľa > Ля;
ľa > ля;
ĽÄ > ЛЯ;
Ľä > Ля;
ľä > ля;
ĽE > ЛЕ;
Ľe > Ле;
ľe > ле;
ĽI > ЛИ;
Ľi > Ли;
ľi > ли;
ĽO > ЛЁ;
Ľo > Лё;
ľo > лё;
ĽÖ > ЛЁ;
Ľö > Лё;
ľö > лё;
ĽU > ЛЮ;
Ľu > Лю;
ľu > лю;
ĽÜ > ЛЮ;
Ľü > Лю;
ľü > лю;

ŃA > НЯ;
Ńa > Ня;
ńa > ня;
ŃÄ > НЯ;
Ńä > Ня;
ńä > ня;
ŃE > НЕ;
Ńe > Не;
ńe > не;
ŃI > НИ;
Ńi > Ни;
ńi > ни;
ŃO > НЁ;
Ńo > Нё;
ńo > нё;
ŃÖ > НЁ;
Ńö > Нё;
ńö > нё;
ŃU > НЮ;
Ńu > Ню;
ńu > ню;
ŃÜ > НЮ;
Ńü > Ню;
ńü > ню;

Đ } [:Ll:] > Дж;
Đ > ДЖ;
đ > дж;

Ľ } [:Ll:] > Ль;
Ľ > ЛЬ;
ľ > ль;

Ń } [:Ll:] > Нь;
Ń > НЬ;
ń > нь;

A > А;
a > а;

B > Б;
b > б;

[ČĆ] > Ч;
[čć] > ч;

D > Д;
d > д;

[EÄ] > Е;
[eä] > е;

F > Ф;
f > ф;

G > Г;
g > г;

[HX] > Х;
[hx] > х;

I > И;
i > и;

Ï > Ы;
ï > ы;

[KQ] > К;
[kq] > к;

L > Л;
l > л;

M > М;
m > м;

N > Н;
n > н;

O > О;
o > о;

Ö > Ё;
ö > ё;

P > П;
p > п;

R > Р;
r > р;

S > С;
s > с;

Š > Ш;
š > ш;

T > Т;
t > т;

[UŸ] > У;
[uÿ] > у;

Ü > Ю;
ü > ю;

[VW] > В;
[vw] > в;

Y > Й;
y > й;

Z > З;
z > з;

Ž > Ж;
ž > ж;

[:^Letter:] { ['·] > ;
['·] } [:^Letter:] > ;
\\' > ь;
· > ъ;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[Ёё] { [Ёё] > ;
[Йй] { [Йй] > ;
[Хх] { [Хх] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ыы] { [Ыы] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;

::Null;

[щЩъЪыЫьЬ] { [ий] [аА] > я;
[щЩъЪыЫьЬ] { [ИЙ] [аА] > Я;
[щЩъЪыЫьЬ] { [ий] [оО] > ё;
[щЩъЪыЫьЬ] { [ИЙ] [оО] > Ё;
[щЩъЪыЫьЬ] { [ий] [еЕ] > е;
[щЩъЪыЫьЬ] { [ИЙ] [еЕ] > Е;
[щЩъЪыЫьЬ] { [ий] [уУ] > ю;
[щЩъЪыЫьЬ] { [ИЙ] [уУ] > Ю;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йа > ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йА > ьЯ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йа > Ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙА > ЬЯ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йО > ьЁ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йо > Ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙО > ЬЁ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йе > ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЕ > ьЕ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йе > Ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЕ > ЬЕ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йу > ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йУ > ьЮ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йу > Ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙУ > ЬЮ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йи > ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йИ > ьИ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йи > Ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙИ > ЬИ;

й [иИ] > и;
Й [иИ] > И;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [:^Letter:] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [:^Letter:] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { и } [:^Letter:] > й;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { И } [:^Letter:] > Й;

::Null;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] > ;
[ъЪ] } [:^Letter:] > ;
[ъЪ] } [аоуэыиАОУЭЫИ] > ;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { [ъЪ] > ;
[:^Letter:] { [ъЪьЬ] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
