export const latnKkRules = `
::Null;

DŽ > ДЖ;
Dž > Дж;
dŽ > дЖ;
dž > дж;

DZ > ДЗ;
Dz > Дз;
dZ > дЗ;
dz > дз;

TS > Ц;
Ts > Ц;
tS > ц;
ts > ц;

TH > Т;
Th > Т;
tH > т;
th > т;

GH > Ғ;
Gh > Ғ;
gH > ғ;
gh > ғ;

KH > Х;
Kh > Х;
kH > х;
kh > х;

IJ > ЕЙ;
Ij > Ей;
iJ > еЙ;
ij > ей;

::Null;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { YA > ЬЯ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Ya > Ья;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ya > ья;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Y [EÄ] > ЬЕ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Y [eä] > Ье;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { y [eä] > ье;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Y [IÏ] > ЬИ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Y [iï] > Ьи;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { y [iï] > ьи;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Y [OÖ] > ЬЁ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Y [oö] > Ьё;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { y [oö] > ьё;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Y [UÜ] > ЬЮ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Y [uü] > Ью;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { y [uü] > ью;

YA > Я;
Ya > Я;
ya > я;

Y [UÜ] > Ю;
Y [uü] > Ю;
y [uü] > ю;

Y [EÄ] > Е;
Y [eä] > Е;
y [eä] > е;

Ľ } [:Ll:] > Ль;
Ľ > ЛЬ;
ľ > ль;

Ń } [:Ll:] > Нь;
Ń > НЬ;
ń > нь;

Đ } [:Ll:] > Дь;
Đ > ДЬ;
đ > дь;

[:Lu:] { \\' > Ъ;
\\' } [:Lu:] > Ъ;
\\' > ъ;

[АӘОӨУҰҮЫІЭЮЯЁаәоөуұүыіэюяё] { E > Э;
[АӘОӨУҰҮЫІЭЮЯЁаәоөуұүыіэюяё] { e > э;
[:L:] { E > Е;
[:L:] { e > е;
E > Э;
e > э;

[Ьь] { A > Я;
[Ьь] { a > я;
[Ии] { A } [^[:L:][:M:]] > Я;
[Ии] { a } [^[:L:][:M:]] > я;

A > А;
a > а;

Ä > Ә;
ä > ә;

B > Б;
b > б;

V > В;
v > в;

G > Г;
g > г;

D > Д;
d > д;

F > Ф;
f > ф;

[ČĆ] > Ч;
[čć] > ч;

H > Һ;
h > һ;

I > И;
i > и;

Ï > Ы;
ï > ы;

K > К;
k > к;

L > Л;
l > л;

M > М;
m > м;

N > Н;
n > н;

O > О;
o > о;

Ö > Ө;
ö > ө;

P > П;
p > п;

Q > Қ;
q > қ;

R > Р;
r > р;

S > С;
s > с;

Š > Ш;
š > ш;

T > Т;
t > т;

U > Ұ;
u > ұ;

[ÜŸ] > Ү;
[üÿ] > ү;

W > У;
w > у;

X > Х;
x > х;

Y > Й;
y > й;

Z > З;
z > з;

Ž > Ж;
ž > ж;

· > \\-;

::Null;

[^[:L:][:M:]] { Ң > Н;
[^[:L:][:M:]] { ң > н;

[ҮҰ] У > У;
[ҮҰ] у > У;
[үұ] У > У;
[үұ] у > у;

::Null;

[Әә] { [Әә] > ;
[Өө] { [Өө] > ;
[Уу] { [Уу] > ;
[Үү] { [Үү] > ;
[Ұұ] { [Ұұ] > ;
[Іі] { [Іі] > ;
[Ғғ] { [Ғғ] > ;
[Ңң] { [Ңң] > ;
[Һһ] { [Һһ] > ;
[Ёё] { [Ёё] > ;
[Щщ] { [Щщ] > ;
[Йй] { [Йй] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
[ъЪ] } [^[:L:][:M:]] > ;
[аәеёиоөуұүъыіэюяАӘЕЁИОӨУҰҮЪЫІЭЮЯ] { [ъЪ] } [аәеёиоөуұүъыіэюяАӘЕЁИОӨУҰҮЪЫІЭЮЯ] > ;

::Null;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йа > ья;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йА > ьЯ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йа > Ья;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙА > ЬЯ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йо > ьё;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йО > ьЁ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йо > Ьё;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙО > ЬЁ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йе > ье;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йЕ > ьЕ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йе > Ье;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙЕ > ЬЕ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йу > ью;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йУ > ьЮ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йу > Ью;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙУ > ЬЮ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йи > ьи;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йИ > ьИ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йи > Ьи;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙИ > ЬИ;

[^[:L:][:M:]] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > и;
[^[:L:][:M:]] { Й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > И;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { й } [^[:L:][:M:]] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Й } [^[:L:][:M:]] > И;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > И;

::Null;

Қ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > К;
қ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > к;
Ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > Г;
ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > г;

[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { Қ > К;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { қ > к;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { Ғ > Г;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { ғ > г;
`;
