export const latnMkRules = `
::Null;

DŽ > Џ;
Dž > Џ;
dŽ > џ;
dž > џ;

DZ > Ѕ;
Dz > Ѕ;
dZ > ѕ;
dz > ѕ;

TS > Ц;
Ts > Ц;
ts > ц;

IJ > ЕЈ;
Ij > Еј;
ij > еј;

TH > Т;
Th > Т;
th > т;

GH > Г;
Gh > Г;
gh > г;

KH > Х;
Kh > Х;
kh > х;

::Null;

[:^Letter:] { \\' > ;
\\' } [:^Letter:] > ;
· > ;

LY > Љ;
Ly > Љ;
lY > љ;
ly > љ;

NY > Њ;
Ny > Њ;
nY > њ;
ny > њ;

Š > Ш;
š > ш;

Č > Ч;
č > ч;

Ž > Ж;
ž > ж;

Ć > Ќ;
ć > ќ;

Đ > Ѓ;
đ > ѓ;

X > Х;
x > х;

Y > Ј;
y > ј;

Ń > Њ;
ń > њ;

Ľ > Љ;
ľ > љ;

A > А;
a > а;

[EÄÖ] > Е;
[eäö] > е;

[IÜÏŸ] > И;
[iüïÿ] > и;

O > О;
o > о;

U > У;
u > у;

B > Б;
b > б;

D > Д;
d > д;

F > Ф;
f > ф;

G > Г;
g > г;

H > Х;
h > х;

[KQ] > К;
[kq] > к;

L > Л;
l > л;

M > М;
m > м;

N > Н;
n > н;

P > П;
p > п;

R > Р;
r > р;

S > С;
s > с;

T > Т;
t > т;

[VW] > В;
[vw] > в;

Z > З;
z > з;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

лј > љ;
Лј > Љ;
ЛЈ > Љ;
лЈ > љ;
нј > њ;
Нј > Њ;
НЈ > Њ;
нЈ > њ;
дз > ѕ;
Дз > Ѕ;
ДЗ > Ѕ;
дЗ > ѕ;
дж > џ;
Дж > Џ;
ДЖ > Џ;
дЖ > џ;

Ји > И;
ЈИ > И;
ји > и;
јИ > И;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { ј } [еЕоО] > ;
[АЕИОУаеиоу] { Ј } [еЕоО] > ;

[:^Letter:] { ['’‘\`´ʼ] } [рР] > ;

[:^Letter:] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[:^Letter:] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [:^Letter:] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [:^Letter:] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
