export const latnMkRules = `
::Null;

D [Žž] > Џ;
d [Žž] > џ;

D [Zz] > Ѕ;
d [Zz] > ѕ;

T [Ss] > Ц;
t [Ss] > ц;

IJ > ЕЈ;
iJ > еЈ;
Ij > Еј;
ij > еј;

T [Hh] > Т;
t [Hh] > т;

G [Hh] > Г;
g [Hh] > г;

K [Hh] > Х;
k [Hh] > х;

::Null;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
· > ;

L [Yy] > Љ;
l [Yy] > љ;

N [Yy] > Њ;
n [Yy] > њ;

Š > Ш;
š > ш;

Č > Ч;
č > ч;

Ž > Ж;
ž > ж;

Ć > Ќ;
ć > ќ;

Đ > Ѓ;
đ > ѓ;

X > Х;
x > х;

Y > Ј;
y > ј;

Ń > Њ;
ń > њ;

Ľ > Љ;
ľ > љ;

A > А;
a > а;

[EÄ] > Е;
[eä] > е;

[IÏ] > И;
[iï] > и;

[OÖ] > О;
[oö] > о;

[UÜŸ] > У;
[uüÿ] > у;

B > Б;
b > б;

D > Д;
d > д;

F > Ф;
f > ф;

G > Г;
g > г;

H > Х;
h > х;

[KQ] > К;
[kq] > к;

L > Л;
l > л;

M > М;
m > м;

N > Н;
n > н;

P > П;
p > п;

R > Р;
r > р;

S > С;
s > с;

T > Т;
t > т;

[VW] > В;
[vw] > в;

Z > З;
z > з;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

Л [јЈ] > Љ;
л [јЈ] > љ;
Н [јЈ] > Њ;
н [јЈ] > њ;
Д [зЗ] > Ѕ;
д [зЗ] > ѕ;
Д [жЖ] > Џ;
д [жЖ] > џ;

Ј [иИ] > И;
ј [иИ] > и;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { [јЈ] } [еЕоО] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] } [рР] > ;

[^[:L:][:M:]] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[^[:L:][:M:]] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [^[:L:][:M:]] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [^[:L:][:M:]] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
