export const latnHyRules = `
::Null;

DŽ > Ջ;
Dž > Ջ;
dž > ջ;

DZ > Ձ;
Dz > Ձ;
dz > ձ;

GH > Ղ;
Gh > Ղ;
gh > ղ;

IJ > ԷՅ;
Ij > Էյ;
ij > էյ;

KH > Խ;
Kh > Խ;
kh > խ;

NG > ՆԳ;
Ng > Նգ;
ng > նգ;

TH > Թ;
Th > Թ;
th > թ;

TS > Ց;
Ts > Ց;
ts > ց;

::Null;

[^[:L:][:M:]] { E > Է;
[^[:L:][:M:]] { e > է;
[^[:L:][:M:]] { O > Օ;
[^[:L:][:M:]] { o > օ;

[:Lu:] { [UÜŸ] > ՈՒ;
[UÜŸ] } [:Lu:] > ՈՒ;
[UÜŸ] > Ու;
[uüÿ] > ու;

Ń } [^[:L:][:M:]] > Ն;
ń } [^[:L:][:M:]] > ն;
Ń } [Յյ] > Ն;
ń } [Յյ] > ն;
[:Lu:] { Ń > ՆՅ;
Ń } [:Lu:] > ՆՅ;
Ń > Նյ;
ń > նյ;

Ľ } [^[:L:][:M:]] > Լ;
ľ } [^[:L:][:M:]] > լ;
Ľ } [Յյ] > Լ;
ľ } [Յյ] > լ;
[:Lu:] { Ľ > ԼՅ;
Ľ } [:Lu:] > ԼՅ;
Ľ > Լյ;
ľ > լյ;

A > Ա;
a > ա;
Ä > Է;
ä > է;
B > Բ;
b > բ;
Ć > Ճ;
ć > ճ;
Č > Չ;
č > չ;
D > Դ;
d > դ;
Đ > Ջ;
đ > ջ;
E > Ե;
e > ե;
F > Ֆ;
f > ֆ;
G > Գ;
g > գ;
H > Հ;
h > հ;
I > Ի;
i > ի;
Ï > Ը;
ï > ը;
K > Կ;
k > կ;
L > Լ;
l > լ;
M > Մ;
m > մ;
N > Ն;
n > ն;
O > Ո;
o > ո;
Ö > Օ;
ö > օ;
P > Պ;
p > պ;
Q > Ք;
q > ք;
R > Ր;
r > ր;
S > Ս;
s > ս;
Š > Շ;
š > շ;
T > Տ;
t > տ;
[VW] > Վ;
[vw] > վ;
X > Խ;
x > խ;
Y > Յ;
y > յ;
Z > Զ;
z > զ;
Ž > Ժ;
ž > ժ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
\\' > ՚;
· > ;

::Null;

[^[:L:][:M:]] { ր > ռ;
[^[:L:][:M:]] { Ր > Ռ;
[^[:L:][:M:]] { յի > ի;
[^[:L:][:M:]] { Յի > Ի;
[^[:L:][:M:]] { ՅԻ > Ի;
[^[:L:][:M:]] { յԻ > Ի;
[^[:L:][:M:]] { յե > ե;
[^[:L:][:M:]] { Յե > Ե;
[^[:L:][:M:]] { յԵ > Ե;
[^[:L:][:M:]] { ՅԵ > Ե;
յէ > յե;
Յէ > Յե;
ՅԷ > ՅԵ;
յԷ > յԵ;
յօ > յո;
Յօ > Յո;
ՅՕ > ՅՈ;
յՕ > յՈ;
եօ > եո;
Եօ > Եո;
ԵՕ > ԵՈ;
եՕ > եՈ;
րր > ռռ;
Րր > Ռռ;
րՐ > ռՌ;
ՐՐ > ՌՌ;
յյ > յ;
յՅ > յ;
Յյ > Յ;
ՅՅ > Յ;
[^[:L:][:M:]] { ւ > վ;
[^[:L:][:M:]] { Ւ > Վ;
[^ոՈ] { ւ > վ;
[^ոՈ] { Ւ > Վ;
`;
