export const latnTgRules = `
::Null;

[^[:L:][:M:]] { IJ > ЭЙ;
[^[:L:][:M:]] { Ij > Эй;
[^[:L:][:M:]] { iJ > эЙ;
[^[:L:][:M:]] { ij > эй;
IJ > ЕЙ;
Ij > Ей;
iJ > еЙ;
ij > ей;

[^[:L:][:M:]] { E > Э;
[^[:L:][:M:]] { e > э;

D [žŽ] > Ҷ;
d [žŽ] > ҷ;

DZ > ДЗ;
Dz > Дз;
dZ > дЗ;
dz > дз;

G [hH] > Ғ;
g [hH] > ғ;

NG > НГ;
Ng > Нг;
nG > нГ;
ng > нг;

K [hH] > Х;
k [hH] > х;

T [sS] > Ц;
t [sS] > ц;

T [hH] > С;
t [hH] > с;

Y [aäAÄ] > Я;
y [aäAÄ] > я;

Y [eE] > Е;
y [eE] > е;

Y [oöOÖ] > Ё;
y [oöOÖ] > ё;

Y [uüUÜ] > Ю;
y [uüUÜ] > ю;

[:Lu:] { Ľ > ЛЬ;
Ľ } [:Lu:] > ЛЬ;
Ľ > Ль;
ľ > ль;

[:Lu:] { Ń > НЬ;
Ń } [:Lu:] > НЬ;
Ń > Нь;
ń > нь;

[:Lu:] { \\' > Ъ;
\\' } [:Lu:] > Ъ;
\\' > ъ;

· > ;

A > А;
a > а;

Ä > Я;
ä > я;

E > Е;
e > е;

I > И;
i > и;

Ï > Ӣ;
ï > ӣ;

O > О;
o > о;

Ö > Ё;
ö > ё;

U > У;
u > у;

Ü > Ю;
ü > ю;

Ÿ > Ӯ;
ÿ > ӯ;

B > Б;
b > б;

D > Д;
d > д;

F > Ф;
f > ф;

G > Г;
g > г;

H > Ҳ;
h > ҳ;

K > К;
k > к;

L > Л;
l > л;

M > М;
m > м;

N > Н;
n > н;

P > П;
p > п;

Q > Қ;
q > қ;

R > Р;
r > р;

S > С;
s > с;

T > Т;
t > т;

[VW] > В;
[vw] > в;

X > Х;
x > х;

Y > Й;
y > й;

Z > З;
z > з;

Š > Ш;
š > ш;

Ž > Ж;
ž > ж;

Đ > Ҷ;
đ > ҷ;

[ĆČ] > Ч;
[ćč] > ч;



::Null;

[:Lu:] { Щ > ШЧ;
Щ } [:Lu:] > ШЧ;
Щ > Шч;
щ > шч;

Ц > С;
ц > с;

Ы > И;
ы > и;

[Ьь] > ;

::Null;

[^[:L:][:M:]] { [Ъъ] > ;
[Ъъ] } [^[:L:][:M:]] > ;

::Null;

[^[:L:][:M:]] { Ӣ > И;
[^[:L:][:M:]] { ӣ > и;
Ӣ } [[:L:][:M:]] > И;
ӣ } [[:L:][:M:]] > и;

::Null;

[БбВвГгҒғДдЖжЗзЙйКкҚқЛлМмНнПпРрСсТтФфХхҲҳЧчҶҷШш] { Э > Е;
[БбВвГгҒғДдЖжЗзЙйКкҚқЛлМмНнПпРрСсТтФфХхҲҳЧчҶҷШш] { э > е;

::Null;

[ЖжШшЧчҶҷ] { Ю > У;
[ЖжШшЧчҶҷ] { ю > у;
[ЖжШшЧчҶҷ] { Я > А;
[ЖжШшЧчҶҷ] { я > а;
[ЖжШшЧчҶҷ] { Ё > О;
[ЖжШшЧчҶҷ] { ё > о;
`;
