export const latnBgRules = `
::Null;

dž > дж;
Dž > Дж;
dŽ > дЖ;
DŽ > ДЖ;

dz > дз;
Dz > Дз;
dZ > дЗ;
DZ > ДЗ;

t [sS] > ц;
T [sS] > Ц;

t [hH] > т;
T [hH] > Т;

g [hH] > г;
G [hH] > Г;

k [hH] > х;
K [hH] > Х;

ij > ей;
Ij > Ей;
iJ > еЙ;
IJ > ЕЙ;

::Null;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[:Lu:] { \\' > Ъ;
\\' } [:Lu:] > Ъ;
\\' > ъ;
· > ;

ńa > ня;
Ńa > Ня;
ńA > нЯ;
ŃA > НЯ;

ńu > ню;
Ńu > Ню;
ńU > нЮ;
ŃU > НЮ;

ńo > ньо;
Ńo > Ньо;
ńO > ньО;
ŃO > НЬО;

ńe > не;
Ńe > Не;
ńE > нЕ;
ŃE > НЕ;

ńi > ни;
Ńi > Ни;
ńI > нИ;
ŃI > НИ;

ľa > ля;
Ľa > Ля;
ľA > лЯ;
ĽA > ЛЯ;

ľu > лю;
Ľu > Лю;
ľU > лЮ;
ĽU > ЛЮ;

ľo > льо;
Ľo > Льо;
ľO > льО;
ĽO > ЛЬО;

ľe > ле;
Ľe > Ле;
ľE > лЕ;
ĽE > ЛЕ;

ľi > ли;
Ľi > Ли;
ľI > лИ;
ĽI > ЛИ;

[iиIИ] { a } [^[:L:][:M:]] > я;
[iиIИ] { A } [^[:L:][:M:]] > Я;

y [aA] > я;
Y [aA] > Я;

y [uU] > ю;
Y [uU] > Ю;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { y [oö] > ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { y [OÖ] > ьО;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Y [oö] > Ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Y [OÖ] > ЬО;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { y [eä] > ие;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Y [eä] > Ие;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { y [EÄ] > иЕ;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Y [EÄ] > ИЕ;

y [eäEÄ] > е;
Y [eäEÄ] > Е;

yo > йо;
Yo > Йо;
yO > йО;
YO > ЙО;

š [tT] > щ;
Š [tT] > Щ;

[:Lu:] { Đ > ДЖ;
Đ } [:Lu:] > ДЖ;
Đ > Дж;
đ > дж;

[:Lu:] { Ń > НЬ;
Ń } [:Lu:] > НЬ;
Ń > Нь;
ń > нь;

[:Lu:] { Ľ > ЛЬ;
Ľ } [:Lu:] > ЛЬ;
Ľ > Ль;
ľ > ль;

[BCDFGHJKLMNPQRSTVWXZĽŃŠŽĐĆČБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Ö > ЬО;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Ö > Ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ö > ьо;

[:Lu:] { Ö > ЙО;
Ö } [:Lu:] > ЙО;
Ö > Йо;
ö > йо;

[üÿ] > ю;
[ÜŸ] > Ю;

u > у;
U > У;

ï > ъ;
Ï > Ъ;

[ćč] > ч;
[ĆČ] > Ч;

š > ш;
Š > Ш;

ž > ж;
Ž > Ж;

x > х;
X > Х;

y > й;
Y > Й;

a > а;
A > А;

b > б;
B > Б;

d > д;
D > Д;

[eä] > е;
[EÄ] > Е;

f > ф;
F > Ф;

g > г;
G > Г;

h > х;
H > Х;

i > и;
I > И;

[kq] > к;
[KQ] > К;

l > л;
L > Л;

m > м;
M > М;

n > н;
N > Н;

o > о;
O > О;

p > п;
P > П;

r > р;
R > Р;

s > с;
S > С;

t > т;
T > Т;

[vw] > в;
[VW] > В;

z > з;
Z > З;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [ЙйьЬ] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [еиоъЕИОЪ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [еиоъЕИОЪ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { и [аяАЯ] > я;
[аеиоуъюяАЕИОУЪЮЯ] { И [аяАЯ] > Я;
[аеиоуъюяАЕИОУЪЮЯ] { и [уюУЮ] > ю;
[аеиоуъюяАЕИОУЪЮЯ] { И [уюУЮ] > Ю;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ьО > йО;
[аеиоуъюяАЕИОУЪЮЯ] { Ьо > Йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ьЕ > йЕ;
[аеиоуъюяАЕИОУЪЮЯ] { Ье > Йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;

::Null;

[йя] [аА] > я;
[ЙЯ] [аА] > Я;

[йю] [уУ] > ю;
[ЙЮ] [уУ] > Ю;

ш [тТ] > щ;
Ш [тТ] > Щ;
`;
