export const latnUkRules = `
::Null;

dž > дж;
Dž > Дж;
dŽ > дЖ;
DŽ > ДЖ;

dz > дз;
Dz > Дз;
dZ > дЗ;
DZ > ДЗ;

t [sS] > ц;
T [sS] > Ц;

t [hH] > т;
T [hH] > Т;

g [hH] > г;
G [hH] > Г;

ng > нг;
Ng > Нг;
nG > нГ;
NG > НГ;

k [hH] > х;
K [hH] > Х;

ij > ей;
Ij > Ей;
iJ > еЙ;
IJ > ЕЙ;

::Null;

[БбПпВвМмФфГгҐґКкХхРр] { y [aA] > \\'я;
[БбПпВвМмФфГгҐґКкХхРр] { Y [aA] > \\'Я;
[БбПпВвМмФфГгҐґКкХхРр] { y [eäöEÄÖ] > \\'є;
[БбПпВвМмФфГгҐґКкХхРр] { Y [eäöEÄÖ] > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { y [uüÿUÜŸ] > \\'ю;
[БбПпВвМмФфГгҐґКкХхРр] { Y [uüÿUÜŸ] > \\'Ю;
[БбПпВвМмФфГгҐґКкХхРр] { y [iïIÏ] > \\'ї;
[БбПпВвМмФфГгҐґКкХхРр] { Y [iïIÏ] > \\'Ї;

ńa > ня;
Ńa > Ня;
ńA > нЯ;
ŃA > НЯ;
ń [eäö] > нє;
Ń [eäö] > Нє;
ń [EÄÖ] > нЄ;
Ń [EÄÖ] > НЄ;
ń [uüÿ] > ню;
Ń [uüÿ] > Ню;
ń [UÜŸ] > нЮ;
Ń [UÜŸ] > НЮ;
ńi > ні;
Ńi > Ні;
ńI > нІ;
ŃI > НІ;
ńo > ньо;
Ńo > Ньо;
ńO > ньО;
ŃO > НЬО;
ńï > ни;
Ńï > Ни;
ńÏ > нИ;
ŃÏ > НИ;

ľa > ля;
Ľa > Ля;
ľA > лЯ;
ĽA > ЛЯ;
ľ [eäö] > лє;
Ľ [eäö] > Лє;
ľ [EÄÖ] > лЄ;
Ľ [EÄÖ] > ЛЄ;
ľ [uüÿ] > лю;
Ľ [uüÿ] > Лю;
ľ [UÜŸ] > лЮ;
Ľ [UÜŸ] > ЛЮ;
ľi > лі;
Ľi > Лі;
ľI > лІ;
ĽI > ЛІ;
ľo > льо;
Ľo > Льо;
ľO > льО;
ĽO > ЛЬО;
ľï > ли;
Ľï > Ли;
ľÏ > лИ;
ĽÏ > ЛИ;

y [aA] > я;
Y [aA] > Я;
y [eäöEÄÖ] > є;
Y [eäöEÄÖ] > Є;
y [uüÿUÜŸ] > ю;
Y [uüÿUÜŸ] > Ю;
y [iïIÏ] > ї;
Y [iïIÏ] > Ї;
yo > йо;
Yo > Йо;
yO > йО;
YO > ЙО;

[:Lu:] { Ń > НЬ;
Ń } [:Lu:] > НЬ;
Ń > Нь;
ń > нь;

[:Lu:] { Ľ > ЛЬ;
Ľ } [:Lu:] > ЛЬ;
Ľ > Ль;
ľ > ль;

[:Lu:] { Đ > ДЖ;
Đ } [:Lu:] > ДЖ;
Đ > Дж;
đ > дж;

š > ш;
Š > Ш;

[čć] > ч;
[ČĆ] > Ч;

ž > ж;
Ž > Ж;

x > х;
X > Х;

y > й;
Y > Й;

b > б;
B > Б;

d > д;
D > Д;

f > ф;
F > Ф;

g > ґ;
G > Ґ;

h > г;
H > Г;

k > к;
K > К;

l > л;
L > Л;

m > м;
M > М;

n > н;
N > Н;

p > п;
P > П;

q > к;
Q > К;

r > р;
R > Р;

s > с;
S > С;

t > т;
T > Т;

[vw] > в;
[VW] > В;

z > з;
Z > З;

a > а;
A > А;

[eäö] > е;
[EÄÖ] > Е;

i > і;
I > І;

o > о;
O > О;

u > у;
U > У;

[üÿ] > ю;
[ÜŸ] > Ю;

ï > и;
Ï > И;

[^[:L:][:M:]] { ['·] > ;
['·] } [^[:L:][:M:]] > ;
['·] > \\';

::Null;

[іІ] { а } [^[:L:][:M:]] > я;
[іІ] { А } [^[:L:][:M:]] > Я;

[іІ] { е > є;
[іІ] { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

Ш [чЧ] > Щ;
ш [чЧ] > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { й [аА] > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { Й [аА] > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { й [еЕ] > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { Й [еЕ] > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { й [іІ] > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { Й [іІ] > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { й [уУ] > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { Й [уУ] > \\'Ю;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йа > ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йА > ьЯ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йа > Ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙА > ЬЯ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йе > ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йЕ > ьЄ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йе > Ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙЕ > ЬЄ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йі > ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йІ > ьЇ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йі > Ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙІ > ЬЇ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йу > ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йУ > ьЮ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йу > Ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙУ > ЬЮ;

й [аА] > я;
Й [аА] > Я;

й [еЕ] > є;
Й [еЕ] > Є;

й [іІ] > ї;
Й [іІ] > Ї;

й [уУ] > ю;
Й [уУ] > Ю;

::Null;

[^[:L:][:M:]] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[^[:L:][:M:]] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [^[:L:][:M:]] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { [ьЬ] } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюяЖЧШЩжчшщ] { [ьЬ] > ;
[^[:L:][:M:]] { [ьЬ] > ;
[ЬЪЙьъй] { [ЬЪьъ] > ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
