export const latnHiRules = `
::Null;
::Lower;

dž > ज्;
dz > द्ज़्;
ts > त्स्;
th > थ्;
gh > ग़्;
ng > ङ्;
kh > ख़्;

::Null;

š > श्;
[čć] > च्;
ž > ज़्;
đ > ज्;
x > ख़्;
y > य्;
ń > ञ्;
ľ > ल्;
b > ब्;
d > ड्;
f > फ़्;
g > ग्;
h > ह्;
k > क्;
l > ल्;
m > म्;
n > न्;
p > प्;
q > क़्;
r > र्;
s > स्;
t > ट्;
v > व्;
w > व्;
z > ज़्;

::Null;

्ij > ै;
्a > ;
्e > े;
्i > ि;
्o > ो;
्u > ु;
्ä > ॅ;
्ö > ॉ;
्ü > ु;
्ï > ि;
्ÿ > ि;

::Null;

ij > ऐ;
a > अ;
e > ए;
i > इ;
o > ओ;
u > उ;
ä > ऍ;
ö > ऑ;
ü > उ;
ï > इ;
ÿ > इ;

::Null;

['·] > ;
् } [:^Letter:] > ;

::Null;

[^[:Letter:][:Mark:]] { ड़ > ड;
[^[:Letter:][:Mark:]] { ढ़ > ढ;
ड़ } ् > ड;
ड़ } ् > ड;
ढ़ } ् > ढ;
ढ़ } ् > ढ;
[िीेैोौॅॉ] { ँ > ं;
् } [ािीुूृेैोौॅॉंँः] > ;
अ ा > आ;
अ ि > इ;
अ ी > ई;
अ ु > उ;
अ ू > ऊ;
अ ृ > ऋ;
अ े > ए;
अ ै > ऐ;
अ ो > ओ;
अ ौ > औ;
अ ॅ > ऍ;
अ ॉ > ऑ;
आ ॅ > ऑ;
आ ॉ > ऑ;
् { ् > ;
`;
