export const latnElRules = `
::Null;

DŽ > ΤΖ;
dŽ > τΖ;
Dž > Τζ;
dž > τζ;

DZ > ΤΖ;
dZ > τΖ;
Dz > Τζ;
dz > τζ;

TS > ΤΣ;
tS > τΣ;
Ts } [^[:L:][:M:]] > Τς;
Ts > Τσ;
ts } [^[:L:][:M:]] > τς;
ts > τσ;

T [hH] > Θ;
t [hH] > θ;

G [hH] > Γ;
g [hH] > γ;

[:L:] { N [gG] } [gG] > Ν;
[:L:] { n [gG] } [gG] > ν;
[:L:] { NG } [:L:] > ΓΓ;
[:L:] { nG } [:L:] > γΓ;
[:L:] { Ng } [:L:] > Γγ;
[:L:] { ng } [:L:] > γγ;

K [hH] > Χ;
k [hH] > χ;

IJ > ΕΙ;
iJ > εΙ;
Ij > Ει;
ij > ει;

::Null;

[:Lu:] { [ČĆ] > ΤΣ;
[ČĆ] } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ΤΣ;
[ČĆ] } [:Lu:] > ΤΣ;
[ČĆ] } [^[:L:][:M:]] > Τς;
[ČĆ] > Τσ;
[čć] } [^[:L:][:M:]] > τς;
[čć] > τσ;

[:Lu:] { Đ > ΤΖ;
Đ } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ΤΖ;
Đ } [:Lu:] > ΤΖ;
Đ > Τζ;
đ > τζ;

MB > ΜΠ;
mB > μΠ;
Mb > Μπ;
mb > μπ;

ND > ΝΤ;
nD > νΤ;
Nd > Ντ;
nd > ντ;

[:Lu:] { B > ΜΠ;
B } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ΜΠ;
B } [:Lu:] > ΜΠ;
B > Μπ;
b > μπ;

[:Lu:] { D > ΝΤ;
D } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ΝΤ;
D } [:Lu:] > ΝΤ;
D > Ντ;
d > ντ;

[:Lu:] { G > ΓΚ;
G } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ΓΚ;
G } [:Lu:] > ΓΚ;
G > Γκ;
g > γκ;

[:Lu:] { U > ΟΥ;
U } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ΟΥ;
U } [:Lu:] > ΟΥ;
U > Ου;
u > ου;

Ľ } [^[:L:][:M:]] > Λ;
ľ } [^[:L:][:M:]] > λ;
Ľ } [IÏÜŸYΙiïüÿyι] > Λ;
ľ } [IÏÜŸYΙiïüÿyι] > λ;
[:Lu:] { Ľ > ΛΙ;
Ľ } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ΛΙ;
Ľ } [:Lu:] > ΛΙ;
Ľ > Λι;
ľ > λι;

Ń } [^[:L:][:M:]] > Ν;
ń } [^[:L:][:M:]] > ν;
Ń } [IÏÜŸYΙiïüÿyι] > Ν;
ń } [IÏÜŸYΙiïüÿyι] > ν;
[:Lu:] { Ń > ΝΙ;
Ń } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ΝΙ;
Ń } [:Lu:] > ΝΙ;
Ń > Νι;
ń > νι;

[sš] } [^[:L:][:M:]] > ς;
[sš] > σ;
[SŠ] > Σ;
[zž] > ζ;
[ZŽ] > Ζ;
[hx] > χ;
[HX] > Χ;
[kq] > κ;
[KQ] > Κ;
[vw] > β;
[VW] > Β;

a > α;
A > Α;
[äeö] > ε;
[ÄEÖ] > Ε;
[iï] [yY] > ι;
[IÏ] [yY] > Ι;
Y [iï] > Ι;
[yY] } [iïIÏ] > ;
[iïüÿy] > ι;
[IÏÜŸY] > Ι;
o > ο;
O > Ο;
f > φ;
F > Φ;
l > λ;
L > Λ;
m > μ;
M > Μ;
n > ν;
N > Ν;
p > π;
P > Π;
r > ρ;
R > Ρ;
t > τ;
T > Τ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;

::Null;

ς } [:L:] > σ;
σ } [^[:L:][:M:]] > ς;
[ιΙ] [ιΙ] { [ιΙ]+ > ;
`;
