export const latnUkRules = `
::Null;

dž > дж;
Dž > Дж;
DŽ > ДЖ;

dz > дз;
Dz > Дз;
DZ > ДЗ;

ts > ц;
Ts > Ц;
TS > Ц;

th > т;
Th > Т;
TH > Т;

gh > г;
Gh > Г;
GH > Г;

ng > нг;
Ng > Нг;
NG > НГ;

kh > х;
Kh > Х;
KH > Х;

ij > ей;
Ij > Ей;
IJ > ЕЙ;

::Null;

[БбПпВвМмФфГгҐґКкХхРр] { ya > \\'я;
[БбПпВвМмФфГгҐґКкХхРр] { Ya > \\'Я;
[БбПпВвМмФфГгҐґКкХхРр] { YA > \\'Я;
[БбПпВвМмФфГгҐґКкХхРр] { y [eäö] > \\'є;
[БбПпВвМмФфГгҐґКкХхРр] { Y [eäö] > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { Y [EÄÖ] > \\'Є;
[БбПпВвМмФфГгҐґКкХхРр] { y [uüÿ] > \\'ю;
[БбПпВвМмФфГгҐґКкХхРр] { Y [uüÿ] > \\'Ю;
[БбПпВвМмФфГгҐґКкХхРр] { Y [UÜŸ] > \\'Ю;
[БбПпВвМмФфГгҐґКкХхРр] { y [iï] > \\'ї;
[БбПпВвМмФфГгҐґКкХхРр] { Y [iï] > \\'Ї;
[БбПпВвМмФфГгҐґКкХхРр] { Y [IÏ] > \\'Ї;

ńa > ня;
Ńa > Ня;
ŃA > НЯ;
ń [eäö] > нє;
Ń [eäö] > Нє;
Ń [EÄÖ] > НЄ;
ń [uüÿ] > ню;
Ń [uüÿ] > Ню;
Ń [UÜŸ] > НЮ;
ńi > ні;
Ńi > Ні;
ŃI > НІ;
ńo > ньо;
Ńo > Ньо;
ŃO > НЬО;
ńï > ни;
Ńï > Ни;
ŃÏ > НИ;

ľa > ля;
Ľa > Ля;
ĽA > ЛЯ;
ľ [eäö] > лє;
Ľ [eäö] > Лє;
Ľ [EÄÖ] > ЛЄ;
ľ [uüÿ] > лю;
Ľ [uüÿ] > Лю;
Ľ [UÜŸ] > ЛЮ;
ľi > лі;
Ľi > Лі;
ĽI > ЛІ;
ľo > льо;
Ľo > Льо;
ĽO > ЛЬО;
ľï > ли;
Ľï > Ли;
ĽÏ > ЛИ;

ya > я;
Ya > Я;
YA > Я;
y [eäö] > є;
Y [eäö] > Є;
Y [EÄÖ] > Є;
y [uüÿ] > ю;
Y [uüÿ] > Ю;
Y [UÜŸ] > Ю;
y [iï] > ї;
Y [iï] > Ї;
Y [IÏ] > Ї;
yo > йо;
Yo > Йо;
YO > ЙО;

Ń } [:Ll:] > Нь;
Ń > НЬ;
ń > нь;

Ľ } [:Ll:] > Ль;
Ľ > ЛЬ;
ľ > ль;

Đ } [:Ll:] > Дж;
Đ > ДЖ;
đ > дж;

š > ш;
Š > Ш;

[čć] > ч;
[ČĆ] > Ч;

ž > ж;
Ž > Ж;

x > х;
X > Х;

y > й;
Y > Й;

b > б;
B > Б;

d > д;
D > Д;

f > ф;
F > Ф;

g > ґ;
G > Ґ;

h > г;
H > Г;

k > к;
K > К;

l > л;
L > Л;

m > м;
M > М;

n > н;
N > Н;

p > п;
P > П;

q > к;
Q > К;

r > р;
R > Р;

s > с;
S > С;

t > т;
T > Т;

[vw] > в;
[VW] > В;

z > з;
Z > З;

a > а;
A > А;

[eäö] > е;
[EÄÖ] > Е;

i > і;
I > І;

o > о;
O > О;

[uÿ] > у;
[UŸ] > У;

ü > ю;
Ü > Ю;

ï > и;
Ï > И;

[^[:L:][:M:]] { ['·] > ;
['·] } [^[:L:][:M:]] > ;
['·] > \\';

::Null;

і { а } [^[:L:][:M:]] > я;
І { а } [^[:L:][:M:]] > я;
і { А } [^[:L:][:M:]] > Я;
І { А } [^[:L:][:M:]] > Я;

і { е > є;
І { е > є;
і { Е > Є;
І { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

ШЧ > Щ;
Шч > Щ;
шЧ > щ;
шч > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { йа > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { йА > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { Йа > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { ЙА > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { йе > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { йЕ > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { Йе > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { ЙЕ > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { йі > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { йІ > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { Йі > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { ЙІ > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { йу > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { йУ > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { Йу > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { ЙУ > \\'Ю;

йа > я;
йА > Я;
Йа > Я;
ЙА > Я;

йе > є;
йЕ > Є;
Йе > Є;
ЙЕ > Є;

йі > ї;
йІ > Ї;
Йі > Ї;
ЙІ > Ї;

йу > ю;
йУ > Ю;
Йу > Ю;
ЙУ > Ю;

::Null;

[^[:L:][:M:]] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[^[:L:][:M:]] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [^[:L:][:M:]] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { ь } [ЯЮЄЇяюєї] > \\';
[БПВМФГҐКХРбпвмфгґкхр] { Ь } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюя] { ь > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { Ь > ;
[^[:L:][:M:]] { ь > ;
[^[:L:][:M:]] { Ь > ;
[ЖЧШЩжчшщ] { ь > ;
[ЖЧШЩжчшщ] { Ь > ;
[Ьь] } [Ьь] > ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
