export const hyIpaRules = `
::Lower;

[^[:L:][:M:]] { ով } [^[:L:][:M:]] > ov;
[^[:L:][:M:]] { ովքեր } [^[:L:][:M:]] > ovkʰɛɾ;
[^[:L:][:M:]] { եմ } [^[:L:][:M:]] > ɛm;
[^[:L:][:M:]] { ես } [^[:L:][:M:]] > ɛs;
[^[:L:][:M:]] { ենք } [^[:L:][:M:]] > ɛnkʰ;
[^[:L:][:M:]] { եք } [^[:L:][:M:]] > ɛkʰ;
[^[:L:][:M:]] { են } [^[:L:][:M:]] > ɛn;

[^[:L:][:M:]] { և > jɛv;
[աեէըիոօւև] { և > jɛv;
և > ɛv;

[^[:L:][:M:]] { եւ > jɛv;
[աեէըիոօւև] { եւ > jɛv;
եւ > ɛv;

ու > u;

[^[:L:][:M:]] { ե > jɛ;
[աեէըիոօւև] { ե > jɛ;
ե > ɛ;

[^[:L:][:M:]] { ո > vɔ;
ո > ɔ;

ա > ɑ;
բ > b;
գ > ɡ;
դ > d;
զ > z;
է > ɛ;
ը > ə;
թ > tʰ;
ժ > ʒ;
ի > i;
լ > l;
խ > χ;
ծ > ts;
կ > k;
հ > h;
ձ > dz;
ղ > ɣ;
ճ > tʃ;
մ > m;
յ > j;
ն > n;
շ > ʃ;
չ > tʃʰ;
պ > p;
ջ > dʒ;
ռ > r;
ս > s;
վ > v;
տ > t;
ր > ɾ;
ց > tsʰ;
ւ > v;
փ > pʰ;
ք > kʰ;
օ > ɔ;
ֆ > f;
`;
