export const hyLatnRules = `
::NFD;

ՈՒ > U;
Ու > U;
ու > u;

[^[:L:][:M:]] { Ե } [:Lu:] > YE;
[^[:L:][:M:]] { Ե > Ye;
[^[:L:][:M:]] { ե > ye;

[^[:L:][:M:]] { Ո } [:Lu:] > VO;
[^[:L:][:M:]] { Ո > Vo;
[^[:L:][:M:]] { ո > vo;

[^[:L:][:M:]] { և > yev;
և > ev;

::Null;

[:Lu:] { Ծ > TS;
Ծ } [:Lu:] > TS;
Ծ > Ts;
ծ > ts;

[:Lu:] { Ձ > DZ;
Ձ } [:Lu:] > DZ;
Ձ > Dz;
ձ > dz;

[:Lu:] { Ղ > GH;
Ղ } [:Lu:] > GH;
Ղ > Gh;
ղ > gh;

[:Lu:] { Ց > TS;
Ց } [:Lu:] > TS;
Ց > Ts;
ց > ts;

[:Lu:] { Ջ > DŽ;
Ջ } [:Lu:] > DŽ;
Ջ > Dž;
ջ > dž;

[:Lu:] { Թ > TH;
Թ } [:Lu:] > TH;
Թ > Th;
թ > th;

Ժ > Ž;
ժ > ž;

Խ > X;
խ > x;

Ճ > Ć;
ճ > ć;

Շ > Š;
շ > š;

Չ > Č;
չ > č;

Ա > A;
ա > a;
Բ > B;
բ > b;
Գ > G;
գ > g;
Դ > D;
դ > d;
Ե > E;
ե > e;
Զ > Z;
զ > z;
Է > E;
է > e;
Ը > Ï;
ը > ï;
Ի > I;
ի > i;
Լ > L;
լ > l;
Կ > K;
կ > k;
Հ > H;
հ > h;
Մ > M;
մ > m;
Յ > Y;
յ > y;
Ն > N;
ն > n;
Ո > O;
ո > o;
Պ > P;
պ > p;
Ռ > R;
ռ > r;
Ս > S;
ս > s;
Վ > V;
վ > v;
Տ > T;
տ > t;
Ր > R;
ր > r;
Ւ > W;
ւ > w;
Փ > P;
փ > p;
Ք > K;
ք > k;
Օ > O;
օ > o;
Ֆ > F;
ֆ > f;

::NFC;
`;
