export const hyLatnRules = `
::NFD;

Ո [Ււ] > U;
ո [Ււ] > u;

[^[:L:][:M:]] { Ե } [:Lu:] > YE;
[^[:L:][:M:]] { Ե > Ye;
[^[:L:][:M:]] { ե > ye;

[^[:L:][:M:]] { Ո } [:Lu:] > VO;
[^[:L:][:M:]] { Ո > Vo;
[^[:L:][:M:]] { ո > vo;

[^[:L:][:M:]] { և > yev;
և > ev;

::Null;

[:Lu:] { Ծ > TS;
Ծ } [:Lu:] > TS;
Ծ > Ts;
ծ > ts;

[:Lu:] { Ձ > DZ;
Ձ } [:Lu:] > DZ;
Ձ > Dz;
ձ > dz;

[:Lu:] { Ղ > GH;
Ղ } [:Lu:] > GH;
Ղ > Gh;
ղ > gh;

[:Lu:] { Ց > TS;
Ց } [:Lu:] > TS;
Ց > Ts;
ց > ts;

[:Lu:] { Ջ > DŽ;
Ջ } [:Lu:] > DŽ;
Ջ > Dž;
ջ > dž;

[:Lu:] { Թ > TH;
Թ } [:Lu:] > TH;
Թ > Th;
թ > th;

Ժ > Ž;
ժ > ž;

Խ > X;
խ > x;

Ճ > Ć;
ճ > ć;

Շ > Š;
շ > š;

Չ > Č;
չ > č;

Ա > A;
ա > a;

Բ > B;
բ > b;

Վ > V;
վ > v;

Գ > G;
գ > g;

Դ > D;
դ > d;

[ԵԷ] > E;
[եէ] > e;

Զ > Z;
զ > z;

Ը > Ï;
ը > ï;

Ի > I;
ի > i;

Լ > L;
լ > l;

[ԿՔ] > K;
[կք] > k;

Հ > H;
հ > h;

Մ > M;
մ > m;

Յ > Y;
յ > y;

Ն > N;
ն > n;

[ՈՕ] > O;
[ոօ] > o;

[ՊՓ] > P;
[պփ] > p;

[ՌՐ] > R;
[ռր] > r;

Ս > S;
ս > s;

Տ > T;
տ > t;

Ւ > W;
ւ > w;

Ֆ > F;
ֆ > f;

::NFC;
`;
