export const urArRules = `
ا { [ہۂ] } [^[:L:][:M:]] > ه;
و { [ہۂ] } [^[:L:][:M:]] > ه;
الل { [ہۂ] } [^[:L:][:M:]] > ه;
[^[:L:][:M:]] ی { [ہۂ] } [^[:L:][:M:]] > ه;
[^[:L:][:M:]] ک { [ہۂ] } [^[:L:][:M:]] > ه;
[^[:L:][:M:]] ن { [ہۂ] } [^[:L:][:M:]] > ه;
[ہۂ] } [^[:L:][:M:]] > ة;
َ { ی } [^[:L:][:M:]] > ى;
[یے] ٰ > ى;
پھ > ف;
تھ > ث;
چھ > ش;

::Null;

پ > ب;
ٹ > ت;
چ > تش;
ڈ > د;
ڑ > ر;
ژ > ز;
گ > غ;
ک > ك;
ں > ن;
[یےۓ] > ي;
[ہھۂ] > ه;
ۃ > ة;

::Null;

۰ > ٠;
۱ > ١;
۲ > ٢;
۳ > ٣;
۴ > ٤;
۵ > ٥;
۶ > ٦;
۷ > ٧;
۸ > ٨;
۹ > ٩;

::Null;

اا > آ;
أا > آ;
إا > آ;
آا > آ;

::Null;

[^[:L:][:M:]] { ة > ت;
[^[:L:][:M:]] { ى > ي;

::Null;

ة } [:L:] > ت;
ى } [:L:] > ي;
`;
