export const jaBgRules = `
０ > 0;
１ > 1;
２ > 2;
３ > 3;
４ > 4;
５ > 5;
６ > 6;
７ > 7;
８ > 8;
９ > 9;

ファ > fa;
ふぁ > fa;
フィ > fi;
ふぃ > fi;
フェ > fe;
ふぇ > fe;
フォ > fo;
ふぉ > fo;
フュ > fyu;
ふゅ > fyu;
ヴァ > va;
ゔぁ > va;
ヴィ > vi;
ゔぃ > vi;
ヴェ > ve;
ゔぇ > ve;
ヴォ > vo;
ゔぉ > vo;
ヴュ > vyu;
ゔゅ > vyu;
ティ > ti;
てぃ > ti;
トゥ > tu;
とぅ > tu;
テュ > tyu;
てゅ > tyu;
ディ > di;
でぃ > di;
ドゥ > du;
どぅ > du;
デュ > dyu;
でゅ > dyu;
ジェ > je;
じぇ > je;
チェ > che;
ちぇ > che;
シェ > she;
しぇ > she;
ウィ > wi;
うぃ > wi;
ウェ > we;
うぇ > we;
ウォ > wo;
うぉ > wo;
[^[:L:][:M:]] { [ヴゔ] } [^[:L:][:M:]] > vu;
[ヴゔ] > v;
[ぁァ] > a;
[ぃィゐ以] > i;
[ぅゥ] > u;
[ぇェ] > e;
[ぉォ] > o;
[ャゃ] > ya;
[ュゅ] > yu;
[ョょ予] > yo;
[亡剖] > bo;
[交勾] > ko;
企 > ki;
伺 > shi;
侶 > ryo;
促 > soku;
[俸倣] > ho;
倹 > ken;
偶 > gu;
備 > bi;
傲 > go;
傾 > kei;
冗 > jo;
凡 > bon;
刹 > satsu;
剥 > haku;
励 > rei;
劾 > gai;
匿 > toku;
受 > ju;

::Null;

[[:Hiragana:][:Katakana:][:Han:]ー] > ;

::Null;
::NFC;

tōkyō > токио;
kyōto > киото;

[aāâɑɐæ] [iīî] } [^[:L:][:M:]] > ай;
[aāâɑɐæ] [iīî] } [bcdfghjklmnpqrstvwxyz] > ай;
[eēê] [iīî] } [^[:L:][:M:]] > ей;
[eēê] [iīî] } [bcdfghjklmnpqrstvwxyz] > ей;
[oōô] [iīî] } [^[:L:][:M:]] > ой;
[oōô] [iīî] } [bcdfghjklmnpqrstvwxyz] > ой;
[uūû] [iīî] } [^[:L:][:M:]] > уй;
[uūû] [iīî] } [bcdfghjklmnpqrstvwxyz] > уй;

ssh > шш;
cch > тч;
tch > тч;
tts > цц;

sh > ш;
ch > ч;
ts > ц;
dz > дз;
j > дж;

n ['’‘\`´ʼ] y [aāâɑɐæ] > н\\'я;
n ['’‘\`´ʼ] y [uūû] > н\\'ю;
n ['’‘\`´ʼ] y [oōô] > н\\'йо;
n ['’‘\`´ʼ] y [eēê] > н\\'е;
n ['’‘\`´ʼ] y [iīî] > н\\'и;
n ['’‘\`´ʼ] [aāâɑɐæ] > н\\'а;
n ['’‘\`´ʼ] [iīî] > н\\'и;
n ['’‘\`´ʼ] [uūû] > н\\'у;
n ['’‘\`´ʼ] [eēê] > н\\'е;
n ['’‘\`´ʼ] [oōô] > н\\'о;
n ['’‘\`´ʼ] > н;

[аеиоуйяю] { y [oōô] > йо;
[^[:L:][:M:]] { y [oōô] > йо;
y [oōô] > ьо;

y [aāâɑɐæ] > я;
y [uūû] > ю;
y [eēê] > е;
y [iīî] > йи;

b > б;
c > к;
d > д;
f > ф;
g > г;
h > х;
k > к;
l > л;
m > м;
n > н;
p > п;
q > к;
r > р;
s > с;
t > т;
v > в;
w > в;
x > кс;
y > й;
z > з;

[aāâɑɐæ] > а;
[iīî] > и;
[uūû] > у;
[eēê] > е;
[oōô] > о;



::Null;

б { б+ > ;
в { в+ > ;
г { г+ > ;
д { д+ > ;
ж { ж+ > ;
з { з+ > ;
й { [йь]+ > ;
к { к+ > ;
л { л+ > ;
м { м+ > ;
н { н+ > ;
п { п+ > ;
р { р+ > ;
с { с+ > ;
т { т+ > ;
ф { ф+ > ;
х { х+ > ;
ц { ц+ > ;
ч { ч+ > ;
ш { ш+ > ;
щ { щ+ > ;
ъ { ъ+ > ;
ь { ь+ > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщ] { й > и;
[аеиоуъюя] { и } [еиоъ] > й;
[аеиоуъюя] { и [ая] > я;
[аеиоуъюя] { и [ую] > ю;
[аеиоуъюя] { ьо > йо;
[аеиоуъюя] { ье > йе;

ь } [^[:L:][:M:]] > ;
ь } [^о] > ;

::Null;

[йя] а > я;
[йю] у > ю;
шт > щ;

::Null;

[:L:]+ [бвгджзйклмнпрстфхцчшщ] и { а } [^[:L:][:M:]] > я;

::Title;
`;
