export const jaBgRules = `
ファ > fa;
ふぁ > fa;
フィ > fi;
ふぃ > fi;
フェ > fe;
ふぇ > fe;
フォ > fo;
ふぉ > fo;
ヴァ > va;
ゔぁ > va;
ヴィ > vi;
ゔぃ > vi;
ヴェ > ve;
ゔぇ > ve;
ヴォ > vo;
ゔぉ > vo;
ティ > ti;
てぃ > ti;
ディ > di;
でぃ > di;
ジェ > je;
じぇ > je;
チェ > che;
ちぇ > che;
シェ > she;
しぇ > she;
ウィ > wi;
うぃ > wi;
ウェ > we;
うぇ > we;
ウォ > wo;
うぉ > wo;
デュ > dyu;
[ヴゔ] > vu;
[ぁァ] > a;
[ぃィ] > i;
[ぅゥ] > u;
[ぇェ] > e;
[ぉォ] > o;
ャ > ya;
ュ > yu;
ョ > yo;

::Null;

tōkyōto > токио;
tōkyō > токио;
kyōtofu > киото;
kyōto > киото;

[aāâɑɐæ] [iīî] } [:^Letter:] > ай;
[aāâɑɐæ] [iīî] } [bcdfghjklmnpqrstvwxyz] > ай;
[eēê] [iīî] } [:^Letter:] > ей;
[eēê] [iīî] } [bcdfghjklmnpqrstvwxyz] > ей;
[oōô] [iīî] } [:^Letter:] > ой;
[oōô] [iīî] } [bcdfghjklmnpqrstvwxyz] > ой;
[uūû] [iīî] } [:^Letter:] > уй;
[uūû] [iīî] } [bcdfghjklmnpqrstvwxyz] > уй;

ssh > шш;
cch > тч;
tch > тч;
tts > цц;

sh > ш;
ch > ч;
ts > ц;
dz > дз;
j > дж;

n ['’‘\`´ʼ] y [aāâɑɐæ] > н\\'я;
n ['’‘\`´ʼ] y [uūû] > н\\'ю;
n ['’‘\`´ʼ] y [oōô] > н\\'йо;
n ['’‘\`´ʼ] y [eēê] > н\\'е;
n ['’‘\`´ʼ] y [iīî] > н\\'и;
n ['’‘\`´ʼ] [aāâɑɐæ] > н\\'а;
n ['’‘\`´ʼ] [iīî] > н\\'и;
n ['’‘\`´ʼ] [uūû] > н\\'у;
n ['’‘\`´ʼ] [eēê] > н\\'е;
n ['’‘\`´ʼ] [oōô] > н\\'о;
n ['’‘\`´ʼ] > н;

[аеиоуйяю] { y [oōô] > йо;
[:^Letter:] { y [oōô] > йо;
y [oōô] > ьо;

y [aāâɑɐæ] > я;
y [uūû] > ю;
y [eēê] > е;
y [iīî] > йи;

b > б;
c > к;
d > д;
f > ф;
g > г;
h > х;
k > к;
l > л;
m > м;
n > н;
p > п;
q > к;
r > р;
s > с;
t > т;
v > в;
w > в;
x > кс;
y > й;
z > з;

[aāâɑɐæ] > а;
[iīî] > и;
[uūû] > у;
[eēê] > е;
[oōô] > о;

::Null;

б { б > ;
в { в > ;
г { г > ;
ж { ж > ;
й { й > ;
м { м > ;
п { п > ;
с { с > ;
ф { ф > ;
ц { ц > ;
ч { ч > ;
ш { ш > ;
щ { щ > ;
ъ { ъ > ;
ь { ь > ;
ю { ю > ;
я { я > ;

::Null;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщ] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[аеиоуъюя] { и } [^бвгджзйклмнпрстфхцчшщ] > й;
[аеиоуъюя] { ьо > йо;
[аеиоуъюя] { ье > йе;

ь } [:^Letter:] > ;
ь } [^о] > ;
ъ } [:^Letter:] > и;

::Null;

[йя] а > я;
[йю] у > ю;
шт > щ;

::Title;
`;
