export const jaKkRules = `
ファ > fa;
ふぁ > fa;
フィ > fi;
ふぃ > fi;
フェ > fe;
ふぇ > fe;
フォ > fo;
ふぉ > fo;
フュ > fyu;
ふゅ > fyu;
ヴァ > va;
ゔぁ > va;
ヴィ > vi;
ゔぃ > vi;
ヴェ > ve;
ゔぇ > ve;
ヴォ > vo;
ゔぉ > vo;
ヴュ > vyu;
ゔゅ > vyu;
ティ > ti;
てぃ > ti;
トゥ > tu;
とぅ > tu;
テュ > tyu;
てゅ > tyu;
ディ > di;
でぃ > di;
ドゥ > du;
どぅ > du;
デュ > dyu;
でゅ > dyu;
ジェ > je;
じぇ > je;
チェ > che;
ちぇ > che;
シェ > she;
しぇ > she;
ウィ > wi;
うぃ > wi;
ウェ > we;
うぇ > we;
ウォ > wo;
うぉ > wo;
[^[:L:][:M:]] { [ヴゔ] } [^[:L:][:M:]] > vu;
[ヴゔ] > v;
[ぁァ] > a;
[ぃィ] > i;
[ぅゥ] > u;
[ぇェ] > e;
[ぉォ] > o;
[ャゃ] > ya;
[ュゅ] > yu;
[ョょ] > yo;

::Null;

[ɑɐæāâ] > a;
[īî] > i;
[ūû] > u;
[ēê] > e;
[ōô] > o;

::Null;

tokyo > токио;
kyoto > киото;

shi > си;
sha > ся;
shu > сю;
sho > сё;
sh > с;

chi > ти;
cha > тя;
chu > тю;
cho > тё;
ch > т;

tsu > цу;
ts > ц;

dzu > дзу;
dz > дз;

ji > дзи;
ja > дзя;
ju > дзю;
jo > дзё;
j > дз;

ya > я;
yu > ю;
yo > ё;
ye > е;

wa > ва;

н { ['’‘\`´ʼ\\-] } [yaiueoяюёеи] > ъ;
[^[:L:][:M:]] { e > э;
[аеёиоуыэюяъй] { e > э;
[аеёоуыэюя] { i > й;

a > а;
b > б;
c > ц;
d > д;
e > е;
f > ф;
g > г;
h > х;
i > и;
k > к;
l > л;
m > м;
n > н;
o > о;
p > п;
q > к;
r > р;
s > с;
t > т;
u > у;
[vw] > в;
x > кс;
y > й;
z > дз;

::Null;

[^[:L:][:M:]] { ң > н;
[үұ] у > у;

::Null;

ә { ә > ;
ө { ө > ;
у { у > ;
ү { ү > ;
ұ { ұ > ;
і { і > ;
ғ { ғ > ;
ң { ң > ;
һ { һ > ;
ё { ё > ;
щ { щ > ;
й { й > ;
[ьъй] { [ьъ] > ;
ъ } [^[:L:][:M:]] > ;
[аәеёиоөуұүъыіэюя] { ъ } [аәеёиоөуұүъыіэюя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъ] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъ] { й } [^[:L:][:M:]] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъ] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъ] > и;

::Null;

қ } [бвгғджзйкқлмнңпрстфхһцчшщьъ]* [әеіөүэ] > к;
ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъ]* [әеіөүэ] > г;
[әеіөүэ] [бвгғджзйкқлмнңпрстфхһцчшщьъ]* { қ > к;
[әеіөүэ] [бвгғджзйкқлмнңпрстфхһцчшщьъ]* { ғ > г;

::Title;
`;
