export const jaMkRules = `
ファ > fa;
ふぁ > fa;
フィ > fi;
ふぃ > fi;
フェ > fe;
ふぇ > fe;
フォ > fo;
ふぉ > fo;
フュ > fyu;
ふゅ > fyu;
ヴァ > va;
ゔぁ > va;
ヴィ > vi;
ゔぃ > vi;
ヴェ > ve;
ゔぇ > ve;
ヴォ > vo;
ゔぉ > vo;
ヴュ > vyu;
ゔゅ > vyu;
ティ > ti;
てぃ > ti;
トゥ > tu;
とぅ > tu;
テュ > tyu;
てゅ > tyu;
ディ > di;
でぃ > di;
ドゥ > du;
どぅ > du;
デュ > dyu;
でゅ > dyu;
ジェ > je;
じぇ > je;
チェ > che;
ちぇ > che;
シェ > she;
しぇ > she;
ウィ > wi;
うぃ > wi;
ウェ > we;
うぇ > we;
ウォ > wo;
うぉ > wo;
[^[:L:][:M:]] { [ヴゔ] } [^[:L:][:M:]] > vu;
[ヴゔ] > v;
[ぁァ] > a;
[ぃィ] > i;
[ぅゥ] > u;
[ぇェ] > e;
[ぉォ] > o;
[ャゃ] > ya;
[ュゅ] > yu;
[ョょ] > yo;

::Null;

tōkyō > токио;
kyōto > киото;

[aāâɑɐæ] [iīî] } [^[:L:][:M:]] > ај;
[eēê] [iīî] } [^[:L:][:M:]] > еј;
[oōô] [iīî] } [^[:L:][:M:]] > ој;
[uūû] [iīî] } [^[:L:][:M:]] > уј;

ssh > шш;
cch > чч;
tch > чч;
tts > цц;

sh > ш;
ch > ч;
ts > ц;
dz > ѕ;

jj > џџ;
j > џ;
ny > њ;

n ['’‘\`´ʼ] y > нј;
n ['’‘\`´ʼ] > н;

y > ј;

b > б;
c > к;
d > д;
f > ф;
g > г;
h > х;
k > к;
l > л;
m > м;
n > н;
p > п;
q > к;
r > р;
s > с;
t > т;
v > в;
w > в;
x > кс;
z > з;

[aāâɑɐæ] > а;
[iīî] > и;
[uūû] > у;
[eēê] > е;
[oōô] > о;

::Null;

а { а > ;
б { б > ;
в { в > ;
г { г > ;
д { д > ;
ѓ { ѓ > ;
е { е > ;
ж { ж > ;
з { з > ;
ѕ { ѕ > ;
и { и > ;
ј { ј > ;
к { к > ;
л { л > ;
љ { љ > ;
м { м > ;
н { н > ;
њ { њ > ;
о { о > ;
п { п > ;
р { р > ;
с { с > ;
т { т > ;
ќ { ќ > ;
у { у > ;
ф { ф > ;
х { х > ;
ц { ц > ;
ч { ч > ;
џ { џ > ;
ш { ш > ;

::Null;

лј > љ;
нј > њ;
дз > ѕ;
дж > џ;

ји > и;
иа > ија;

[аеиоу] { ј } [ео] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] } р > ;

[^[:L:][:M:]] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџш] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџш] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџш] > и;

::Title;
`;
