export const jaRuRules = `
ファ > fa;
ふぁ > fa;
フィ > fi;
ふぃ > fi;
フェ > fe;
ふぇ > fe;
フォ > fo;
ふぉ > fo;
ヴァ > va;
ゔぁ > va;
ヴィ > vi;
ゔぃ > vi;
ヴェ > ve;
ゔぇ > ve;
ヴォ > vo;
ゔぉ > vo;
ティ > ti;
てぃ > ti;
ディ > di;
でぃ > di;
ジェ > je;
じぇ > je;
チェ > che;
ちぇ > che;
シェ > she;
しぇ > she;
ウィ > wi;
うぃ > wi;
ウェ > we;
うぇ > we;
ウォ > wo;
うぉ > wo;
デュ > dyu;
[ヴゔ] > vu;
[ぁァ] > a;
[ぃィ] > i;
[ぅゥ] > u;
[ぇェ] > e;
[ぉォ] > o;
ャ > ya;
ュ > yu;
ョ > yo;

::Null;

tōkyōto > токио;
kyōtofu > киото;

[aāâɑɐæ] [iīî] } [:^Letter:] > ай;
[aāâɑɐæ] [iīî] } [bcdfghjklmnpqrstvwxyz] > ай;
[eēê] [iīî] } [:^Letter:] > эй;
[eēê] [iīî] } [bcdfghjklmnpqrstvwxyz] > эй;
[oōô] [iīî] } [:^Letter:] > ой;
[oōô] [iīî] } [bcdfghjklmnpqrstvwxyz] > ой;
[uūû] [iīî] } [:^Letter:] > уй;
[uūû] [iīî] } [bcdfghjklmnpqrstvwxyz] > уй;

ssh [aāâɑɐæ] > сся;
ssh [iīî] > сси;
ssh [uūû] > ссю;
ssh [eēê] > ссэ;
ssh [oōô] > ссё;

cch [aāâɑɐæ] > ття;
cch [iīî] > тти;
cch [uūû] > ттю;
cch [eēê] > ттэ;
cch [oōô] > ттё;

tch [aāâɑɐæ] > ття;
tch [iīî] > тти;
tch [uūû] > ттю;
tch [eēê] > ттэ;
tch [oōô] > ттё;

tts [aāâɑɐæ] > цца;
tts [iīî] > цци;
tts [uūû] > ццу;
tts [eēê] > ццэ;
tts [oōô] > ццо;

sh [aāâɑɐæ] > ся;
sh [iīî] > си;
sh [uūû] > сю;
sh [eēê] > сэ;
sh [oōô] > сё;

ch [aāâɑɐæ] > тя;
ch [iīî] > ти;
ch [uūû] > тю;
ch [eēê] > тэ;
ch [oōô] > тё;

ts [aāâɑɐæ] > ца;
ts [iīî] > ци;
ts [uūû] > цу;
ts [eēê] > цэ;
ts [oōô] > цо;

dz [aāâɑɐæ] > дза;
dz [iīî] > дзи;
dz [uūû] > дзу;
dz [eēê] > дзэ;
dz [oōô] > дзо;

jj [aāâɑɐæ] > дздзя;
jj [iīî] > дздзи;
jj [uūû] > дздзю;
jj [eēê] > дздзэ;
jj [oōô] > дздзё;

j [aāâɑɐæ] > дзя;
j [iīî] > дзи;
j [uūû] > дзю;
j [eēê] > дзэ;
j [oōô] > дзё;

n ['’‘\`´ʼ] y [aāâɑɐæ] > нъя;
n ['’‘\`´ʼ] y [uūû] > нъю;
n ['’‘\`´ʼ] y [oōô] > нъё;
n ['’‘\`´ʼ] y [eēê] > нъе;
n ['’‘\`´ʼ] y [iīî] > нъйи;
n ['’‘\`´ʼ] [aāâɑɐæ] > нъа;
n ['’‘\`´ʼ] [iīî] > нъи;
n ['’‘\`´ʼ] [uūû] > нъу;
n ['’‘\`´ʼ] [eēê] > нъэ;
n ['’‘\`´ʼ] [oōô] > нъо;
n ['’‘\`´ʼ] > нъ;

y [aāâɑɐæ] > я;
y [uūû] > ю;
y [oōô] > ё;
y [eēê] > е;
y [iīî] > йи;

b > б;
c > к;
d > д;
f > ф;
g > г;
h > х;
j > дз;
k > к;
l > л;
m > м;
n > н;
p > п;
q > к;
r > р;
s > с;
t > т;
v > в;
w > в;
x > кс;
y > й;
z > дз;

[aāâɑɐæ] > а;
[iīî] > и;
[uūû] > у;
[eēê] > э;
[oōô] > о;

::Null;

[жшчщ] { ы > и;

ё { ё > ;
й { й > ;
х { х > ;
ш { ш > ;
щ { щ > ;
ы { ы > ;
[ьъй] { [ьъ] > ;

::Null;

[щъыь] { [ий] а > я;
[щъыь] { [ий] о > ё;
[щъыь] { [ий] е > е;
[щъыь] { [ий] у > ю;

[бвгджзйклмнпрстфхцчшщ] { йа > ья;
[бвгджзйклмнпрстфхцчшщ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщ] { йе > ье;
[бвгджзйклмнпрстфхцчшщ] { йу > ью;
[бвгджзйклмнпрстфхцчшщ] { йи > ьи;

йи > и;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщьъ] { й } [:^Letter:] > и;
[бвгджзйклмнпрстфхцчшщьъ] { й } [бвгджзйклмнпрстфхцчшщ] > и;

[аоуэыиеёюя] { и } [:^Letter:] > й;

::Null;

[бвгджзйклмнпрстфхцчшщ] { ъ } [бвгджзклмнпрстфхцчшщ] > ;
ъ } [:^Letter:] > ;
ъ } [аоуэыи] > ;
[аоуэыиеёюя] { ъ > ;
[:^Letter:] { [ъь] > ;
[ьъй] { [ьъ] > ;

::Title;
`;
