export const jaTgRules = `
０ > 0;
１ > 1;
２ > 2;
３ > 3;
４ > 4;
５ > 5;
６ > 6;
７ > 7;
８ > 8;
９ > 9;

ファ > fa;
ふぁ > fa;
フィ > fi;
ふぃ > fi;
フェ > fe;
ふぇ > fe;
フォ > fo;
ふぉ > fo;
フュ > fyu;
ふゅ > fyu;
ヴァ > va;
ゔぁ > va;
ヴィ > vi;
ゔぃ > vi;
ヴェ > ve;
ゔぇ > ve;
ヴォ > vo;
ゔぉ > vo;
ヴュ > vyu;
ゔゅ > vyu;
ティ > ti;
てぃ > ti;
トゥ > tu;
とぅ > tu;
テュ > tyu;
てゅ > tyu;
ディ > di;
でぃ > di;
ドゥ > du;
どぅ > du;
デュ > dyu;
でゅ > dyu;
ジェ > je;
じぇ > je;
チェ > che;
ちぇ > che;
シェ > she;
しぇ > she;
ウィ > wi;
うぃ > wi;
ウェ > we;
うぇ > we;
ウォ > wo;
うぉ > wo;
[^[:L:][:M:]] { [ヴゔ] } [^[:L:][:M:]] > vu;
[ヴゔ] > v;
[ぁァ] > a;
[ぃィゐ以] > i;
[ぅゥ] > u;
[ぇェ] > e;
[ぉォ] > o;
[ャゃ] > ya;
[ュゅ] > yu;
[ョょ予] > yo;
[亡剖] > bo;
[交勾] > ko;
企 > ki;
伺 > shi;
侶 > ryo;
促 > soku;
[俸倣] > ho;
倹 > ken;
偶 > gu;
備 > bi;
傲 > go;
傾 > kei;
冗 > jo;
凡 > bon;
刹 > satsu;
剥 > haku;
励 > rei;
劾 > gai;
匿 > toku;
受 > ju;

::Null;
::NFC;

tōkyō > токио;

[āâ] > a;
[īî] > i;
[ūû] > u;
[ēê] > e;
[ōô] > o;

::Null;

n ['’‘\`´ʼ] > нъ;

sha > ся;
shi > си;
shu > сю;
she > се;
sho > сё;
sh > с;

cha > тя;
chi > ти;
chu > тю;
che > те;
cho > тё;
c } ch > т;
t } ch > т;
ch > т;

ja > дзя;
ji > дзи;
ju > дзю;
je > дзе;
jo > дзё;
j > дз;

tsa > ца;
tsi > ци;
tsu > цу;
tse > це;
tso > цо;
t } ts > т;
ts > ц;

dza > дза;
dzi > дзи;
dzu > дзу;
dze > дзе;
dzo > дзо;
dz > дз;

ya > я;
yu > ю;
yo > ё;
ye > е;

a > а;
[аеёоуӯэюя] { i > й;
i > и;
u > у;
o > о;

[^[:L:][:M:]] { e > э;
[аеёиӣоуӯэюя] { e > э;
e > е;

n } [bpm] > м;
b > б;
c > ц;
d > д;
f > ф;
g > г;
h > ҳ;
k > к;
l > л;
m > м;
n > н;
p > п;
q > к;
r > р;
s > с;
t > т;
[vw] > в;
x > кс;
y > й;
z > дз;



::Null;

щ > шч;
ц > с;
ы > и;
ь > ;

::Null;

[^[:L:][:M:]] { ъ > ;
ъ } [^[:L:][:M:]] > ;

[:L:]+ [бвгғджзйкқлмнпрстфхҳчҷш] [иӣ] { а } [^[:L:][:M:]] > я;

::Null;

[^[:L:][:M:]] { ӣ > и;
ӣ } [[:L:][:M:]] > и;

::Null;

[бвгғджзйкқлмнпрстфхҳчҷш] { э > е;

::Null;

[жшчҷ] { ю > у;
[жшчҷ] { я > а;
[жшчҷ] { ё > о;

::Title;
`;
