export const bgMkRules = `
$upper = [АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЬЮЯ];
$cons = [БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ];

ДЖ > Џ;
Дж > Џ;
дЖ > џ;
дж > џ;

ДЗ > Ѕ;
Дз > Ѕ;
дЗ > ѕ;
дз > ѕ;

ГЬ > Ѓ;
Гь > Ѓ;
гЬ > ѓ;
гь > ѓ;

КЬ > Ќ;
Кь > Ќ;
кЬ > ќ;
кь > ќ;

ЛЬ > Љ;
Ль > Љ;
лЬ > љ;
ль > љ;

НЬ > Њ;
Нь > Њ;
нЬ > њ;
нь > њ;

ИА > ИЈА;
Иа > Ија;
иА > иЈА;
иа > ија;

ЬО > ЈО;
Ьо > Јо;
ьО > јО;
ьо > јо;

Щ } $upper > ШТ;
$upper { Щ > ШТ;
Щ > Шт;
щ > шт;

Ю } $upper > ЈУ;
$upper { Ю > ЈУ;
Ю > Ју;
ю > ју;

Я } $upper > ЈА;
$upper { Я > ЈА;
Я > Ја;
я > ја;

ИЙ } $cons > И;
Ий } $cons > И;
иЙ } $cons > и;
ий } $cons > и;

Й > Ј;
й > ј;

ЪР } $cons > Р;
Ър } $cons > Р;
ъР } $cons > р;
ър } $cons > р;
РЪ } $cons > Р;
Ръ } $cons > Р;
рЪ } $cons > р;
ръ } $cons > р;

Ъ > А;
ъ > а;

[Ьь] > ;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

лј > љ;
Лј > Љ;
ЛЈ > Љ;
лЈ > љ;
нј > њ;
Нј > Њ;
НЈ > Њ;
нЈ > њ;
дз > ѕ;
Дз > Ѕ;
ДЗ > Ѕ;
дЗ > ѕ;
дж > џ;
Дж > Џ;
ДЖ > Џ;
дЖ > џ;

Ји > И;
ЈИ > И;
ји > и;
јИ > И;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { ј } [еЕоО] > ;
[АЕИОУаеиоу] { Ј } [еЕоО] > ;

[:^Letter:] { ['’‘\`´ʼ"] } [рР] > ;

[:^Letter:] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[:^Letter:] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
