export const bgMkRules = `
$upper = [АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЬЮЯ];
$cons = [БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ];

ДЖ > Џ;
Дж > Џ;
дЖ > џ;
дж > џ;

ДЗ > Ѕ;
Дз > Ѕ;
дЗ > ѕ;
дз > ѕ;

ГЬ > Ѓ;
Гь > Ѓ;
гЬ > ѓ;
гь > ѓ;

КЬ > Ќ;
Кь > Ќ;
кЬ > ќ;
кь > ќ;

ЛЬ > Љ;
Ль > Љ;
лЬ > љ;
ль > љ;

НЬ > Њ;
Нь > Њ;
нЬ > њ;
нь > њ;

ИА > ИЈА;
Иа > Ија;
иА > иЈА;
иа > ија;

ЬО > ЈО;
Ьо > Јо;
ьО > јО;
ьо > јо;

Щ } $upper > ШТ;
$upper { Щ > ШТ;
Щ > Шт;
щ > шт;

Ю } $upper > ЈУ;
$upper { Ю > ЈУ;
Ю > Ју;
ю > ју;

Я } $upper > ЈА;
$upper { Я > ЈА;
Я > Ја;
я > ја;

ИЙ } $cons > И;
Ий } $cons > И;
иЙ } $cons > и;
ий } $cons > и;

Й > Ј;
й > ј;

ЪР } $cons > Р;
Ър } $cons > Р;
ъР } $cons > р;
ър } $cons > р;
РЪ } $cons > Р;
Ръ } $cons > Р;
рЪ } $cons > р;
ръ } $cons > р;

Ъ > А;
ъ > а;

Ь > ;
ь > ;

::Null;

аа > а;
АА > А;
бб > б;
ББ > Б;
вв > в;
ВВ > В;
гг > г;
ГГ > Г;
дд > д;
ДД > Д;
ѓѓ > ѓ;
ЃЃ > Ѓ;
ее > е;
ЕЕ > Е;
жж > ж;
ЖЖ > Ж;
зз > з;
ЗЗ > З;
ѕѕ > ѕ;
ЅЅ > Ѕ;
ии > и;
ИИ > И;
јј > ј;
ЈЈ > Ј;
кк > к;
КК > К;
лл > л;
ЛЛ > Л;
љљ > љ;
ЉЉ > Љ;
мм > м;
ММ > М;
нн > н;
НН > Н;
њњ > њ;
ЊЊ > Њ;
оо > о;
ОО > О;
пп > п;
ПП > П;
рр > р;
РР > Р;
сс > с;
СС > С;
тт > т;
ТТ > Т;
ќќ > ќ;
ЌЌ > Ќ;
уу > у;
УУ > У;
фф > ф;
ФФ > Ф;
хх > х;
ХХ > Х;
цц > ц;
ЦЦ > Ц;
чч > ч;
ЧЧ > Ч;
џџ > џ;
ЏЏ > Џ;
шш > ш;
ШШ > Ш;

::Null;

дз > ѕ;
ДЗ > Ѕ;
дж > џ;
ДЖ > Џ;
лј > љ;
ЛЈ > Љ;
нј > њ;
НЈ > Њ;
`;
