export const bgRuRules = `
[:^Letter:] { е > э;
[:^Letter:] { Е > Э;

българ > болгар;
Българ > Болгар;
БЪЛГАР > БОЛГАР;
първ > перв;
Първ > Перв;
ПЪРВ > ПЕРВ;
сърб > серб;
Сърб > Серб;
СЪРБ > СЕРБ;
въз > воз;
Въз > Воз;
ВЪЗ > ВОЗ;
съ > со;
Съ > Со;
СЪ > СО;

[бвгджзклмнпрстфхцчшщ] { ъ } р [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { Ъ } Р [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { ъ } р [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщ] { Ъ } Р [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщ] { ъ } л [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { Ъ } Л [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { ъ } л [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщ] { Ъ } Л [:^Letter:] > ;

[бвгджзклмнпрстфхцчшщ] { ъ } [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { Ъ } [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { ъ } [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщ] { Ъ } [:^Letter:] > ;

[:^Letter:] { ъ > и;
[:^Letter:] { Ъ > И;

жъ > же;
Жъ > Же;
ЖЪ > ЖЕ;
шъ > ше;
Шъ > Ше;
ШЪ > ШЕ;
чъ > че;
Чъ > Че;
ЧЪ > ЧЕ;
цъ > це;
Цъ > Це;
ЦЪ > ЦЕ;

ъ > ы;
Ъ > Ы;

[бвгджзклмнпрстфхцчшщ] { йо > ё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { йо > ё;
[бвгджзклмнпрстфхцчшщ] { Йо > Ё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { Йо > Ё;
[бвгджзклмнпрстфхцчшщ] { ЙО > Ё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { ЙО > Ё;

ьо > ё;
Ьо > Ё;
ЬО > Ё;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

йй > й;
йЙ > й;
Йй > Й;
ЙЙ > Й;

::Null;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[:^Letter:] { [ъЪьЬ] > ;
[ъЪ] } [:^Letter:] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
