export const bgRuRules = `
[:^Letter:] { е > э;
[:^Letter:] { Е > Э;

българ > болгар;
Българ > Болгар;
БЪЛГАР > БОЛГАР;
първ > перв;
Първ > Перв;
ПЪРВ > ПЕРВ;
сърб > серб;
Сърб > Серб;
СЪРБ > СЕРБ;
въз > воз;
Въз > Воз;
ВЪЗ > ВОЗ;
съ > со;
Съ > Со;
СЪ > СО;

[бвгджзклмнпрстфхцчшщ] { ъ } р [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { Ъ } Р [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { ъ } р [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщ] { Ъ } Р [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщ] { ъ } л [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { Ъ } Л [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { ъ } л [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщ] { Ъ } Л [:^Letter:] > ;

[бвгджзклмнпрстфхцчшщ] { ъ } [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { Ъ } [:^Letter:] > ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { ъ } [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщ] { Ъ } [:^Letter:] > ;

[:^Letter:] { ъ > и;
[:^Letter:] { Ъ > И;

жъ > же;
Жъ > Же;
ЖЪ > ЖЕ;
шъ > ше;
Шъ > Ше;
ШЪ > ШЕ;
чъ > че;
Чъ > Че;
ЧЪ > ЧЕ;
цъ > це;
Цъ > Це;
ЦЪ > ЦЕ;

ъ > ы;
Ъ > Ы;

[бвгджзклмнпрстфхцчшщ] { йо > ё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { йо > ё;
[бвгджзклмнпрстфхцчшщ] { Йо > Ё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { Йо > Ё;
[бвгджзклмнпрстфхцчшщ] { ЙО > Ё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩ] { ЙО > Ё;

ьо > ё;
Ьо > Ё;
ЬО > Ё;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[Йй] { [Йй] > ;

::Null;

[ьъЬЪ] { й [аА] > я;
[ьъЬЪ] { Й [аА] > Я;
[ьъЬЪ] { й [оО] > ё;
[ьъЬЪ] { Й [оО] > Ё;
[ьъЬЪ] { й [еЕ] > е;
[ьъЬЪ] { Й [еЕ] > Е;
[ьъЬЪ] { й [уУ] > ю;
[ьъЬЪ] { Й [уУ] > Ю;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йа > иа;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йА > иА;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йа > Иа;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙА > ИА;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йо > ио;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йО > иО;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йо > Ио;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙО > ИО;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йе > ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЕ > ьЕ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йе > Ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЕ > ЬЕ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йу > ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йУ > ьЮ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йу > Ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙУ > ЬЮ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йи > ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йИ > ьИ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йи > Ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙИ > ЬИ;

й [иИ] > и;
Й [иИ] > И;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [:^Letter:] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [:^Letter:] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

::Null;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] > ;
[ъЪ] } [:^Letter:] > ;
[ъЪ] } [аоуэыиАОУЭЫИ] > ;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { [ъЪ] > ;
[:^Letter:] { [ъЪьЬ] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
