// ELOT 743, 2nd ed.

export const elEnRules = `
::NFD;

̓ > ;
̔ > ;
ͅ > ;

ΑΫ́ > AŸ́;
ΑΫ > AŸ;
Αΰ > Aÿ́;
Αϋ > Aÿ;
αΰ > aÿ́;
αϋ > aÿ;
ΕΫ́ > EŸ́;
ΕΫ > EŸ;
Εΰ > Eÿ́;
Εϋ > Eÿ;
εΰ > eÿ́;
εϋ > eÿ;
ΗΫ́ > IŸ́;
ΗΫ > IŸ;
Ηΰ > Iÿ́;
Ηϋ > Iÿ;
ηΰ > iÿ́;
ηϋ > iÿ;
ΟΫ́ > OŸ́;
ΟΫ > OŸ;
Οΰ > Oÿ́;
Οϋ > Oÿ;
οΰ > oÿ́;
οϋ > oÿ;

Αύ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Áv;
Αυ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Av;
ΑΎ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > ÁV;
ΑΥ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > AV;
αύ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > áv;
αυ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > av;

Αύ > Áf;
Αυ > Af;
ΑΎ > ÁF;
ΑΥ > AF;
αύ > áf;
αυ > af;

Εύ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Év;
Ευ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Ev;
ΕΎ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > ÉV;
ΕΥ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > EV;
εύ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > év;
ευ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > ev;

Εύ > Éf;
Ευ > Ef;
ΕΎ > ÉF;
ΕΥ > EF;
εύ > éf;
ευ > ef;

Ηύ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Ív;
Ηυ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Iv;
ΗΎ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > ÍV;
ΗΥ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > IV;
ηύ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > ív;
ηυ } [:Mn:]* [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > iv;

Ηύ > Íf;
Ηυ > If;
ΗΎ > ÍF;
ΗΥ > IF;
ηύ > íf;
ηυ > if;

Ού > Oú;
Ου > Ou;
ΟΎ > OÚ;
ΟΥ > OU;
ού > oú;
ου > ou;

Αί > Aí;
Αι > Ai;
ΑΊ > AÍ;
ΑΙ > AI;
αί > aí;
αι > ai;

Εί > Eí;
Ει > Ei;
ΕΊ > EÍ;
ΕΙ > EI;
εί > eí;
ει > ei;

Οί > Oí;
Οι > Oi;
ΟΊ > OÍ;
ΟΙ > OI;
οί > oí;
οι > oi;

Υί > Yí;
Υι > Yi;
ΥΊ > YÍ;
ΥΙ > YI;
υί > yí;
υι > yi;

ΓΚ } [:Ll:] > Gk;
ΓΚ > GK;
Γκ > Gk;
γκ > gk;

[:^Letter:] { ΜΠ > B;
[:^Letter:] { Μπ > B;
ΜΠ } [:^Letter:] > B;
Μπ } [:^Letter:] > b;
μπ } [:^Letter:] > b;
[:^Letter:] { μπ > b;

ΜΠ } [:Ll:] > Mp;
ΜΠ > MP;
Μπ > Mp;
μπ > mp;

ΝΤ } [:Ll:] > Nt;
ΝΤ > NT;
Ντ > Nt;
ντ > nt;

ΓΓ } [:Ll:] > Ng;
ΓΓ > NG;
Γγ > Ng;
γγ > ng;

ΓΞ } [:Ll:] > Nx;
ΓΞ > NX;
Γξ > Nx;
γξ > nx;

ΓΧ } [:Ll:] > Nch;
ΓΧ > NCH;
Γχ > Nch;
γχ > nch;

Θ } [:Ll:] > Th;
Θ > TH;
θ > th;

Χ } [:Ll:] > Ch;
Χ > CH;
χ > ch;

Ψ } [:Ll:] > Ps;
Ψ > PS;
ψ > ps;

Α > A;
α > a;
Β > V;
β > v;
Γ > G;
γ > g;
Δ > D;
δ > d;
Ε > E;
ε > e;
Ζ > Z;
ζ > z;
Η > I;
η > i;
Ι > I;
ι > i;
Κ > K;
κ > k;
Λ > L;
λ > l;
Μ > M;
μ > m;
Ν > N;
ν > n;
Ξ > X;
ξ > x;
Ο > O;
ο > o;
Π > P;
π > p;
Ρ > R;
ρ > r;
Σ > S;
σ > s;
ς > s;
Τ > T;
τ > t;
Υ > Y;
υ > y;
Φ > F;
φ > f;
Ω > O;
ω > o;

::NFC;
::Null;

[wW] { [wW] > ;
[yY] { [yY] > ;
[hH] { [hH] > ;
[iI] { [iIyY] } [:^Letter:] > ;
[yY] { [iIyY] } [:^Letter:] > ;
[:^Letter:] { [cC] } [kK] > ;

::Null;

[kK] { [kK] } [hH] > ;
[gG] { [gG] } [hH] > ;
`;
