export const elLatnRules = `
::NFD;

[́̀͂̓̔ͅ] > ;

::Null;

ΑΫ > AI;
Αϋ > Ai;
αϋ > ai;
ΕΫ > EI;
Εϋ > Ei;
εϋ > ei;
ΗΫ > II;
Ηϋ > Ii;
ηϋ > ii;
ΟΫ > OI;
Οϋ > Oi;
οϋ > oi;
ΑΪ > AI;
Αϊ > Ai;
αϊ > ai;
ΕΪ > EI;
Εϊ > Ei;
εϊ > ei;
ΟΪ > OI;
Οϊ > Oi;
οϊ > oi;
ΥΪ > II;
Υϊ > Ii;
υϊ > ii;

ΑΥ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > AV;
Αυ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Av;
αυ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > av;
ΑΥ > AF;
Αυ > Af;
αυ > af;

ΕΥ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > EV;
Ευ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Ev;
ευ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > ev;
ΕΥ > EF;
Ευ > Ef;
ευ > ef;

ΗΥ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > IV;
Ηυ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > Iv;
ηυ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > iv;
ΗΥ > IF;
Ηυ > If;
ηυ > if;

ΟΥ > U;
Ου > U;
ου > u;

ΑΙ > E;
Αι > E;
αι > e;

ΕΙ > I;
Ει > I;
ει > i;

ΟΙ > I;
Οι > I;
οι > i;

ΥΙ > I;
Υι > I;
υι > i;

[:^Letter:] { ΜΠ > B;
[:^Letter:] { Μπ > B;
[:^Letter:] { μπ > b;
ΜΠ } [:^Letter:] > B;
Μπ } [:^Letter:] > b;
μπ } [:^Letter:] > b;
ΜΠ } [:Lower:] > Mb;
ΜΠ > MB;
Μπ > Mb;
μπ > mb;

[:^Letter:] { ΝΤ > D;
[:^Letter:] { Ντ > D;
[:^Letter:] { ντ > d;
ΝΤ } [:^Letter:] > D;
Ντ } [:^Letter:] > d;
ντ } [:^Letter:] > d;
ΝΤ } [:Lower:] > Nd;
ΝΤ > ND;
Ντ > Nd;
ντ > nd;

[:^Letter:] { ΓΚ > G;
[:^Letter:] { Γκ > G;
[:^Letter:] { γκ > g;
ΓΚ } [:^Letter:] > G;
Γκ } [:^Letter:] > g;
γκ } [:^Letter:] > g;
ΓΚ } [:Lower:] > Ng;
ΓΚ > NG;
Γκ > Ng;
γκ > ng;

ΓΓ } [:Lower:] > Ng;
ΓΓ > NG;
Γγ > Ng;
γγ > ng;

ΓΞ } [:Lower:] > Nks;
ΓΞ > NKS;
Γξ > Nks;
γξ > nks;

ΓΧ } [:Lower:] > Nx;
ΓΧ > NX;
Γχ > Nx;
γχ > nx;

ΤΣ } [:Lower:] > Ts;
ΤΣ > TS;
Τσ > Ts;
Τς > Ts;
τσ > ts;
τς > ts;

ΤΖ } [:Lower:] > Dz;
ΤΖ > DZ;
Τζ > Dz;
τζ > dz;

Α > A;
α > a;
Β > V;
β > v;
Γ } [:Lower:] > Gh;
Γ > GH;
γ > gh;
Δ > D;
δ > d;
Ε > E;
ε > e;
Ζ > Z;
ζ > z;
Η > I;
η > i;
Θ } [:Lower:] > Th;
Θ > TH;
θ > th;
Ι > I;
ι > i;
Κ > K;
κ > k;
Λ > L;
λ > l;
Μ > M;
μ > m;
Ν > N;
ν > n;
Ξ } [:Lower:] > Ks;
Ξ > KS;
ξ > ks;
Ο > O;
ο > o;
Π > P;
π > p;
Ρ > R;
ρ > r;
Σ > S;
σ > s;
ς > s;
Τ > T;
τ > t;
Υ > I;
υ > i;
Φ > F;
φ > f;
Χ > X;
χ > x;
Ψ } [:Lower:] > Ps;
Ψ > PS;
ψ > ps;
Ω > O;
ω > o;

̈ > ;

::NFC;
`;
