export const elLatnRules = `
::NFD;

[́̀͂̓̔ͅ] > ;

::Null;

Α Υ ̈ > A I;
Α υ ̈ > A i;
α υ ̈ > a i;
Ε Υ ̈ > E I;
Ε υ ̈ > E i;
ε υ ̈ > e i;
Η Υ ̈ > I I;
Η υ ̈ > I i;
η υ ̈ > i i;
Ο Υ ̈ > O I;
Ο υ ̈ > O i;
ο υ ̈ > o i;
Α Ι ̈ > A I;
Α ι ̈ > A i;
α ι ̈ > a i;
Ε Ι ̈ > E I;
Ε ι ̈ > E i;
ε ι ̈ > e i;
Ο Ι ̈ > O I;
Ο ι ̈ > O i;
ο ι ̈ > o i;
Υ Ι ̈ > I I;
Υ ι ̈ > I i;
υ ι ̈ > i i;

Α Υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > A V;
Α υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > A v;
α υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > a v;
Α Υ > A F;
Α υ > A f;
α υ > a f;

Ε Υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > E V;
Ε υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > E v;
ε υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > e v;
Ε Υ > E F;
Ε υ > E f;
ε υ > e f;

Η Υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > I V;
Η υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > I v;
η υ } [βγδζλμνρΒΓΔΖΛΜΝΡαεηιουωΑΕΗΙΟΥΩ] > i v;
Η Υ > I F;
Η υ > I f;
η υ > i f;

Ο Υ > U;
Ο υ > U;
ο υ > u;

Α Ι > E;
Α ι > E;
α ι > e;

Ε Ι > I;
Ε ι > I;
ε ι > i;

Ο Ι > I;
Ο ι > I;
ο ι > i;

Υ Ι > I;
Υ ι > I;
υ ι > i;

[:^Letter:] { Μ Π > B;
[:^Letter:] { Μ π > B;
[:^Letter:] { μ π > b;
Μ Π } [:^Letter:] > B;
Μ π } [:^Letter:] > b;
μ π } [:^Letter:] > b;
Μ Π } [:Lower:] > M b;
Μ Π > M B;
Μ π > M b;
μ π > m b;

[:^Letter:] { Ν Τ > D;
[:^Letter:] { Ν τ > D;
[:^Letter:] { ν τ > d;
Ν Τ } [:^Letter:] > D;
Ν τ } [:^Letter:] > d;
ν τ } [:^Letter:] > d;
Ν Τ } [:Lower:] > N d;
Ν Τ > N D;
Ν τ > N d;
ν τ > n d;

[:^Letter:] { Γ Κ > G;
[:^Letter:] { Γ κ > G;
[:^Letter:] { γ κ > g;
Γ Κ } [:^Letter:] > G;
Γ κ } [:^Letter:] > g;
γ κ } [:^Letter:] > g;
Γ Κ } [:Lower:] > N g;
Γ Κ > N G;
Γ κ > N g;
γ κ > n g;

Γ Γ } [:Lower:] > N g;
Γ Γ > N G;
Γ γ > N g;
γ γ > n g;

Γ Ξ } [:Lower:] > N k s;
Γ Ξ > N K S;
Γ ξ > N k s;
γ ξ > n k s;

Γ Χ } [:Lower:] > N x;
Γ Χ > N X;
Γ χ > N x;
γ χ > n x;

Τ Σ } [:Lower:] > T s;
Τ Σ > T S;
Τ σ > T s;
Τ ς > T s;
τ σ > t s;
τ ς > t s;

Τ Ζ } [:Lower:] > D z;
Τ Ζ > D Z;
Τ ζ > D z;
τ ζ > d z;

Α > A;
α > a;
Β > V;
β > v;
Γ } [:Lower:] > G h;
Γ > G H;
γ > g h;
Δ } [:Lower:] > D h;
Δ > D H;
δ > d h;
Ε > E;
ε > e;
Ζ > Z;
ζ > z;
Η > I;
η > i;
Θ } [:Lower:] > T h;
Θ > T H;
θ > t h;
Ι > I;
ι > i;
Κ > K;
κ > k;
Λ > L;
λ > l;
Μ > M;
μ > m;
Ν > N;
ν > n;
Ξ } [:Lower:] > K s;
Ξ > K S;
ξ > k s;
Ο > O;
ο > o;
Π > P;
π > p;
Ρ > R;
ρ > r;
Σ > S;
σ > s;
ς > s;
Τ > T;
τ > t;
Υ > I;
υ > i;
Φ > F;
φ > f;
Χ > X;
χ > x;
Ψ } [:Lower:] > P s;
Ψ > P S;
ψ > p s;
Ω > O;
ω > o;

̈ > ;

::NFC;
`;
