export const hiIpaRules = `
::Lower;

\u200C > ;
\u200D > ;

ं } क > ŋ;
ं } ख > ŋ;
ं } ग > ŋ;
ं } घ > ŋ;
ं } च > ɲ;
ं } छ > ɲ;
ं } ज > ɲ;
ं } झ > ɲ;
ं } ट > ɳ;
ं } ठ > ɳ;
ं } ड > ɳ;
ं } ढ > ɳ;
ं } त > n;
ं } थ > n;
ं } द > n;
ं } ध > n;
ं } प > m;
ं } फ > m;
ं } ब > m;
ं } भ > m;
ं >  ̃;

ज ् ञ > ɡ j ə;

क़ ् > q;
ख़ ् > x;
ग़ ् > ɣ;
ज़ ् > z;
ड़ ् > ɽ;
ढ़ ् > ɽʱ;
फ़ ् > f;
य़ ् > j;

क ् > k;
ख ् > kʰ;
ग ् > ɡ;
घ ् > ɡʱ;
ङ ् > ŋ;
च ् > t͡ʃ;
छ ् > t͡ʃʰ;
ज ् > d͡ʒ;
झ ् > d͡ʒʱ;
ञ ् > ɲ;
ट ् > ʈ;
ठ ् > ʈʰ;
ड ् > ɖ;
ढ ् > ɖʱ;
ण ् > ɳ;
त ् > t̪;
थ ् > t̪ʰ;
द ् > d̪;
ध ् > d̪ʱ;
न ् > n;
प ् > p;
फ ् > pʰ;
ब ् > b;
भ ् > bʱ;
म ् > m;
य ् > j;
र ् > ɾ;
ल ् > l;
ळ ् > ɭ;
व ् > ʋ;
श ् > ʃ;
ष ् > ʂ;
स ् > s;
ह ् > ɦ;

क ़ > qə;
ख ़ > xə;
ग ़ > ɣə;
ज ़ > zə;
ड ़ > ɽə;
ढ ़ > ɽʱə;
फ ़ > fə;
य ़ > jə;

क > kə;
ख > kʰə;
ग > ɡə;
घ > ɡʱə;
ङ > ŋə;
च > t͡ʃə;
छ > t͡ʃʰə;
ज > d͡ʒə;
झ > d͡ʒʱə;
ञ > ɲə;
ट > ʈə;
ठ > ʈʰə;
ड > ɖə;
ढ > ɖʱə;
ण > ɳə;
त > t̪ə;
थ > t̪ʰə;
द > d̪ə;
ध > d̪ʱə;
न > nə;
प > pə;
फ > pʰə;
ब > bə;
भ > bʱə;
म > mə;
य > jə;
र > ɾə;
ल > lə;
ळ > ɭə;
व > ʋə;
श > ʃə;
ष > ʂə;
स > sə;
ह > ɦə;

अ > ə;
आ > aː;
इ > ɪ;
ई > iː;
उ > ʊ;
ऊ > uː;
ऋ > ɾɪ;
ॠ > ɾiː;
ऌ > li;
ॡ > liː;
ए > eː;
ऐ > ɛː;
ओ > oː;
औ > ɔː;
ऑ > ɔ;
ऍ > ɛ;
ॐ > oːm;
ऽ > ʔ;

::Null;

əा > aː;
əि > ɪ;
əी > iː;
əु > ʊ;
əू > uː;
əृ > ɾɪ;
əॄ > ɾiː;
əॅ > æ;
əॆ > e;
əे > eː;
əै > ɛː;
əॉ > ɔ;
əॊ > o;
əो > oː;
əौ > ɔː;

् > ;

ँ >  ̃;
ः > h;

::Null;

[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] t͡ʃ [̪ʰʱ͡]* { ə } [:^Letter:] > ;
[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] d͡ʒ [̪ʰʱ͡]* { ə } [:^Letter:] > ;

[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* { ə } [:^Letter:] > ;

[kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* [kɡŋɲʈɖɳnpbʃʂsɦqxɣzʒɽftd] [̪ʰʱ͡]* { ə } [:^Letter:] > ;
[kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* t͡ʃ [̪ʰʱ͡]* { ə } [:^Letter:] > ;
[kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* d͡ʒ [̪ʰʱ͡]* { ə } [:^Letter:] > ;

::Null;

[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] t͡ʃ [̪ʰʱ͡]* { ə } t͡ʃ [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;
[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] t͡ʃ [̪ʰʱ͡]* { ə } d͡ʒ [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;
[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] t͡ʃ [̪ʰʱ͡]* { ə } [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;

[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] d͡ʒ [̪ʰʱ͡]* { ə } t͡ʃ [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;
[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] d͡ʒ [̪ʰʱ͡]* { ə } d͡ʒ [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;
[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] d͡ʒ [̪ʰʱ͡]* { ə } [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;

[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* { ə } t͡ʃ [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;
[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* { ə } d͡ʒ [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;
[ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* { ə } [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* [ə a {aː} ɪ i {iː} ʊ u {uː} e {eː} o {oː} ɛ {ɛː} æ ɔ {ɔː} ː ̃] > ;

j̃ > jə̃;
ʋ̃ > ʋə̃;
`;
