export const ipaFrRules = `
::Null;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̊͡ʔ] > ;

c > k;

::Null;

[aeiouyâæêôõøăęĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽwjɥ] { s } [aeiouyâæêôõøăęĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽwjɥ] > ss;
ɲ } [:^Letter:] > gne;
k } [eêiɛɪɨɘəɚɜɝøɵœęĩẽ] > qu;
k } [hɦħʕjʝɟ] > k;
k > c;
[gɡɢ] } [eêiɛɪɨɘəɚɜɝøɵœęĩẽjʝɟ] > gu;
[gɡɢ] > g;
[ɣɰ] > gh;
[ɑaɐɒăʌ]̃ > an;
[ɛeɘəɜɪi]̃ > in;
[ɔoơɤ]̃ > on;
[œøɵuʊɯưw]̃ > un;
̃ > n;
[ęẽĩ] > in;
õ > on;
ũ > un;
[ɑɐɒăʌ] > a;
æ > ae;
[ɚɝ] > er;
[ɘəɜ] > e;
ɛ > è;
e > é;
[ɪɨ] > i;
[ɔơɤ] > o;
[uʊɯưw] > ou;
[yʏʉɥ] > u;
[øɵœ] > eu;
ɓ > b;
č > tch;
[ɖɗðď] > d;
[ɦħʕ] > h;
[ɫɭ] > l;
ɱ > m;
ɳ > n;
ɲ > gn;
ŋ > ng;
[ɹɽɾʀʁ] > r;
[ʂʃɕɧç] > ch;
[ʈťθ] > t;
[ʋβ] > v;
ʎ > ill;
[ʐʑʒž] > j;
[ʝɟj] > y;
[χx] > kh;
ɸ > f;

::Null;

ç } [eéèêëiîïy] > c;
`;
