export const ipaViRules = `
::Null;

[͈̚ʔʕ'’ˈˌːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʼ̧̇] > ;

::Null;

ŋ } [ieêyɪɨĩęɛæœøʏɵʉ] > ngh;
ŋ > ng;
[gɡɢɟɣɰʁ] } [ieêyɪɨĩęɛæœøʏɵʉ] > gh;
[gɡɢɟɣɰʁ] > g;
[kq] } [ieêyɪɨĩęɛæœøʏɵʉ] > k;
[kq] } [wʷuʊũ] > q;
[kq] > c;
[:^Letter:] { [jʝ] > gi;
[jʝ] > y;
[:^Letter:] { [wɥ] > v;
[wɥ] > o;
[ɑɐæ] > a;
[ɛęẽ] > e;
[ɪɨĩʲ] > i;
[ɔɒõ] > o;
[ʊũʷ] > u;
[ɯ] > ư;
[ɤʌəɘɚɜɝ] > ơ;
[yʏøœɵʉ] > uy;
[ɓ] > b;
[cčç] > ch;
[dɖďɗð] > đ;
[fɸ] > ph;
[ɦɧħʰʱ] > h;
[ɫɭʎ] > l;
[ɱ] > m;
[ɳ] > n;
[ɲ] > nh;
[ɹɽɾʀʐ] > r;
[sɕʃθ] > x;
[ʂ] > s;
[ťʈ] > t;
[ʋβ] > v;
[xχ] > kh;
[zʑʒž] > d;
`;
