export const ipaHyRules = `
::Null;

[:^Letter:] { [eêęẽœøɛ] } > ե;
[eêęẽœøɛ] > է;
[:^Letter:] { [oôõơɒɔɵ] } > ո;
[oôõơɒɔɵ] > օ;
[aâæăɐɑʌ] > ա;
[iĩɨɪyʏ] > ի;
[uũưɯʉʊ] > ու;
[əɘɚɝɤ] > ը;

[tťʈ]͡[sɕʂ]ʰ > ց;
[tťʈ][sɕʂ]ʰ > ց;
[tťʈ]͡[ʃɧ]ʰ > չ;
[tťʈ][ʃɧ]ʰ > չ;
[tťʈ]͡[sɕʂ] > ծ;
[tťʈ][sɕʂ] > ծ;
[tťʈ]͡[ʃɧ] > ճ;
[tťʈ][ʃɧ] > ճ;
[dďðɖɗ]͡[zʑʐ] > ձ;
[dďðɖɗ][zʑʐ] > ձ;
[dďðɖɗ]͡[ʒž] > ջ;
[dďðɖɗ][ʒž] > ջ;

čʰ > չ;
č > ճ;

[pɓ] ʰ > փ;
[tťʈ] ʰ > թ;
[kc] ʰ > ք;
qʰ > ք;

[pɓ] > պ;
[bβ] > բ;
[tťʈ] > տ;
[dďðɖɗ] > դ;
[kc] > կ;
[gɡɢɟ] > գ;
q > ք;

[fɸ] > ֆ;
[vʋw] > վ;
[hɦħ] > հ;
[xχç] > խ;
[ɣɰʁʕ] > ղ;
θ > թ;

[sɕʂ] > ս;
[zʑʐ] > զ;
[ʃɧ] > շ;
[ʒž] > ժ;

[mɱ] > մ;
[nŋɲɳ] > ն;
[lɫɭʎ] > լ;
[rʀ] > ռ;
[ɾɽɹ] > ր;
[jɥʝ] > յ;

ʲ > յ;
ʷ > վ;
ˠ > ղ;
ʰ > հ;

[͈̚ʔʱʼˈ̇ˌːˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[:^Letter:] { ր > ռ;
[:^Letter:] { ո > օ;
[:^Letter:] { ե > է;
[:^Letter:] { յի > ի;
յէ > յե;
յօ > յո;
եօ > եո;
րր > ռռ;
յյ > յ;
[:^Letter:] { ւ > վ;
[^ոՈ] { ւ > վ;
`;
