export const ipaHuRules = `
::Null;

[ʔʕʰʱʲʷʼˈ̇ˌ̧ˠˤ˥˧˩̝̟̥̩̪̯̊͡] > ;

::Null;

tʃ ː > ccs;
dʒ ː > ddzs;
ts ː > cc;
dz ː > ddz;
tɕ ː > ccs;
dʑ ː > ddzs;
ʈʂ ː > ccs;
ɖʐ ː > ddzs;

tʃ > cs;
dʒ > dzs;
ts > c;
tɕ > cs;
dʑ > dzs;
ʈʂ > cs;
ɖʐ > dzs;

p ː > pp;
[bɓ] ː > bb;
[tʈ] ː > tt;
[dɖɗð] ː > dd;
[kq] ː > kk;
[gɡɢɣ] ː > gg;
[cť] ː > tty;
[ɟď] ː > ggy;
[mɱ] ː > mm;
[nɳŋ] ː > nn;
ɲ ː > nny;
f ː > ff;
[vwβʋ] ː > vv;
[sθ] ː > ssz;
[ʃɕʂɧ] ː > ss;
z ː > zz;
[ʒʑʐž] ː > zzs;
[xhχħçɦ] ː > hh;
[jɥʝ] ː > jj;
[lɫɭ] ː > ll;
ʎ ː > lly;
[rɹɽɾʀʁ] ː > rr;
č ː > ccs;

ɓ > b;
[cť] > ty;
[ɖɗð] > d;
q > k;
[ɡɢɣ] > g;
[ɟď] > gy;
ɱ > m;
[ɳŋ] > n;
ɲ > ny;
[wβʋ] > v;
[sθ] > sz;
[ʃɕʂɧ] > s;
[ʒʑʐž] > zs;
[xχħçɦ] > h;
[ɥʝ] > j;
[ɫɭ] > l;
ʎ > ly;
[ɹɽɾʀʁ] > r;
č > cs;

[aɑɒɐʌăâæ] ː > á;
[eɛəɘɚɜɝêęœ] ː > é;
[iɪɨ] ː > í;
[oɔɤôơ] ː > ó;
[øɵ] ː > ő;
[uʊɯʉư] ː > ú;
[yʏ] ː > ű;

ẽ ː > én;
ĩ ː > ín;
ũ ː > ún;
õ ː > ón;

[ɑɒɐʌăâæ] > a;
[ɛəɘɚɜɝêęœ] > e;
[ɪɨ] > i;
[ɔɤôơ] > o;
[øɵ] > ö;
[ʊɯʉư] > u;
[yʏ] > ü;

ẽ > en;
ĩ > in;
ũ > un;
õ > on;

̃ > n;
ː > ;
`;
