export const ipaRuRules = `
::Null;

[:^Letter:] { j [aɑɐɒâăʌ] } > я;
[aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ] { j [aɑɐɒâăʌ] } > я;
[:^Letter:] { j [eɛæœøêęəɘɜɵɤẽ] } > е;
[aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ] { j [eɛæœøêęəɘɜɵɤẽ] } > е;
[:^Letter:] { j [oɔôõơ] } > ё;
[aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ] { j [oɔôõơ] } > ё;
[:^Letter:] { j [uʊʉũưyʏ] } > ю;
[aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ] { j [uʊʉũưyʏ] } > ю;

[͈̚ ʰ ʱ ʷ ʼ ˈ ̇ ˌ ̧ ː ˠ ˤ ˥ ˧ ˩ ̝ ̟ ̥ ̩ ̪ ̯ ̃ ̊ ͡] > ;

ʲ > ь;
[:^Letter:] { [ɚɝ] > эр;
[аоуыиеёюя] { [ɚɝ] > эр;
[ɚɝ] > ер;
ʎ > ль;
ɲ > нь;
[cčç] > ч;
[s] > с;
[z] > з;
[ʃʂ] > ш;
[ɕ] > щ;
[ʒɧʑʐž] > ж;
[mɱ] > м;
[nɳŋ] > н;
[lɫɭ] > л;
[rɹɽɾʀʁ] > р;
[bɓ] > б;
[p] > п;
[dɖɗďð] > д;
[tʈťθ] > т;
[gɡɢɣɰ] > г;
[kq] > к;
[vʋwβ] > в;
[fɸ] > ф;
[hɦħχx] > х;
[ʔʕ] > ъ;
[jʝɟɥ] > й;
[aɑɐɒâăʌ] > а;
[:^Letter:] { [eɛæœøêęəɘɜɵɤẽ] > э;
[аоуыиеёюя] { [eɛæœøêęəɘɜɵɤẽ] > э;
[eɛæœøêęəɘɜɵɤẽ] > е;
[iɪĩ] > и;
[ɨɯ] > ы;
[oɔôõơ] > о;
[uʊʉũư] > у;
[yʏ] > ю;

::Null;

[жшчщ] { ы > и;
й { й > ;

::Null;

[ьъ] { йа > я;
[ьъ] { йо > ё;
[ьъ] { йе > е;
[ьъ] { йу > ю;
[бвгджзйклмнпрстфхцчшщ] { йа > ья;
[бвгджзйклмнпрстфхцчшщ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщ] { йе > ье;
[бвгджзйклмнпрстфхцчшщ] { йу > ью;
[бвгджзйклмнпрстфхцчшщ] { йи > ьи;
йи > и;
[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщьъ] { й } [:^Letter:] > и;
[бвгджзйклмнпрстфхцчшщьъ] { й } [бвгджзйклмнпрстфхцчшщ] > и;

::Null;

[бвгджзйклмнпрстфхцчшщ] { ъ } [бвгджзклмнпрстфхцчшщ] > ;
ъ } [:^Letter:] > ;
ъ } [аоуэыи] > ;
[аоуэыиеёюя] { ъ > ;
[:^Letter:] { [ъь] > ;
[ьъй] { [ьъ] > ;
`;
