export const ipaKaRules = `
::Null;

[:^Letter:] { ʔ > ;

t͡ʃʼ > ჭ;
t͡ʃʰ > ჩ;
t͡ʃ > ჩ;
tʃʼ > ჭ;
tʃʰ > ჩ;
tʃ > ჩ;

t͡sʼ > წ;
t͡sʰ > ც;
t͡s > ც;
tsʼ > წ;
tsʰ > ც;
ts > ც;

d͡ʒ > ჯ;
dʒ > ჯ;
d͡z > ძ;
dz > ძ;

pʼ > პ;
pʰ > ფ;
p > პ;

[tťʈ]ʼ > ტ;
[tťʈ]ʰ > თ;
[tťʈ] > ტ;

kʼ > კ;
kʰ > ქ;
k > კ;

qʼ > ყ;
qʰ > ყ;
q > ყ;

cʼ > წ;
cʰ > ც;
c > ც;

čʼ > ჭ;
čʰ > ჩ;
č > ჩ;

[aâæăɐɑɒʌ] > ა;
[eêęẽɘəɚɛɜɝ] > ე;
[iĩɨɪyʏ] > ი;
[oôõøœơɔɵɤ] > ო;
[uũưʉʊɯ] > უ;

[bɓβ] > ბ;
[dďɖɗð] > დ;
[gɡɟ] > გ;
[vʋwɥ] > ვ;
[zʑʐ] > ზ;
[ʒž] > ჟ;
[sʂ] > ს;
[ʃɕç] > შ;
[mɱ] > მ;
[nŋɲɳ] > ნ;
[lɫɭʎ] > ლ;
[rɾɹʀɽ] > რ;
[jʝ] > ი;
f > ფ;
θ > თ;
[xχ] > ხ;
[ɣʁɢ] > ღ;
[hɦħɧʕʔ] > ჰ;

[ʰʱʲʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] >;
`;
