export const ipaRoRules = `
::Null;

[͈̚ʰʱʲʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʔʕ] > ;

::Null;

tʃ } [eiɛɪĩẽêęæœyʏjɥ] > c;
tʃ > ci;
dʒ } [eiɛɪĩẽêęæœyʏjɥ] > g;
dʒ > gi;
ts > ț;
dz > z;

[cč] } [eiɛɪĩẽêęæœyʏjɥ] > c;
[cč] > ci;
ɟ } [eiɛɪĩẽêęæœyʏjɥ] > g;
ɟ > gi;

[kq] } [eiɛɪĩẽêęæœyʏjɥ] > ch;
[kq] > c;
[gɡɢɣɰ] } [eiɛɪĩẽêęæœyʏjɥ] > gh;
[ɡɢɣɰ] > g;

[:^Letter:] { [ɨɯư] > î;
[ɨɯư] } [:^Letter:] > î;
[ɨɯư] > â;

ɓ > b;
[ďɖɗð] > d;
[ħɦɧχçx] > h;
[ɫɭ] > l;
ʎ > li;
ɱ > m;
[ɳŋ] > n;
ɲ > ni;
[ɹɽɾʀʁ] > r;
[ɕʂʃ] > ș;
[ťʈθ] > t;
[ʋβ] > v;
ɸ > f;
w > u;
[žʐʑʒʝ] > j;

[jyɪĩɥʏ] > i;
[ɐɑɒʌ] > a;
[ɘəɚɜɝơ] > ă;
[æɛẽêęœ] > e;
[ɔôõøɤɵ] > o;
[ũʉʊ] > u;

::Null;

[:^Letter:] { â > î;
â } [:^Letter:] > î;
[:Letter:] { î } [:Letter:] > â;
`;
