export const ipaLvRules = `
::Null;

t ͡ s > c;
t s > c;
d ͡ z > dz;
d z > dz;
t ͡ ʃ > č;
t ʃ > č;
d ͡ ʒ > dž;
d ʒ > dž;
t ͡ ɕ > č;
t ɕ > č;
d ͡ ʑ > dž;
d ʑ > dž;
t ͡ ʂ > č;
t ʂ > č;
d ͡ ʐ > dž;
d ʐ > dž;

[k q] ʲ > ķ;
[g ɡ ɢ] ʲ > ģ;
[l ɫ ɭ] ʲ > ļ;
[n ɳ ŋ] ʲ > ņ;

[a ɑ ɐ ɒ â ă ʌ] ː > ā;
[e ɛ æ ə ɘ ɜ ɚ ɝ œ ø ê ę ẽ] ː > ē;
[i ɪ ɨ y ʏ ĩ] ː > ī;
[o ɔ ɤ ɯ ɵ ô õ ơ] ː > o;
[u ʊ ʉ ũ ư] ː > ū;

[ɑ ɐ ɒ â ă ʌ] > a;
[ɛ æ ə ɘ ɜ ɚ ɝ œ ø ê ę ẽ] > e;
[ɪ ɨ y ʏ ĩ] > i;
[ɔ ɤ ɵ ô õ ơ ɯ] > o;
[ʊ ʉ ũ ư] > u;

c > ķ;
[ɟ ď] > ģ;
ť > ķ;

q > k;
[ɡ ɢ ɣ ɰ] > g;
[w β ʋ] > v;
θ > t;
[ð ɖ ɗ] > d;
[ɕ ʂ ʃ] > š;
[ʑ ʐ ʒ] > ž;
[x χ ɦ ɧ ħ ʕ ç] > h;
[ʁ ɾ ʀ ɹ ɽ] > r;
ɱ > m;
ɲ > ņ;
[ɳ ŋ] > n;
[ɫ ɭ] > l;
ʎ > ļ;
[ɥ ʝ] > j;
ɓ > b;
ʈ > t;
ɸ > f;

[͈̚ ʔ '’ˈ ˌ ˥ ˧ ˩ ̝ ̟ ̥ ̩ ̪ ̯ ̃ ̊ ʼ ̇ ̧ ˠ ˤ ʰ ʱ ʷ ʲ ː ͡] > ;

::Null;

[ķģļņšžč] { j > ;
dž { j > ;
j { ie > e;
b { b > ;
c { c > ;
d { d > ;
f { f > ;
g { g > ;
h { h > ;
j { j > ;
k { k > ;
p { p > ;
s { s > ;
t { t > ;
v { v > ;
z { z > ;
š { š > ;
ž { ž > ;
č { č > ;
ķ { ķ > ;
ģ { ģ > ;
ļ { ļ > ;
ņ { ņ > ;
dz { dz > ;
dž { dž > ;

[:^Letter:] l { l > ;
[:^Letter:] m { m > ;
[:^Letter:] n { n > ;
[:^Letter:] r { r > ;
l { l } [:^Letter:] > ;
m { m } [:^Letter:] > ;
n { n } [:^Letter:] > ;
r { r } [:^Letter:] > ;
`;
