export const ipaCsRules = `
::Null;

[aɐɑɒăâæʌ] ː > á;
[eɛɜɝəɘɚêęẽ] ː > é;
[iɪɨĩ] ː > í;
[oɔœɵôõøơɤ] ː > ó;
[:^Letter:] { [uʊʉɯũư] ː } > ú;
[uʊʉɯũư] ː > ů;
[yʏ] ː > ý;

[ɐɑɒăâæʌ] > a;
[ɛɜɝəɘɚêęẽ] > e;
[ɪɨĩ] > i;
[ɔœɵôõøơɤ] > o;
[ʊʉɯũư] > u;
ʏ > y;

dʲ > ď;
tʲ > ť;
nʲ > ň;
t [ʃɕʂ] > č;
d [ʒʑʐ] > dž;
ts > c;
dz > dz;

[ɓ β] > b;
c > ť;
[çɕʃʂ] > š;
[ɖɗð] > d;
ɟ > ď;
[ɡɢɣɰ] > g;
[ɥɦɧħ] > h;
ʝ > j;
[ɫɭʎ] > l;
ɱ > m;
[ŋɳ] > n;
ɲ > ň;
q > k;
[ɹɽɾʀʁ] > r;
[ʈθ] > t;
[ʋw] > v;
[χx] > ch;
[ʐʑʒ] > ž;
ɸ > f;

[͈̚ːʰʱʲʷʼˈ̇ˌ̧ˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʔʕ] > ;

::Null;

[:^Letter:] uu > ú;
uu > ů;

[:^Letter:] { ů > ú;
[:^Letter:] { ě > je;

[cjřščžťďň] { y > i;
[cjřščžťďň] { ý > í;

[cjřščžhkrgxlqwsz] { ě > e;

[ďťň] { e > ě;

::Null;

ď } [iíě] > d;
ť } [iíě] > t;
ň } [iíě] > n;
`;
