export const ipaNoRules = `
::Null;

[͈̚ʔʕʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[ʈt] [ʂɕ] > tsj;
[:^Letter:] { ʂ > sj;
[:^Letter:] { ʈ > t;
[:^Letter:] { ɖ > d;
[:^Letter:] { ɳ > n;
[:^Letter:] { ɭ > l;

[âăɐɑɒʌ] > a;
ɓ > b;
[ðďɗ] > d;
[êęɘəɛɜẽ] > e;
[ɚɝ] > er;
[ɡɢɣɰ] > g;
[ħɦ] > h;
[ĩɨɪ] > i;
[ɟʝ] > j;
[cqxχ] > k;
[çɕ] > kj;
[ɫ] > l;
[ʎ] > lj;
[ɱ] > m;
[ŋ] > ng;
[ɲ] > nj;
[ôõơɵɤ] > o;
[ɖ] > rd;
[ɭ] > rl;
[ɳ] > rn;
[ʂ] > rs;
[ʈ] > rt;
[ɹɽɾʀʁ] > r;
[z] > s;
[žɧʃʐʑʒ] > sj;
[ťθ] > t;
[č] > tsj;
[ũưʉʊɯ] > u;
[wɥʋβ] > v;
[ʏ] > y;
[ɔ] > å;
[œ] > ø;
ɸ > f;
`;
