export const ipaBgRules = `
::Null;

[͈̚ʔʕʰʱʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

[jʝɥʲ] [aɑɐăâæ] > я;
[jʝɥʲ] [uʊũʉɯư] > ю;
[:^Letter:] { [jʝɥʲ] [oɔôõɵɒ] > йо;
[jʝɥʲ] [oɔôõɵɒ] > ьо;
[:^Letter:] { [jʝɥʲ] [eɛęẽêœø] > йе;
[jʝɥʲ] [eɛęẽêœø] > е;
[:^Letter:] { [jʝɥʲ] [iɪĩɨyʏ] > йи;
[jʝɥʲ] [iɪĩɨyʏ] > и;
[jʝɥʲ] [əɘʌɤơɜ] > йъ;
[jʝɥʲ] [ɚɝ] > йър;
[jʝɥʲ] > й;
[ɚɝ] > ър;

[tʈť] [sɕʂ] > ц;
[dɖɗď] z > дз;
[tʈť] ʃ > ч;
[dɖɗď] [ʒʐʑž] > дж;
ʃ [tʈťθ] > щ;

[aɑɐăâæ] > а;
[eɛęẽêœø] > е;
[iɪĩɨyʏ] > и;
[oɔôõɵɒ] > о;
[uʊũʉɯư] > у;
[əɘʌɤơɜ] > ъ;

[bɓβ] > б;
[vʋw] > в;
[gɡɢɣɰɟ] > г;
[dɖɗďð] > д;
[ʒʐʑž] > ж;
z > з;
[ckq] > к;
[lɫɭʎ] > л;
[mɱ] > м;
[nɲɳŋ] > н;
p > п;
[rɾɹɽʀ] > р;
[sɕʂ] > с;
[tʈťθ] > т;
[fɸ] > ф;
[hxχħɦɧʁç] > х;
ʃ > ш;
č > ч;

::Null;

а { а > ;
б { б > ;
в { в > ;
г { г > ;
д { д > ;
е { е > ;
ж { ж > ;
з { з > ;
и { и > ;
й { й > ;
к { к > ;
л { л > ;
м { м > ;
н { н > ;
о { о > ;
п { п > ;
р { р > ;
с { с > ;
т { т > ;
у { у > ;
ф { ф > ;
х { х > ;
ц { ц > ;
ч { ч > ;
ш { ш > ;
щ { щ > ;
ъ { ъ > ;
ь { ь > ;
ю { ю > ;
я { я > ;

::Null;

й } и > ;
[:^Letter:] { й } [бвгджзйклмнрстфхцчшщ] > и;
[бвгджзйклмнрстфхцчшщ] { й } [бвгджзйклмнрстфхцчшщ] > и;

ь } [аеиу] > й;
ь } [яюъ] > ;
[ъь] } [:^Letter:] > ;

::Null;

йа > я;
йу > ю;
шт > щ;
`;
