export const ipaSrRules = `
::Null;

t͡s > c;
ts > c;
t͡ʃ > č;
tʃ > č;
t͡ɕ > ć;
tɕ > ć;
d͡ʒ > dž;
dʒ > dž;
d͡ʑ > đ;
dʑ > đ;

nʲ > nj;
lʲ > lj;
tʲ > ć;
dʲ > đ;
kʲ > ć;
gʲ > đ;

ɲ > nj;
ʎ > lj;

ɓ > b;
[θ ť ʈ] > t;
ď > đ;
[ð ɖ ɗ] > d;
ɟ > đ;
[ɡ ɢ ɣ] > g;
[ç ħ ɦ ɧ χ x] > h;
[ŋ ɳ] > n;
ɱ > m;
[ɹ ɽ ɾ ʀ ʁ] > r;
[ɫ ɭ] > l;
[ʂ ʃ ɕ] > š;
[ʐ ʑ ʒ] > ž;
[ʝ ɥ] > j;
[β ʋ w] > v;
q > k;

[ɐ ɑ ɒ æ â ă ʌ] > a;
[ɛ ɜ ɝ ɘ ə ɚ ê ę ẽ œ] > e;
[ɨ ɪ ĩ ʏ y] > i;
[ɔ ɵ ô õ ø ơ ɤ] > o;
[ʊ ʉ ũ ư ɯ] > u;

[ʰ ʱ ʲ ʷ ʼ ˈ ̇ ˌ ̧ ː ˠ ˤ ˥ ˧ ˩ ̝ ̟ ̥ ̩ ̪ ̯ ̃ ̊ ͡ ʔ ʕ] > ;
`;
