export const ipaMkRules = `
::Null;

[ʔʰʱʲʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

dʒ > џ;
tʃ > ч;
dz > ѕ;
ts > ц;

[aɑɐɒâă] > а;
[eɛæêęəɘɜœẽ] > е;
[ɚɝ] > ер;
[iɪĩɨyʏ] > и;
[oɔôõøơɵɤʌ] > о;
[uʊʉũưɯ] > у;

[bɓ] > б;
[vʋβw] > в;
[gɡɢɣ] > г;
[dɖɗð] > д;
[ɟʝď] > ѓ;
[ʒʐʑž] > ж;
z > з;
[jɥ] > ј;
[kq] > к;
[lɫɭ] > л;
ʎ > љ;
[mɱ] > м;
[nɳ] > н;
[ɲŋ] > њ;
p > п;
[rɹɽɾʀʁ] > р;
s > с;
[tʈθ] > т;
[cť] > ќ;
f > ф;
[xχhħɦɧʕç] > х;
č > ч;
[ʃʂɕ] > ш;

::Null;

аа > а;
бб > б;
вв > в;
гг > г;
дд > д;
ѓѓ > ѓ;
ее > е;
жж > ж;
зз > з;
ѕѕ > ѕ;
ии > и;
јј > ј;
кк > к;
лл > л;
љљ > љ;
мм > м;
нн > н;
њњ > њ;
оо > о;
пп > п;
рр > р;
сс > с;
тт > т;
ќќ > ќ;
уу > у;
фф > ф;
хх > х;
цц > ц;
чч > ч;
џџ > џ;
шш > ш;

::Null;

дз > ѕ;
дж > џ;
лј > љ;
нј > њ;
`;
