export const ipaTrRules = `
::Null;

[͈̚ʔʕʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[:^Letter:] { [ɣɰ] > g;
[bɓ] } [:^Letter:] > p;
[dɖɗďð] } [:^Letter:] > t;
[gɡɢɟ] } [:^Letter:] > k;
[dɖ] [ʒʐʑž] } [:^Letter:] > ç;

[tʈ] [ʂʃɕč] > ç;
[dɖ] [ʒʐʑž] > c;

[ɑɐɒâăʌ] > a;
[ɚɝ] > er;
[æêęẽɛɘəɜ] > e;
[ɪĩ] > i;
[ɨɯ] > ı;
[ôõơɔɤ] > o;
[øœɵ] > ö;
[ʊũư] > u;
[ʉʏ] > ü;

[ɓ] > b;
[cq] > k;
[č] > ç;
[ɖɗďð] > d;
[ɟɡɢ] > g;
[ɣɰ] > ğ;
[ħɦɧχxç] > h;
[jʝɥy] > y;
[ɫɭʎ] > l;
[ɱ] > m;
ŋ } [cçkɡgɢq] > n;
ŋ > ng;
[ɲɳ] > n;
[θʈť] > t;
[ɹɽɾʀʁ] > r;
[ʂʃɕ] > ş;
[ʒʐʑž] > j;
[βʋw] > v;
ɸ > f;

::Null;

[:^Letter:] { ğ > g;
[bcçdfgğhjklmnprsştvyz] { ğ > g;
`;
