export const ipaHrRules = `
::Null;

t͡ʃ > č;
d͡ʒ > dž;
t͡s > c;
d͡z > c;
tʃ > č;
dʒ > dž;
tɕ > ć;
dʑ > đ;
ts > c;
dz > c;

[:^Letter:] { ʲ > ;
ʲ } [:^Letter:] > ;
ʲ > j;

[͈̚ʔʕʰʱʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[âæăɐɑʌ] > a;
[êęẽɛɜɘəœøɵ] > e;
[ĩɨɪyʏ] > i;
[ôõơɒɔɤ] > o;
[ũưʉʊɯ] > u;
[ɚɝ] > er;

[ɓβ] > b;
[cť] > ć;
[ďɖɗð] > d;
ɟ > đ;
[ɡɢɣɰ] > g;
[ħɦχxç] > h;
[ɥʝ] > j;
q > k;
[ɫɭ] > l;
ʎ > lj;
ɱ > m;
[ŋɳ] > n;
ɲ > nj;
[ɹɽɾʀʁ] > r;
[ʂʃɕɧ] > š;
[ʈθ] > t;
[ʋw] > v;
[ʐʑʒ] > ž;
ɸ > f;

::Null;

b { b > ;
c { c > ;
č { č > ;
ć { ć > ;
d { d > ;
đ { đ > ;
f { f > ;
g { g > ;
h { h > ;
j { j > ;
k { k > ;
l { l > ;
m { m > ;
n { n > ;
p { p > ;
r { r > ;
s { s > ;
š { š > ;
t { t > ;
v { v > ;
z { z > ;
ž { ž > ;
dž { dž > ;

::Null;

i { a > ja;
i { e > je;
i { u > ju;

::Null;

i { j } o > ;

::Null;

[čćđšž] { j > ;
dž { j > ;
`;
