export const ipaIdRules = `
::Null;

[̚'’͈ˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

ŋ > ng;
ɲ > ny;
ʃ > sy;
ʂ > sy;
[χx] > kh;
[:^Letter:] { [ʕʔ] > ;
[ʕʔ] } [:^Letter:] > k;
[aeiou] { [ʕʔ] } [âæăɐɑɒʌêøęœɘəɚɛɜɝẽĩɨɪʏyôõơɔɵɤũưɯʉʊaeiou] > \\';
[ʕʔqʼ] > k;
[jʲ] > y;
[çɕθ] > s;
t͡ʃ > c;
tʃ > c;
tɕ > c;
ʈʂ > c;
d͡ʒ > j;
dʒ > j;
dʑ > j;
č > c;
[ťʈ] > t;
ɓ > b;
[ɖɗďð] > d;
[ɟʒʝ] > j;
[ɡɢɣɰ] > g;
[ɥʷ] > w;
[ɦɧħʰʱ] > h;
[ɫɭʎ] > l;
ɱ > m;
ɳ > n;
[ɹɽɾʀʁ] > r;
[ʋβ] > v;
[ʐʑž] > z;
[âæăɐɑɒʌ] > a;
[êøęœɘəɚɛɜɝẽ] > e;
[ĩɨɪʏy] > i;
[ôõơɔɵɤ] > o;
[ũưɯʉʊ] > u;
ɸ > f;

::Null;

b { b > ;
c { c > ;
d { d > ;
f { f > ;
g { g > ;
h { h > ;
j { j > ;
k { k > ;
l { l > ;
m { m > ;
n { n > ;
p { p > ;
q { q > ;
r { r > ;
s { s > ;
t { t > ;
v { v > ;
w { w > ;
x { x > ;
y { y > ;
z { z > ;

sy { sy > ;
kh { kh > ;
ny { ny > ;
`;
