export const ipaHeRules = `
::Null;
::NFD;

ç } [:^Letter:] > ך;
ç > כ;

[͈̚ˈˌːˑ˥˦˧˨˩ˤʷʲʱʰˠⁿˡ̪̺̻̥̬̚ʴʵʶˢˣꜛꜜ↑↓↗↘ʼ͜͡‖|̧̩̯̟̊˞̨̛̝̂̆] > ;

::Null;

tʃ } [:^Letter:] > ץ׳;
tɕ } [:^Letter:] > ץ׳;
ʈʂ } [:^Letter:] > ץ׳;
tʃ > צ׳;
dʒ > ג׳;
ts } [:^Letter:] > ץ;
ts > צ;
dz > ז;
tɕ > צ׳;
dʑ > ג׳;
ʈʂ > צ׳;
ɖʐ > ג׳;
č } [:^Letter:] > ץ׳;
č > צ׳;
ž > ז׳;
ď > ג;
ť > ק;

[bβɓʙ] > ב;
[vʋʍwɥ] > ו;
[f] } [:^Letter:] > ף;
[fpɸƥ] > פ;
[mɱ] } [:^Letter:] > ם;
[mɱ] > מ;
[tʈt̪] > ט;
[dɖd̪dʱɗ] > ד;
[θ] > ת;
[ð] > ד;
[nɲɳɴ] } [:^Letter:] > ן;
[nɲɳɴ] > נ;
ŋ } [ɡgɢɠɟʄɣɰ] > נ;
ŋ > נג;
[sʂɕ] > ס;
[zʐʑ] > ז;
[ʃɧ] > ש;
[ʒ] > ז׳;
[rɾɹʀʁɻɽ] > ר;
[lɫʎɭʟ] > ל;
[jʝɰ] > י;
[kqc] > ק;
[ɡgɢɠɟʄɣɰ] > ג;
[hɦ] > ה;
[xχ] } [:^Letter:] > ך;
[xχ] > כ;
[ħʜ] > ח;
[ʕʢ] > ע;
[ʔʡ] > א;

̃ } [:^Letter:] > ן;
̃ > נ;

[:^Letter:] { [aɑæɒɐʌəɤɵɞ] > א;
[:^Letter:] { [eɛɘɜɝɚ] > א;
[:^Letter:] { [iɪyʏɨɯ] > אי;
[:^Letter:] { [uʊoɔœøʉ] > או;

[aɑæɒɐʌəɤɵɞ] } [aɑæɒɐʌəɤɵɞ] > א;
[aɑæɒɐʌəɤɵɞ] } [eɛɘɜɝɚ] > א;
[aɑæɒɐʌəɤɵɞ] } [iɪyʏɨɯ] > א;
[aɑæɒɐʌəɤɵɞ] } [uʊoɔœøʉ] > א;

[eɛɘɜɝɚ] } [aɑæɒɐʌəɤɵɞ] > א;
[eɛɘɜɝɚ] } [eɛɘɜɝɚ] > א;
[eɛɘɜɝɚ] } [iɪyʏɨɯ] > י;
[eɛɘɜɝɚ] } [uʊoɔœøʉ] > א;

[iɪyʏɨɯ] } [aɑæɒɐʌəɤɵɞ] > יא;
[iɪyʏɨɯ] } [eɛɘɜɝɚ] > יא;
[iɪyʏɨɯ] } [iɪyʏɨɯ] > י;
[iɪyʏɨɯ] } [uʊoɔœøʉ] > י;

[uʊoɔœøʉ] } [aɑæɒɐʌəɤɵɞ] > וא;
[uʊoɔœøʉ] } [eɛɘɜɝɚ] > וא;
[uʊoɔœøʉ] } [iɪyʏɨɯ] > וא;
[uʊoɔœøʉ] } [uʊoɔœøʉ] > ;

[aɑæɒɐʌəɤɵɞ] } [:^Letter:] > ה;
[eɛɘɜɝɚ] } [:^Letter:] > ה;
[iɪyʏɨɯ] } [:^Letter:] > י;
[uʊoɔœøʉ] } [:^Letter:] > ו;

[aɑæɒɐʌəɤɵɞ] > ;
[eɛɘɜɝɚ] > ;
[iɪyʏɨɯ] > י;
[uʊoɔœøʉ] > ו;

::Null;

יי { י > ;
וו { ו > ;

ך } [:Letter:] > כ;
ם } [:Letter:] > מ;
ן } [:Letter:] > נ;
ף } [:Letter:] > פ;
ץ } [:Letter:] > צ;
כ } [:^Letter:] > ך;
מ } [:^Letter:] > ם;
נ } [:^Letter:] > ן;
צ } [[:^Letter:]-['׳]] > ץ;
ץ } ['׳] > צ;
`;
