export const ipaTrRules = `
::Null;

[͈̚ʔʕʰʱʲʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[:^Letter:] { [ɣɰʁ] > g;
[bɓβ] } [:^Letter:] > p;
[dɖɗďð] } [:^Letter:] > t;
[gɡɢɟ] } [:^Letter:] > k;
d[ʒʐʑž] } [:^Letter:] > ç;

t[ʂʃɕč] > ç;
d[ʒʐʑž] > c;

[ɑɐɒâăʌ] > a;
[æêęẽɛɘəɚɜɝ] > e;
[ɪĩ] > i;
[ɨɯ] > ı;
[ôõơɔɤ] > o;
[øœɵ] > ö;
[ʊũư] > u;
[ʉʏy] > ü;

[ɓ] > b;
[cq] > k;
[č] > ç;
[ɖɗďð] > d;
[ɟɡɢ] > g;
[ɣɰ] > ğ;
[ħɦɧχx] > h;
[jʝɥ] > y;
[ɫɭʎ] > l;
[ɱ] > m;
[ŋɲɳ] > n;
[θʈť] > t;
[ɹɽɾʀʁ] > r;
[ʂʃɕ] > ş;
[ʒʐʑž] > j;
[βʋw] > v;
ɸ > f;

::Null;

[:^Letter:] { ğ > g;
[bcçdfgğhjklmnprsştvyz] { ğ > g;
`;
