export const ipaKaRules = `
::Null;

[:^Letter:] { ʔ > ;

t͡ʃʼ > ჭ;
t͡ʃʰ > ჩ;
t͡ʃ > ჩ;
tʃʼ > ჭ;
tʃʰ > ჩ;
tʃ > ჩ;

t͡sʼ > წ;
t͡sʰ > ც;
t͡s > ც;
tsʼ > წ;
tsʰ > ც;
ts > ც;

d͡ʒ > ჯ;
dʒ > ჯ;
d͡z > ძ;
dz > ძ;

pʼ > პ;
pʰ > ფ;
p > პ;

[tťʈ]ʼ > ტ;
[tťʈ]ʰ > თ;
[tťʈ] > ტ;

kʼ > კ;
kʰ > ქ;
k > კ;

qʼ > ყ;
qʰ > ყ;
q > ყ;

cʼ > წ;
cʰ > ც;
c > ც;

čʼ > ჭ;
čʰ > ჩ;
č > ჩ;

[aâæăɐɑɒʌ] > ა;
[eêęẽɘəɚɛɜɝ] > ე;
[iĩɨɪyʏ] > ი;
[oôõøœơɔɵɤ] > ო;
[uũưʉʊɯ] > უ;

[bɓβ] > ბ;
[dďɖɗð] > დ;
[gɡɟ] > გ;
[vʋwɥ] > ვ;
[zʑʐ] > ზ;
[ʒž] > ჟ;
[sʂ] > ს;
[ʃɕç] > შ;
[mɱ] > მ;
[nŋɲɳ] > ნ;
[lɫɭʎ] > ლ;
[rɾɹʀɽ] > რ;
[jʝ] > ი;
[fɸ] > ფ;
θ > თ;
[xχ] > ხ;
[ɣɰʁɢ] > ღ;
[hɦħɧʕʔ] > ჰ;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] >;

::Null;

ბ { ბ > ;
გ { გ > ;
დ { დ > ;
ვ { ვ > ;
ზ { ზ > ;
თ { თ > ;
კ { კ > ;
ლ { ლ > ;
მ { მ > ;
ნ { ნ > ;
პ { პ > ;
ჟ { ჟ > ;
რ { რ > ;
ს { ს > ;
ტ { ტ > ;
ფ { ფ > ;
ქ { ქ > ;
ღ { ღ > ;
ყ { ყ > ;
შ { შ > ;
ჩ { ჩ > ;
ც { ც > ;
ძ { ძ > ;
წ { წ > ;
ჭ { ჭ > ;
ხ { ხ > ;
ჯ { ჯ > ;
ჰ { ჰ > ;
ი { ი > ;
უ { ვ } [აეიოუ] > ;
ჲ > ი;
ჱ > ე;
ჳ > ვ;
ჴ > ხ;
ჵ > ო;
ჶ > ფ;
`;
