export const ipaFiRules = `
::Null;

$vowel = [aeiouyäö];

c > k;
q > k;
w > v;
x > ks;

[âăɐɑʌ] > a;
æ > ä;
ɓ > b;
[ðďɖɗ] > d;
[êęɘəɚɛɜɝẽ] > e;
[ɡɢɣ] > g;
[ħɦɧχ] > h;
[ĩɨɪ] > i;
[ɟʝʲ] > j;
[ɫɭ] > l;
ɱ > m;
ɲ > nj;
ɳ > n;
ŋ } k > n;
ŋ > ng;
[ôõơɒɔɤ] > o;
[øœɵ] > ö;
[ɹɽɾʀʁ] > r;
[çɕʂʃ] > s;
č > ts;
[ťʈθ] > t;
[ũưɯʊ] > u;
[ʋβʷ] > v;
[ɥʉʏ] > y;
[žʐʑʒ] > z;
ʎ > lj;

[:^Letter:] { ʔ } > ;
ʔ } [:^Letter:] > ;
$vowel { ʔ } $vowel > ';
ʔ > ;

([a-zäö]) { ː } > $1;
ː > ;

[ʕʰʱʼˈ̇ˌ̧ˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;
`;
