export const ipaRuRules = `
::Null;

[:^Letter:] { j [aɑɐɒâăʌ] } > я;
[aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ] { j [aɑɐɒâăʌ] } > я;
[:^Letter:] { j [eɛæœøêęəɘɜɵɤẽ] } > е;
[aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ] { j [eɛæœøêęəɘɜɵɤẽ] } > е;
[:^Letter:] { j [oɔôõơ] } > ё;
[aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ] { j [oɔôõơ] } > ё;
[:^Letter:] { j [uʊʉũưyʏ] } > ю;
[aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ] { j [uʊʉũưyʏ] } > ю;

[͈̚ ʰ ʱ ʷ ʼ ˈ ̇ ˌ ̧ ː ˠ ˤ ˥ ˧ ˩ ̝ ̟ ̥ ̩ ̪ ̯ ̃ ̊ ͡] > ;

ʲ > ь;
ɚ > эр;
ɝ > эр;
ʎ > ль;
ɲ > нь;
[cčç] > ч;
[s] > с;
[z] > з;
[ʃʂ] > ш;
[ɕ] > щ;
[ʒɧʑʐž] > ж;
[mɱ] > м;
[nɳŋ] > н;
[lɫɭ] > л;
[rɹɽɾʀʁ] > р;
[bɓ] > б;
[p] > п;
[dɖɗďð] > д;
[tʈťθ] > т;
[gɡɢɣɰ] > г;
[kq] > к;
[vʋwβ] > в;
[fɸ] > ф;
[hɦħχx] > х;
[ʔʕ] > ъ;
[jʝɟɥ] > й;
[aɑɐɒâăʌ] > а;
[eɛæœøêęəɘɜɵɤẽ] > э;
[iɪĩ] > и;
[ɨɯ] > ы;
[oɔôõơ] > о;
[uʊʉũư] > у;
[yʏ] > ю;

::Null;

[жшчщ] { ы > и;
й { й > ;

::Null;

йи > и;
[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщ] { й } [бвгджзйклмнпрстфхцчшщ] > и;

[бвгджзйклмнпрстфхцчшщ] { ъ } [бвгджзйклмнпрстфхцчшщ] > ;
[:^Letter:] { [ъь] > ;
ъ } [:^Letter:] > ;
[ьъй] { [ьъ] > ;
`;
