export const ipaHyRules = `
::Null;

[͈̚ʔʱ'’ʼˈ̇ˌːˤ˥˧˩̧̝̟̥̩̪̯̃̊͡] > ;

::Null;

[:^Letter:] { [eêęẽœøɛ] > է;
[eêęẽœøɛ] > ե;
[:^Letter:] { [oôõơɒɔɵ] > օ;
[oôõơɒɔɵ] > ո;
[aâæăɐɑʌ] > ա;
[աէեօոը] { [iĩɨɪyʏ] > յ;
[iĩɨɪyʏ] > ի;
[uũưɯʉʊ] > ու;
[ɚɝ] > ըր;
[əɘɜɤ] > ը;

[tťʈ] s ʰ > ց;
[tťʈ] [ʃɧʂɕ] ʰ > չ;
[tťʈ] s > ծ;
[tťʈ] [ʃɧʂɕ] > ճ;
[dďðɖɗ] z > ձ;
[dďðɖɗ] [ʒžʐʑ] > ջ;

čʰ > չ;
č > ճ;

[pɓ]ʰ > փ;
[tťʈ]ʰ > թ;
[kc]ʰ > ք;
qʰ > ք;

[pɓ] > պ;
b > բ;
[tťʈ] > տ;
[dďðɖɗ] > դ;
[kc] > կ;
[gɡɢɟ] > գ;
q > ք;

[fɸ] > ֆ;
[vʋwβ] > վ;
[hɦħ] > հ;
[xχç] > խ;
[ɣɰʁʕ] > ղ;
θ > թ;

s > ս;
z > զ;
[ʃɧʂɕ] > շ;
[ʒžʐʑ] > ժ;

[mɱ] > մ;
[nŋɲɳ] > ն;
[lɫɭʎ] > լ;
[rʀ] > ռ;
[ɾɽɹ] > ր;
[jɥʝ] > յ;

ʲ > յ;
ʷ > վ;
ˠ > ղ;
ʰ > հ;

::Null;

[:^Letter:] { ր > ռ;
[:^Letter:] { յի > ի;
[:^Letter:] { յե > ե;
յէ > յե;
յօ > յո;
եօ > եո;
րր > ռռ;
յյ > յ;
[:^Letter:] { ւ > վ;
[^ոՈ] { ւ > վ;
`;
