export const ipaSrRules = `
::Null;

t͡s > c;
ts > c;
t͡ʃ > č;
tʃ > č;
t͡ɕ > ć;
tɕ > ć;
d͡ʒ > dž;
dʒ > dž;
d͡ʑ > đ;
dʑ > đ;

nʲ > nj;
lʲ > lj;
tʲ > ć;
dʲ > đ;
kʲ > ć;
gʲ > đ;

ɲ > nj;
ʎ > lj;

ɓ > b;
[θ ť ʈ] > t;
ď > đ;
[ð ɖ ɗ] > d;
ɟ > đ;
[ɡ ɢ ɣ ɰ] > g;
[ç ħ ɦ ɧ χ x] > h;
[ŋ ɳ] > n;
ɱ > m;
[ɹ ɽ ɾ ʀ ʁ] > r;
[ɫ ɭ] > l;
[ʂ ʃ ɕ] > š;
[ʐ ʑ ʒ] > ž;
[ʝ ɥ] > j;
[β ʋ w] > v;
q > k;
ɸ > f;

[ɐ ɑ ɒ æ â ă ʌ] > a;
[ɛ ɜ ɝ ɘ ə ɚ ê ę ẽ œ] > e;
[ɨ ɪ ĩ ʏ y] > i;
[ɔ ɵ ô õ ø ơ ɤ] > o;
[ʊ ʉ ũ ư ɯ] > u;

[͈̚ ʰ ʱ ʲ ʷ ʼ ˈ ̇ ˌ ̧ ː ˠ ˤ ˥ ˧ ˩ ̝ ̟ ̥ ̩ ̪ ̯ ̃ ̊ ͡ ʔ ʕ] > ;

::Null;

i { a > ja;
i { e > je;
i { u > ju;

::Null;

i { j } o > ;

::Null;

dž { dž > ;
lj { lj > ;
nj { nj > ;

::Null;

b { b > ;
c { c > ;
č { č > ;
ć { ć > ;
d { d > ;
đ { đ > ;
f { f > ;
g { g > ;
h { h > ;
j { j > ;
k { k > ;
l { l > ;
m { m > ;
n { n > ;
p { p > ;
r { r > ;
s { s > ;
š { š > ;
t { t > ;
v { v > ;
z { z > ;
ž { ž > ;
`;
