export const ipaSkRules = `
::Null;

t͡s > c;
ts > c;
t͡ʃ > č;
tʃ > č;
d͡z > dz;
dz > dz;
d͡ʒ > dž;
dʒ > dž;
t͡ɕ > č;
tɕ > č;
d͡ʑ > dž;
dʑ > dž;
t͡ʂ > č;
tʂ > č;
d͡ʐ > dž;
dʐ > dž;

[aɑɐɒăâ] ː > á;
[eɛɜɘəɚɝêęẽ] ː > é;
[iɪɨĩyʏ] ː > í;
[oɔœøɵơõɤʌ] ː > ó;
[uʊʉɯưũ] ː > ú;
[lɫɭ] ː > ĺ;
[rɾɹɽʀʁ] ː > ŕ;

[͈̚ːʰʱʲʷʼˈ̇ˌ̧ˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʔ] > ;

::Null;

[aɑɐɒăâ] > a;
æ > ä;
[eɛɜɘəɚɝêęẽ] > e;
[iɪɨĩyʏ] > i;
[oɔœøɵơõɤʌ] > o;
[uʊʉɯưũ] > u;

ɓ > b;
[çχħɧx] > ch;
[ɖɗð] > d;
ɟ > ď;
[ɡɢɣɰ] > g;
[ɦʕ] > h;
[ɥʝ] > j;
ɱ > m;
[ŋɳ] > n;
ɲ > ň;
[lɫɭ] > l;
ʎ > ľ;
[rɾɹɽʀʁ] > r;
[ʂʃɕ] > š;
ʈ > t;
[ʋβw] > v;
[ʐʑʒ] > ž;
θ > s;
ɸ > f;

::Null;

[ďťňľ] { y > i;
[ďťňľ] { ý > í;

::Null;

ď } [iíeé] > d;
ť } [iíeé] > t;
ň } [iíeé] > n;
ľ } [iíeé] > l;
`;
