export const ipaRuRules = `
::Null;

$vowel = [aɑɐɒâăʌeɛæœøêęəɘɜɵɤẽoɔôõơuʊʉũưiɪĩɨɯyʏ];

[:^Letter:] { j [aɑɐɒâăʌ] } > я;
$vowel { j [aɑɐɒâăʌ] } > я;
[:^Letter:] { j [eɛæœøêęəɘɜɵɤẽ] } > е;
$vowel { j [eɛæœøêęəɘɜɵɤẽ] } > е;
[:^Letter:] { j [oɔôõơ] } > ё;
$vowel { j [oɔôõơ] } > ё;
[:^Letter:] { j [uʊʉũưyʏ] } > ю;
$vowel { j [uʊʉũưyʏ] } > ю;

[ʰ ʱ ʷ ʼ ˈ ̇ ˌ ̧ ː ˠ ˤ ˥ ˧ ˩ ̝ ̟ ̥ ̩ ̪ ̯ ̃ ̊ ͡] > ;

ʲ > ь;
ɚ > эр;
ɝ > эр;
ʎ > ль;
ɲ > нь;
[cčç] > ч;
[s] > с;
[z] > з;
[ʃʂ] > ш;
[ɕ] > щ;
[ʒɧʑʐž] > ж;
[mɱ] > м;
[nɳŋ] > н;
[lɫɭ] > л;
[rɹɽɾʀʁ] > р;
[bɓ] > б;
[p] > п;
[dɖɗďð] > д;
[tʈťθ] > т;
[gɡɢɣ] > г;
[kq] > к;
[vʋwβ] > в;
[f] > ф;
[hɦħχx] > х;
[ʔʕ] > ъ;
[jʝɟɥ] > й;
[aɑɐɒâăʌ] > а;
[eɛæœøêęəɘɜɵɤẽ] > э;
[iɪĩ] > и;
[ɨɯ] > ы;
[oɔôõơ] > о;
[uʊʉũư] > у;
[yʏ] > ю;

::Null;

йе > е;
йо > ё;
йу > ю;
йа > я;
`;
