export const ipaPlRules = `
::Null;

[͈̚ʔʕ'’ˈˌː˥˧˩ʰʱʷʼ̧̇ˠˤ̝̟̥̩̪̯̊͡] > ;

::Null;

o ̃ > ą;
e ̃ > ę;
a ̃ > ą;
ɔ ̃ > ą;
ɛ ̃ > ę;
[̃] > ;

::Null;

[:^Letter:] { [ɪɨʏɵ] > i;

t [ɕç] } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > ci;
d [ʑʝ] } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > dzi;
t s ʲ } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > ci;
d z ʲ } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > dzi;
s ʲ } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > si;
z ʲ } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > zi;
n ʲ } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > ni;
[ɕç] } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > si;
[ʑʝ] } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > zi;
ɲ } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > ni;
ɟ } [aąeęioóuyâæêôõøăĩœũơưɐɑɒɔɘəɚɛɜɝɤɨɪɯɵʉʊʌʏẽ] > dzi;

t [ɕç] > ć;
d [ʑʝ] > dź;
t s ʲ > ć;
d z ʲ > dź;
s ʲ > ś;
z ʲ > ź;
n ʲ > ń;
[ɕç] > ś;
[ʑʝ] > ź;
ɲ > ń;
ɟ > dź;

t [ʃʂ] > cz;
d [ʒʐ] > dż;
t s > c;
d z > dz;

õ > ą;
ẽ > ę;

[æăâɐɑɒʌ] > a;
[êɘəɚɛɜɝœ] > e;
[ɪɨ] > y;
[ôøơɔɤ] > o;
[ũʉʊɯư] > u;
[ʏɵ] > y;
ĩ > i;

[čʈť] > t;
[ďɖɗð] > d;
[ħχx] > ch;
[ŋɳ] > n;
[ɡɢɣɰ] > g;
[ɥɦɧ] > h;
[ɫw] > ł;
[ɭʎ] > l;
ɱ > m;
[ɹɽɾʀʁ] > r;
[ʂʃ] > sz;
[ʋv] > w;
[ʐʒž] > ż;
[ɓβ] > b;
θ > t;
q > k;
ɸ > f;
ʲ > i;

::Null;

[ćśźńji] { y > i;

::Null;

ć } [aąeęoóu] > ci;
ć } i > c;

ś } [aąeęoóu] > si;
ś } i > s;

ź } [aąeęoóu] > zi;
ź } i > z;

ń } [aąeęoóu] > ni;
ń } i > n;
`;
