export const ipaViRules = `
::Null;

$frontVowel_vi = [ieêyɪɨĩęɛæœøʏɵʉ];

[͈̚ʔʕˈˌːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʼ̧̇] > ;

::Null;

ŋ } $frontVowel_vi > ngh;
ŋ > ng;
[gɡɢɟɣɰʁ] } $frontVowel_vi > gh;
[gɡɢɟɣɰʁ] > g;
[kq] } $frontVowel_vi > k;
[kq] } [wʷuʊũ] > q;
[kq] > c;
[:^Letter:] { [jʝ] > gi;
[jʝ] > y;
[:^Letter:] { [wɥ] > v;
[wɥ] > o;
[ɑɐæ] > a;
[ɛęẽ] > e;
[ɪɨĩʲ] > i;
[ɔɒõ] > o;
[ʊũʷ] > u;
[ɯ] > ư;
[ɤʌəɘɚɜɝ] > ơ;
[yʏøœɵʉ] > uy;
[ɓ] > b;
[cčç] > ch;
[dɖďɗð] > đ;
[fɸ] > ph;
[ɦɧħʰʱ] > h;
[ɫɭʎ] > l;
[ɱ] > m;
[ɳ] > n;
[ɲ] > nh;
[ɹɽɾʀʐ] > r;
[sɕʃθ] > x;
[ʂ] > s;
[ťʈ] > t;
[ʋβ] > v;
[xχ] > kh;
[zʑʒž] > d;

::Null;

c } [iìỉĩíịeèẻẽéẹêềểễếệyỳỷỹýỵ] > k;
n { g } [iìỉĩíịeèẻẽéẹêềểễếệyỳỷỹýỵ] > gh;
g } [eèẻẽéẹêềểễếệyỳỷỹýỵ] > gh;
g { h } [aàảãáạăằẳẵắặâầẩẫấậoòỏõóọôồổỗốộơờởỡớợuùủũúụưừửữứự] > ;
`;
