export const ipaAzRules = `
::Null;

[͈̚ʰʱʲʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[:^Letter:] { ʔ } > ;
{ ʔ } [:^Letter:] > ;
ʔ > '';

c > k;
ɟ > g;
[gɡɢ] > q;
[jɥʝ] > y;
[wʋβ] > v;
[yʉʏ] > ü;
[âăɐɑɒʌ] > a;
[æɘɚɜɝ] > ə;
[êęɛẽ] > e;
[ĩɪ] > i;
[ɨɯɤ] > ı;
[ôõơɔ] > o;
[øœɵ] > ö;
[ũưʊ] > u;
ɓ > b;
č > ç;
[ďɖɗ] > d;
ð > z;
[ɣɰʁ] > ğ;
[ħɦɧʕ] > h;
[ɫɭʎ] > l;
ɱ > m;
[ŋɲɳ] > n;
[ɹɽɾʀ] > r;
θ > s;
[ɕʂʃ] > ş;
[ťʈ] > t;
χ > x;
[žʐʑʒ] > j;
ɸ > f;

::Null;

[:^Letter:] { ı > i;
[:^Letter:] { ğ > q;
[aıou] { q } [aıou] > ğ;
[eəiöü] { k } [eəiöü] > y;
`;
