export const ipaCaRules = `
::Null;

[ʰʱʲʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

::Null;

[âæăɐɑɒ] > a;
[êęẽɛɜɝɘəɚ] > e;
[ĩɨɪ] > i;
[ôõøœơɔɵɤʌ] > o;
[ũưʉʊɯʏɥy] > u;

t [ʃʂɕχ] } [:^Letter:] > ig;
t [ʃʂɕχ] > tx;
č } [:^Letter:] > ig;
č > tx;

d [ʒžʐʑ] } [ei] > tg;
d [ʒžʐʑ] > tj;

[aeiou] { [ʃʂɕχx] > ix;
[ʃʂɕχ] > x;

[ʒžʐʑʝ] } [ei] > g;
[ʒžʐʑʝ] > j;

k } [ei] > qu;
k > c;

[ɡɟɢɣ] } [ei] > gu;
[ɡɟɢɣ] > g;
g } [ei] > gu;

[ɲɳ] > ny;
ʎ > ll;
[ɫɭ] > l;
ŋ > ng;
ɱ > m;

[ɓβ] > b;
[ðɖɗď] > d;
[ʈť] > t;
[ɹɽɾʀʁ] > r;
ʋ > v;
θ > z;
[ħɦɧʔʕ] > h;

j > i;
w > u;
`;
