export const ipaBgRules = `
::Null;

$a = [aɑɐăâæ];
$e = [eɛęẽêœø];
$i = [iɪĩɨyʏ];
$o = [oɔôõɵɒ];
$u = [uʊũʉɯư];
$schwa = [əɘʌɤơɜ];
$rhotic_schwa = [ɚɝ];
$palatal = [jʝɥʲ];

[͈̚ʔʕʰʱʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡] > ;

$palatal $a > я;
$palatal $u > ю;
[:^Letter:] { $palatal $o > йо;
$palatal $o > ьо;
[:^Letter:] { $palatal $e > йе;
$palatal $e > е;
[:^Letter:] { $palatal $i > йи;
$palatal $i > и;
$palatal $schwa > йъ;
$palatal $rhotic_schwa > йър;
$palatal > й;
$rhotic_schwa > ър;

[tʈť][sɕʂ] > ц;
[dɖɗď][z] > дз;
[tʈť][ʃ] > ч;
[dɖɗď][ʒʐʑž] > дж;
[ʃ][tʈťθ] > щ;

$a > а;
$e > е;
$i > и;
$o > о;
$u > у;
$schwa > ъ;

[bɓβ] > б;
[vʋw] > в;
[gɡɢɣɰɟ] > г;
[dɖɗďð] > д;
[ʒʐʑž] > ж;
[z] > з;
[ckq] > к;
[lɫɭʎ] > л;
[mɱ] > м;
[nɲɳŋ] > н;
[p] > п;
[rɾɹɽʀ] > р;
[sɕʂ] > с;
[tʈťθ] > т;
[fɸ] > ф;
[hxχħɦɧʁç] > х;
[ʃ] > ш;
[č] > ч;

::Null;

а { а > ;
б { б > ;
в { в > ;
г { г > ;
д { д > ;
е { е > ;
ж { ж > ;
з { з > ;
и { и > ;
й { й > ;
к { к > ;
л { л > ;
м { м > ;
н { н > ;
о { о > ;
п { п > ;
р { р > ;
с { с > ;
т { т > ;
у { у > ;
ф { ф > ;
х { х > ;
ц { ц > ;
ч { ч > ;
ш { ш > ;
щ { щ > ;
ъ { ъ > ;
ь { ь > ;
ю { ю > ;
я { я > ;

::Null;

й } и > ;
[:^Letter:] { й } [бвгджзйклмнрстфхцчшщ] > и;
[бвгджзйклмнрстфхцчшщ] { й } [бвгджзйклмнрстфхцчшщ] > и;

ь } [аеиу] > й;
ь } [яюъ] > ;
[ъь] } [:^Letter:] > ;

::Null;

йа > я;
йу > ю;
шт > щ;
`;
