export const jaUkRules = `
ファ > fa;
ふぁ > fa;
フィ > fi;
ふぃ > fi;
フェ > fe;
ふぇ > fe;
フォ > fo;
ふぉ > fo;
ヴァ > va;
ゔぁ > va;
ヴィ > vi;
ゔぃ > vi;
ヴェ > ve;
ゔぇ > ve;
ヴォ > vo;
ゔぉ > vo;
ティ > ti;
てぃ > ti;
ディ > di;
でぃ > di;
ジェ > je;
じぇ > je;
チェ > che;
ちぇ > che;
シェ > she;
しぇ > she;
ウィ > wi;
うぃ > wi;
ウェ > we;
うぇ > we;
ウォ > wo;
うぉ > wo;
デュ > dyu;
[ヴゔ] > vu;
[ぁァ] > a;
[ぃィ] > i;
[ぅゥ] > u;
[ぇェ] > e;
[ぉォ] > o;
ャ > ya;
ュ > yu;
ョ > yo;

::Null;

tōkyōto > токіо;
kyōtofu > кіото;

[aāâɑɐæ] [iīî] } [:^Letter:] > ай;
[aāâɑɐæ] [iīî] } [bcdfghjklmnpqrstvwxyz] > ай;
[eēê] [iīî] } [:^Letter:] > ей;
[eēê] [iīî] } [bcdfghjklmnpqrstvwxyz] > ей;
[oōô] [iīî] } [:^Letter:] > ой;
[oōô] [iīî] } [bcdfghjklmnpqrstvwxyz] > ой;
[uūû] [iīî] } [:^Letter:] > уй;
[uūû] [iīî] } [bcdfghjklmnpqrstvwxyz] > уй;

ssh [aāâɑɐæ] > шша;
ssh [iīî] > шші;
ssh [uūû] > шшу;
ssh [eēê] > шше;
ssh [oōô] > шшо;

cch [aāâɑɐæ] > чча;
cch [iīî] > ччі;
cch [uūû] > ччу;
cch [eēê] > чче;
cch [oōô] > ччо;

tch [aāâɑɐæ] > чча;
tch [iīî] > ччі;
tch [uūû] > ччу;
tch [eēê] > чче;
tch [oōô] > ччо;

tts [aāâɑɐæ] > цца;
tts [iīî] > цці;
tts [uūû] > ццу;
tts [eēê] > цце;
tts [oōô] > ццо;

sh [aāâɑɐæ] > ша;
sh [iīî] > ші;
sh [uūû] > шу;
sh [eēê] > ше;
sh [oōô] > шо;

ch [aāâɑɐæ] > ча;
ch [iīî] > чі;
ch [uūû] > чу;
ch [eēê] > че;
ch [oōô] > чо;

ts [aāâɑɐæ] > ца;
ts [iīî] > ці;
ts [uūû] > цу;
ts [eēê] > це;
ts [oōô] > цо;

dz [aāâɑɐæ] > дза;
dz [iīî] > дзі;
dz [uūû] > дзу;
dz [eēê] > дзе;
dz [oōô] > дзо;

jj [aāâɑɐæ] > джджа;
jj [iīî] > джджі;
jj [uūû] > джджу;
jj [eēê] > дждже;
jj [oōô] > джджо;

j [aāâɑɐæ] > джа;
j [iīî] > джі;
j [uūû] > джу;
j [eēê] > дже;
j [oōô] > джо;

n ['’‘\`´ʼ] y [aāâɑɐæ] > н\\'я;
n ['’‘\`´ʼ] y [uūû] > н\\'ю;
n ['’‘\`´ʼ] y [oōô] > н\\'йо;
n ['’‘\`´ʼ] y [eēê] > н\\'є;
n ['’‘\`´ʼ] y [iīî] > н\\'ї;
n ['’‘\`´ʼ] [aāâɑɐæ] > н\\'а;
n ['’‘\`´ʼ] [iīî] > н\\'і;
n ['’‘\`´ʼ] [uūû] > н\\'у;
n ['’‘\`´ʼ] [eēê] > н\\'е;
n ['’‘\`´ʼ] [oōô] > н\\'о;
n ['’‘\`´ʼ] > н\\';

[бвгґджзклмнпрстфхцчшщ] } y [oōô] > ьо;
y [aāâɑɐæ] > я;
y [uūû] > ю;
y [oōô] > йо;
y [eēê] > є;
y [iīî] > ї;

b > б;
c > к;
d > д;
f > ф;
g > ґ;
h > х;
j > дж;
k > к;
l > л;
m > м;
n > н;
p > п;
q > к;
r > р;
s > с;
t > т;
v > в;
w > в;
x > кс;
y > й;
z > дз;

[aāâɑɐæ] > а;
[iīî] > і;
[uūû] > у;
[eēê] > е;
[oōô] > о;

::Null;

шч > щ;
й { й > ;

[бпвмфгґкхр] { йа > \\'я;
[бпвмфгґкхр] { йе > \\'є;
[бпвмфгґкхр] { йі > \\'ї;
[бпвмфгґкхр] { йу > \\'ю;

йа > я;
йе > є;
йі > ї;
йу > ю;

::Null;

[:^Letter:] { й } [бвгґджзклмнпрстфхцчшщ] > і;
[бвгґджзклмнпрстфхцчшщ] { й } [бвгґджзклмнпрстфхцчшщ] > і;

::Null;

[жчшщ] { я > а;
[жчшщ] { ю > у;
[жчшщ] { є > е;

[бпвмфгґкхр] { ь } [яюєї] > \\';
[бпвмфгґкхр] { Ь } [яюєї] > \\';

[аеєиіїоуюя] { ь > ;
[:^Letter:] { ь > ;
[жчшщ] { ь > ;
ь } ь > ;

[:^Letter:] { ['’‘\`´ʼ] > ;
[аеєиіїоуюя] { ['’‘\`´ʼ] > ;
['’‘\`´ʼ] { ь > ;
ь } ['’‘\`´ʼ] > ;
['’‘\`´ʼ] { ['’‘\`´ʼ] > ;

::Title;
`;
