export const latnRuRules = `
::Null;

DŽ > ДЖ;
Dž > Дж;
dž > дж;

DZ > ДЗ;
Dz > Дз;
dz > дз;

TS > Ц;
Ts > Ц;
ts > ц;

TH > Т;
Th > Т;
th > т;

GH > Г;
Gh > Г;
gh > г;

NG > НГ;
Ng > Нг;
ng > нг;

KH > Х;
Kh > Х;
kh > х;

IJ > ЭЙ;
Ij > Эй;
ij > эй;

[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YA > ЬЯ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Ya > Ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { ya > ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YÄ > ЬЯ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yä > Ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yä > ья;
[БВГДЖЗКЛМНПРСФХЦЧШЩбвгджзклмнпрсфхцчшщ] { YE > ЬЕ;
[БВГДЖЗКЛМНПРСФХЦЧШЩбвгджзклмнпрсфхцчшщ] { Ye > Ье;
[БВГДЖЗКЛМНПРСФХЦЧШЩбвгджзклмнпрсфхцчшщ] { ye > ье;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YI > ЬИ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yi > Ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yi > ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YÏ > ЬИ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yï > Ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yï > ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YO > ЬЁ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yo > Ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yo > ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YÖ > ЬЁ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yö > Ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yö > ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YU > ЬЮ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yu > Ью;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yu > ью;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YÜ > ЬЮ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yü > Ью;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yü > ью;

Y [AÄ] > Я;
Y [aä] > Я;
y [aä] > я;

YE > Е;
Ye > Е;
ye > е;

YI > И;
Yi > И;
yi > и;
YÏ > ЙЫ;
Yï > Йы;
yï > йы;

Y [OÖ] > Ё;
Y [oö] > Ё;
y [oö] > ё;

Y [UÜ] > Ю;
Y [uü] > Ю;
y [uü] > ю;

[:^Letter:] { E > Э;
[:^Letter:] { e > э;
[АЭЕИЫОЁУЮЯаэеиыоёуюя] { E > Э;
[АЭЕИЫОЁУЮЯаэеиыоёуюя] { e > э;

ĽA > ЛЯ;
Ľa > Ля;
ľa > ля;
ĽÄ > ЛЯ;
Ľä > Ля;
ľä > ля;
ĽE > ЛЕ;
Ľe > Ле;
ľe > ле;
ĽI > ЛИ;
Ľi > Ли;
ľi > ли;
ĽO > ЛЁ;
Ľo > Лё;
ľo > лё;
ĽÖ > ЛЁ;
Ľö > Лё;
ľö > лё;
ĽU > ЛЮ;
Ľu > Лю;
ľu > лю;
ĽÜ > ЛЮ;
Ľü > Лю;
ľü > лю;

ŃA > НЯ;
Ńa > Ня;
ńa > ня;
ŃÄ > НЯ;
Ńä > Ня;
ńä > ня;
ŃE > НЕ;
Ńe > Не;
ńe > не;
ŃI > НИ;
Ńi > Ни;
ńi > ни;
ŃO > НЁ;
Ńo > Нё;
ńo > нё;
ŃÖ > НЁ;
Ńö > Нё;
ńö > нё;
ŃU > НЮ;
Ńu > Ню;
ńu > ню;
ŃÜ > НЮ;
Ńü > Ню;
ńü > ню;

Đ } [:LowercaseLetter:] > Дж;
Đ > ДЖ;
đ > дж;

Ľ } [:LowercaseLetter:] > Ль;
Ľ > ЛЬ;
ľ > ль;
Ń } [:LowercaseLetter:] > Нь;
Ń > НЬ;
ń > нь;

A > А;
a > а;
Ä > Э;
ä > э;
B > Б;
b > б;
Č > Ч;
č > ч;
Ć > Ч;
ć > ч;
D > Д;
d > д;
E > Е;
e > е;
F > Ф;
f > ф;
G > Г;
g > г;
H > Х;
h > х;
I > И;
i > и;
Ï > Ы;
ï > ы;
K > К;
k > к;
L > Л;
l > л;
M > М;
m > м;
N > Н;
n > н;
O > О;
o > о;
Ö > Ё;
ö > ё;
P > П;
p > п;
Q > К;
q > к;
R > Р;
r > р;
S > С;
s > с;
Š > Ш;
š > ш;
T > Т;
t > т;
U > У;
u > у;
Ü > Ю;
ü > ю;
V > В;
v > в;
W > В;
w > в;
X > Х;
x > х;
Y > Й;
y > й;
Ÿ > И;
ÿ > и;
Z > З;
z > з;
Ž > Ж;
ž > ж;
\\' > ь;
· > ъ;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[Йй] { [Йй] > ;

::Null;

йи > и;
йИ > и;
Йи > И;
ЙИ > И;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > ;
[:^Letter:] { [ъЪьЬ] > ;
[ъЪ] } [:^Letter:] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
