export const latnRuRules = `
::Null;

$boundary = [:^Letter:];

DŽ > ДЖ;
Dž > Дж;
dž > дж;

DZ > ДЗ;
Dz > Дз;
dz > дз;

TS > Ц;
Ts > Ц;
ts > ц;

YA > Я;
Ya > Я;
ya > я;

YE > Е;
Ye > Е;
ye > е;

YI > ЙИ;
Yi > Йи;
yi > йи;

YO > Ё;
Yo > Ё;
yo > ё;

YU > Ю;
Yu > Ю;
yu > ю;

ĽA > ЛЯ;
Ľa > Ля;
ľa > ля;

ĽE > ЛЕ;
Ľe > Ле;
ľe > ле;

ĽI > ЛИ;
Ľi > Ли;
ľi > ли;

ĽO > ЛЬО;
Ľo > Льо;
ľo > льо;

ĽU > ЛЮ;
Ľu > Лю;
ľu > лю;

ŃA > НЯ;
Ńa > Ня;
ńa > ня;

ŃE > НЕ;
Ńe > Не;
ńe > не;

ŃI > НИ;
Ńi > Ни;
ńi > ни;

ŃO > НЬО;
Ńo > Ньо;
ńo > ньо;

ŃU > НЮ;
Ńu > Ню;
ńu > ню;

$boundary { E > Э;
$boundary { e > э;

Đ } [:LowercaseLetter:] > Дж;
Đ > ДЖ;
đ > дж;

Ľ } [:LowercaseLetter:] > Ль;
Ľ > ЛЬ;
ľ > ль;

Ń } [:LowercaseLetter:] > Нь;
Ń > НЬ;
ń > нь;

A > А;
a > а;
B > Б;
b > б;
Č > Ч;
č > ч;
Ć > Ч;
ć > ч;
D > Д;
d > д;
E > Е;
e > е;
F > Ф;
f > ф;
G > Г;
g > г;
H > Х;
h > х;
I > И;
i > и;
K > К;
k > к;
L > Л;
l > л;
M > М;
m > м;
N > Н;
n > н;
O > О;
o > о;
P > П;
p > п;
Q > К;
q > к;
R > Р;
r > р;
S > С;
s > с;
Š > Ш;
š > ш;
T > Т;
t > т;
U > У;
u > у;
V > В;
v > в;
W > В;
w > в;
X > Х;
x > х;
Y > Й;
y > й;
Z > З;
z > з;
Ž > Ж;
ž > ж;
Ä > Е;
ä > е;
Ö > Ё;
ö > ё;
Ü > Ю;
ü > ю;
Ï > Ы;
ï > ы;
Ÿ > Й;
ÿ > й;
' > ь;
· > ъ;
`;
