export const latnBgRules = `
::Null;

· > ;
\\' > ъ;

ńa > ня;
Ńa > Ня;
ńA > нЯ;
ŃA > НЯ;

ńu > ню;
Ńu > Ню;
ńU > нЮ;
ŃU > НЮ;

ńo > ньо;
Ńo > Ньо;
ńO > ньО;
ŃO > НЬО;

ńe > не;
Ńe > Не;
ńE > нЕ;
ŃE > НЕ;

ńi > ни;
Ńi > Ни;
ńI > нИ;
ŃI > НИ;

ľa > ля;
Ľa > Ля;
ľA > лЯ;
ĽA > ЛЯ;

ľu > лю;
Ľu > Лю;
ľU > лЮ;
ĽU > ЛЮ;

ľo > льо;
Ľo > Льо;
ľO > льО;
ĽO > ЛЬО;

ľe > ле;
Ľe > Ле;
ľE > лЕ;
ĽE > ЛЕ;

ľi > ли;
Ľi > Ли;
ľI > лИ;
ĽI > ЛИ;

[iи] { a } [:^Letter:] > я;
[IИ] { a } [:^Letter:] > я;
[iи] { A } [:^Letter:] > Я;
[IИ] { A } [:^Letter:] > Я;

ya > я;
Ya > Я;
yA > Я;
YA > Я;

yu > ю;
Yu > Ю;
yU > Ю;
YU > Ю;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { yo > ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { yO > ьО;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Yo > Ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { YO > ЬО;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { ye > ие;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Ye > Ие;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { yE > иЕ;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { YE > ИЕ;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { yä > ие;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { Yä > Ие;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { yÄ > иЕ;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬ] { YÄ > ИЕ;

ye > е;
Ye > Е;
yE > Е;
YE > Е;

yä > е;
Yä > Е;
yÄ > Е;
YÄ > Е;

yo > йо;
Yo > Йо;
yO > йО;
YO > ЙО;

ij > ей;
Ij > Ей;
iJ > еЙ;
IJ > ЕЙ;

št > щ;
Št > Щ;
šT > Щ;
ŠT > Щ;

dž > дж;
Dž > Дж;
dŽ > дЖ;
DŽ > ДЖ;

dz > дз;
Dz > Дз;
dZ > дЗ;
DZ > ДЗ;

ts > ц;
Ts > Ц;
tS > Ц;
TS > Ц;

th > т;
Th > Т;
tH > т;
TH > Т;

gh > г;
Gh > Г;
gH > г;
GH > Г;

ng > нг;
Ng > Нг;
nG > нГ;
NG > НГ;

kh > х;
Kh > Х;
kH > х;
KH > Х;

đ > дж;
Đ } [:Lower:] > Дж;
Đ > ДЖ;

ń > нь;
Ń } [:Lower:] > Нь;
Ń > НЬ;

ľ > ль;
Ľ } [:Lower:] > Ль;
Ľ > ЛЬ;

[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ö > ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Ö } [:Lower:] > Ьо;
[bcdfghjklmnpqrstvwxzBCDFGHJKLMNPQRSTVWXZľńšžđćčĽŃŠŽĐĆČбвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Ö > ЬО;

ö > йо;
Ö } [:Lower:] > Йо;
Ö > ЙО;

ä > е;
Ä > Е;

ü > ю;
Ü > Ю;

ï > ъ;
Ï > Ъ;

ÿ > у;
Ÿ > У;

ć > ч;
Ć > Ч;

č > ч;
Č > Ч;

š > ш;
Š > Ш;

ž > ж;
Ž > Ж;

x > х;
X > Х;

y > й;
Y > Й;

a > а;
A > А;

b > б;
B > Б;

d > д;
D > Д;

e > е;
E > Е;

f > ф;
F > Ф;

g > г;
G > Г;

h > х;
H > Х;

i > и;
I > И;

k > к;
K > К;

l > л;
L > Л;

m > м;
M > М;

n > н;
N > Н;

o > о;
O > О;

p > п;
P > П;

q > к;
Q > К;

r > р;
R > Р;

s > с;
S > С;

t > т;
T > Т;

u > у;
U > У;

v > в;
V > В;

w > в;
W > В;

z > з;
Z > З;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Дд] { [Дд] > ;
[Жж] { [Жж] > ;
[Зз] { [Зз] > ;
[Йй] { [Йй] > ;
[Кк] { [Кк] > ;
[Лл] { [Лл] > ;
[Мм] { [Мм] > ;
[Нн] { [Нн] > ;
[Пп] { [Пп] > ;
[Рр] { [Рр] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[:^Letter:] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;

[ьЬ] } [:^Letter:] > ;
[ьЬ] } [^оО] > ;
ъ } [:^Letter:] > и;
Ъ } [:^Letter:] > И;

::Null;

йа > я;
Йа > Я;
йА > Я;
ЙА > Я;

йу > ю;
Йу > Ю;
йУ > Ю;
ЙУ > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
