export const latnBgRules = `
::Null;

$consonant = [bdfghklmnpqrstvwxzščžćđńľBDFGHKLMNPQRSTVWXZŠČŽĆĐŃĽ];

$consonant { yo > ьо;
$consonant { Yo > Ьо;
$consonant { yO > ьО;
$consonant { YO > ЬО;

$consonant { ö > ьо;
$consonant { Ö } [:Lower:] > Ьо;
$consonant { Ö > ЬО;

ńa > ня;
Ńa > Ня;
ńA > нЯ;
ŃA > НЯ;

ńu > ню;
Ńu > Ню;
ńU > нЮ;
ŃU > НЮ;

ńo > ньо;
Ńo > Ньо;
ńO > ньО;
ŃO > НЬО;

ľa > ля;
Ľa > Ля;
ľA > лЯ;
ĽA > ЛЯ;

ľu > лю;
Ľu > Лю;
ľU > лЮ;
ĽU > ЛЮ;

ľo > льо;
Ľo > Льо;
ľO > льО;
ĽO > ЛЬО;

ya > я;
Ya > Я;
yA > Я;
YA > Я;

yu > ю;
Yu > Ю;
yU > Ю;
YU > Ю;

yo > йо;
Yo > Йо;
yO > йО;
YO > ЙО;

št > щ;
Št > Щ;
šT > Щ;
ŠT > Щ;

dž > дж;
Dž > Дж;
dŽ > дЖ;
DŽ > ДЖ;

dz > дз;
Dz > Дз;
dZ > дЗ;
DZ > ДЗ;

ts > ц;
Ts > Ц;
tS > Ц;
TS > Ц;

đ > дж;
Đ } [:Lower:] > Дж;
Đ > ДЖ;

ń > нь;
Ń } [:Lower:] > Нь;
Ń > НЬ;

ľ > ль;
Ľ } [:Lower:] > Ль;
Ľ > ЛЬ;

ö > йо;
Ö } [:Lower:] > Йо;
Ö > ЙО;

ä > е;
Ä > Е;

ü > ю;
Ü > Ю;

ï > и;
Ï > И;

ÿ > й;
Ÿ > Й;

ć > ч;
Ć > Ч;

č > ч;
Č > Ч;

š > ш;
Š > Ш;

ž > ж;
Ž > Ж;

x > х;
X > Х;

y > й;
Y > Й;

a > а;
A > А;

b > б;
B > Б;

d > д;
D > Д;

e > е;
E > Е;

f > ф;
F > Ф;

g > г;
G > Г;

h > х;
H > Х;

i > и;
I > И;

k > к;
K > К;

l > л;
L > Л;

m > м;
M > М;

n > н;
N > Н;

o > о;
O > О;

p > п;
P > П;

q > к;
Q > К;

r > р;
R > Р;

s > с;
S > С;

t > т;
T > Т;

u > у;
U > У;

v > в;
V > В;

w > в;
W > В;

z > з;
Z > З;

::Null;

аа > а;
АА > А;
бб > б;
ББ > Б;
вв > в;
ВВ > В;
гг > г;
ГГ > Г;
дд > д;
ДД > Д;
ее > е;
ЕЕ > Е;
жж > ж;
ЖЖ > Ж;
зз > з;
ЗЗ > З;
ии > и;
ИИ > И;
йй > й;
ЙЙ > Й;
кк > к;
КК > К;
лл > л;
ЛЛ > Л;
мм > м;
ММ > М;
нн > н;
НН > Н;
оо > о;
ОО > О;
пп > п;
ПП > П;
рр > р;
РР > Р;
сс > с;
СС > С;
тт > т;
ТТ > Т;
уу > у;
УУ > У;
фф > ф;
ФФ > Ф;
хх > х;
ХХ > Х;
цц > ц;
ЦЦ > Ц;
чч > ч;
ЧЧ > Ч;
шш > ш;
ШШ > Ш;
щщ > щ;
ЩЩ > Щ;
ъъ > ъ;
ЪЪ > Ъ;
ьь > ь;
ЬЬ > Ь;
юю > ю;
ЮЮ > Ю;
яя > я;
ЯЯ > Я;

::Null;

йа > я;
ЙА > Я;
йу > ю;
ЙУ > Ю;
шт > щ;
ШТ > Щ;

::Null;

$c = [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ];

[:^Letter:] { й } $c > и;
[:^Letter:] { Й } $c > И;
$c { й } $c > и;
$c { Й } $c > И;
`;
