export const mkBgRules = `
ЈА > Я;
Ја > Я;
ја > я;
ЈУ > Ю;
Ју > Ю;
ју > ю;

[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊ] { ЈО > ЬО;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊ] { Јо > Ьо;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊ] { јо > ьо;
[бвгдѕжзклмнпрстфхцчшљњ] { ЈО > ЬО;
[бвгдѕжзклмнпрстфхцчшљњ] { Јо > Ьо;
[бвгдѕжзклмнпрстфхцчшљњ] { јо > ьо;

ЈО > ЙО;
Јо > Йо;
јо > йо;

[бвгдѕжзклмнпрстфхцчшљњ] { је > ие;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊ] { ЈЕ > ИЕ;
[БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊ] { Је > Ие;

ЈЕ > ЙЕ;
Је > Йе;
је > йе;

Ј > Й;
ј > й;

ЌА > КЯ;
Ќа > Кя;
ќа > кя;
ЌУ > КЮ;
Ќу > Кю;
ќу > кю;
ЌО > КЬО;
Ќо > Кьо;
ќо > кьо;
Ќ > К;
ќ > к;

ЃА > ГЯ;
Ѓа > Гя;
ѓа > гя;
ЃУ > ГЮ;
Ѓу > Гю;
ѓу > гю;
ЃО > ГЬО;
Ѓо > Гьо;
ѓо > гьо;
Ѓ > Г;
ѓ > г;

ЉА > ЛЯ;
Ља > Ля;
ља > ля;
ЉО > ЛЬО;
Љо > Льо;
љо > льо;
ЉУ > ЛЮ;
Љу > Лю;
љу > лю;
Љ > Л;
љ > л;

ЊА > НЯ;
Ња > Ня;
ња > ня;
ЊО > НЬО;
Њо > Ньо;
њо > ньо;
ЊУ > НЮ;
Њу > Ню;
њу > ню;
Њ > Н;
њ > н;

Ѕ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ] > ДЗ;
Ѕ > Дз;
ѕ > дз;

Џ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ] > ДЖ;
Џ > Дж;
џ > дж;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Дд] { [Дд] > ;
[Жж] { [Жж] > ;
[Зз] { [Зз] > ;
[Йй] { [Йй] > ;
[Кк] { [Кк] > ;
[Лл] { [Лл] > ;
[Мм] { [Мм] > ;
[Нн] { [Нн] > ;
[Пп] { [Пп] > ;
[Рр] { [Рр] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [^бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [^бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [:^Letter:] > ;
[ьЬ] } [^оО] > ;
ъ } [:^Letter:] > и;
Ъ } [:^Letter:] > И;

::Null;

[йя] а > я;
[ЙЯ] а > Я;
[йя] А > Я;
[ЙЯ] А > Я;

[йю] у > ю;
[ЙЮ] у > Ю;
[йю] У > Ю;
[ЙЮ] У > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
