export const mkBgRules = `
$lower_cons = [бвгдѕжзклмнпрстфхцчшљњ];
$upper_cons = [БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊ];
$upper = [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ];

ЈА > Я;
Ја > Я;
ја > я;
ЈУ > Ю;
Ју > Ю;
ју > ю;

$upper_cons { ЈО } > ЬО;
$upper_cons { Јо } > Ьо;
$upper_cons { јо } > ьо;
$lower_cons { ЈО } > ЬО;
$lower_cons { Јо } > Ьо;
$lower_cons { јо } > ьо;

ЈО > ЙО;
Јо > Йо;
јо > йо;

$lower_cons { је } > ие;
$upper_cons { ЈЕ } > ИЕ;
$upper_cons { Је } > Ие;

ЈЕ > ЙЕ;
Је > Йе;
је > йе;

Ј > Й;
ј > й;

ЌА > КЯ;
Ќа > Кя;
ќа > кя;
ЌУ > КЮ;
Ќу > Кю;
ќу > кю;
ЌО > КЬО;
Ќо > Кьо;
ќо > кьо;
Ќ > К;
ќ > к;

ЃА > ГЯ;
Ѓа > Гя;
ѓа > гя;
ЃУ > ГЮ;
Ѓу > Гю;
ѓу > гю;
ЃО > ГЬО;
Ѓо > Гьо;
ѓо > гьо;
Ѓ > Г;
ѓ > г;

ЉА > ЛЯ;
Ља > Ля;
ља > ля;
ЉО > ЛЬО;
Љо > Льо;
љо > льо;
ЉУ > ЛЮ;
Љу > Лю;
љу > лю;
Љ > Л;
љ > л;

ЊА > НЯ;
Ња > Ня;
ња > ня;
ЊО > НЬО;
Њо > Ньо;
њо > ньо;
ЊУ > НЮ;
Њу > Ню;
њу > ню;
Њ > Н;
њ > н;

Ѕ } $upper > ДЗ;
Ѕ > Дз;
ѕ > дз;

Џ } $upper > ДЖ;
Џ > Дж;
џ > дж;

::Null;

[Аа] { [Аа] > ;
[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Дд] { [Дд] > ;
[Ее] { [Ее] > ;
[Жж] { [Жж] > ;
[Зз] { [Зз] > ;
[Ии] { [Ии] > ;
[Йй] { [Йй] > ;
[Кк] { [Кк] > ;
[Лл] { [Лл] > ;
[Мм] { [Мм] > ;
[Нн] { [Нн] > ;
[Оо] { [Оо] > ;
[Пп] { [Пп] > ;
[Рр] { [Рр] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Уу] { [Уу] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[йЙ] } [иИ] > ;
[:^Letter:] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;

ь } [аеиуАЕИУ] > й;
Ь } [аеиуАЕИУ] > Й;
ь } [яюъЯЮЪ] > ;
Ь } [яюъЯЮЪ] > ;
[ъЪьЬ] } [:^Letter:] > ;

::Null;

йа > я;
Йа > Я;
йА > Я;
ЙА > Я;

йу > ю;
Йу > Ю;
йУ > Ю;
ЙУ > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
