export const mkBgRules = `
$lower_cons = [бвгдѕжзклмнпрстфхцчшљњ];
$upper_cons = [БВГДЅЖЗКЛМНПРСТФХЦЧШЉЊ];
$upper = [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ];

ЈА > Я;
Ја > Я;
ја > я;
ЈУ > Ю;
Ју > Ю;
ју > ю;

$upper_cons { ЈО } > ЬО;
$upper_cons { Јо } > Ьо;
$upper_cons { јо } > ьо;
$lower_cons { ЈО } > ЬО;
$lower_cons { Јо } > Ьо;
$lower_cons { јо } > ьо;

ЈО > ЙО;
Јо > Йо;
јо > йо;

$lower_cons { је } > ие;
$upper_cons { ЈЕ } > ИЕ;
$upper_cons { Је } > Ие;

ЈЕ > ЙЕ;
Је > Йе;
је > йе;

Ј > Й;
ј > й;

ЌА > КЯ;
Ќа > Кя;
ќа > кя;
ЌУ > КЮ;
Ќу > Кю;
ќу > кю;
ЌО > КЬО;
Ќо > Кьо;
ќо > кьо;
Ќ > К;
ќ > к;

ЃА > ГЯ;
Ѓа > Гя;
ѓа > гя;
ЃУ > ГЮ;
Ѓу > Гю;
ѓу > гю;
ЃО > ГЬО;
Ѓо > Гьо;
ѓо > гьо;
Ѓ > Г;
ѓ > г;

ЉА > ЛЯ;
Ља > Ля;
ља > ля;
ЉО > ЛЬО;
Љо > Льо;
љо > льо;
ЉУ > ЛЮ;
Љу > Лю;
љу > лю;
Љ > Л;
љ > л;

ЊА > НЯ;
Ња > Ня;
ња > ня;
ЊО > НЬО;
Њо > Ньо;
њо > ньо;
ЊУ > НЮ;
Њу > Ню;
њу > ню;
Њ > Н;
њ > н;

Ѕ } $upper > ДЗ;
Ѕ > Дз;
ѕ > дз;

Џ } $upper > ДЖ;
Џ > Дж;
џ > дж;

::Null;

аа > а;
АА > А;
бб > б;
ББ > Б;
вв > в;
ВВ > В;
гг > г;
ГГ > Г;
дд > д;
ДД > Д;
ее > е;
ЕЕ > Е;
жж > ж;
ЖЖ > Ж;
зз > з;
ЗЗ > З;
ии > и;
ИИ > И;
йй > й;
ЙЙ > Й;
кк > к;
КК > К;
лл > л;
ЛЛ > Л;
мм > м;
ММ > М;
нн > н;
НН > Н;
оо > о;
ОО > О;
пп > п;
ПП > П;
рр > р;
РР > Р;
сс > с;
СС > С;
тт > т;
ТТ > Т;
уу > у;
УУ > У;
фф > ф;
ФФ > Ф;
хх > х;
ХХ > Х;
цц > ц;
ЦЦ > Ц;
чч > ч;
ЧЧ > Ч;
шш > ш;
ШШ > Ш;
щщ > щ;
ЩЩ > Щ;
ъъ > ъ;
ЪЪ > Ъ;
ьь > ь;
ЬЬ > Ь;
юю > ю;
ЮЮ > Ю;
яя > я;
ЯЯ > Я;

::Null;

йа > я;
ЙА > Я;
йу > ю;
ЙУ > Ю;
шт > щ;
ШТ > Щ;
`;
