// Digraph system ICAO Doc 9303

export const mkEnRules = `
{ Ѓ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > GJ;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Ѓ } > GJ;
Ѓ > Gj;
ѓ > gj;

{ Ж } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > ZH;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Ж } > ZH;
Ж > Zh;
ж > zh;

{ Ѕ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > DZ;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Ѕ } > DZ;
Ѕ > Dz;
ѕ > dz;

{ Љ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > LJ;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Љ } > LJ;
Љ > Lj;
љ > lj;

{ Њ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > NJ;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Њ } > NJ;
Њ > Nj;
њ > nj;

{ Ќ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > KJ;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Ќ } > KJ;
Ќ > Kj;
ќ > kj;

{ Ч } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > CH;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Ч } > CH;
Ч > Ch;
ч > ch;

{ Џ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > DJ;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Џ } > DJ;
Џ > Dj;
џ > dj;

{ Ш } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] > SH;
[АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШ[:Upper:]] { Ш } > SH;
Ш > Sh;
ш > sh;

А > A;
а > a;
Б > B;
б > b;
В > V;
в > v;
Г > G;
г > g;
Д > D;
д > d;
Е > E;
е > e;
З > Z;
з > z;
И > I;
и > i;
Ј > J;
ј > j;
К > K;
к > k;
Л > L;
л > l;
М > M;
м > m;
Н > N;
н > n;
О > O;
о > o;
П > P;
п > p;
Р > R;
р > r;
С > S;
с > s;
Т > T;
т > t;
У > U;
у > u;
Ф > F;
ф > f;
Х > H;
х > h;
Ц > C;
ц > c;

::Null;

[wW] { [wW] > ;
[yY] { [yY] > ;
[hH] { [hH] > ;
[iI] { [iIyY] } [:^Letter:] > ;
[yY] { [iIyY] } [:^Letter:] > ;
[:^Letter:] { [cC] } [kK] > ;

::Null;

[kK] { [kK] } [hH] > ;
[gG] { [gG] } [hH] > ;
`;
