export const mkRuRules = `
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Ја > Ья;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈА > ЬЯ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ја > ья;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Ју > Ью;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈУ > ЬЮ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ју > ью;

Ја > Я;
ЈА > Я;
ја > я;
Ју > Ю;
ЈУ > Ю;
ју > ю;

[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Је > Ье;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈЕ > ЬЕ;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { је > ье;

Је > Е;
ЈЕ > Е;
је > е;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { Јо > Ьо;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { ЈО > ЬО;
[бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ] { јо > ьо;
Јо > Йо;
ЈО > ЙО;
јо > йо;
Ј > Й;
ј > й;

Ља > Ля;
ЉА > ЛЯ;
ља > ля;
Љу > Лю;
ЉУ > ЛЮ;
љу > лю;
Љо > Льо;
ЉО > ЛЬО;
љо > льо;
Ље > Ле;
ЉЕ > ЛЕ;
ље > ле;
Љи > Ли;
ЉИ > ЛИ;
љи > ли;
Љ } [абвгдѓежзѕијклљмнњопрстќуфхцчџш] > Ль;
Љ > ЛЬ;
љ > ль;

Ња > Ня;
ЊА > НЯ;
ња > ня;
Њу > Ню;
ЊУ > НЮ;
њу > ню;
Њо > Ньо;
ЊО > НЬО;
њо > ньо;
Ње > Не;
ЊЕ > НЕ;
ње > не;
Њи > Ни;
ЊИ > НИ;
њи > ни;
Њ } [абвгдѓежзѕијклљмнњопрстќуфхцчџш] > Нь;
Њ > НЬ;
њ > нь;

Ѓа > Гя;
ЃА > ГЯ;
ѓа > гя;
Ѓу > Гю;
ЃУ > ГЮ;
ѓу > гю;
Ѓо > Гьо;
ЃО > ГЬО;
ѓо > гьо;
Ѓе > Ге;
ЃЕ > ГЕ;
ѓе > ге;
Ѓи > Ги;
ЃИ > ГИ;
ѓи > ги;
Ѓ } [абвгдѓежзѕијклљмнњопрстќуфхцчџш] > Гь;
Ѓ > ГЬ;
ѓ > гь;

Ќа > Кя;
ЌА > КЯ;
ќа > кя;
Ќу > Кю;
ЌУ > КЮ;
ќу > кю;
Ќо > Кьо;
ЌО > КЬО;
ќо > кьо;
Ќе > Ке;
ЌЕ > КЕ;
ќе > ке;
Ќи > Ки;
ЌИ > КИ;
ќи > ки;
Ќ } [абвгдѓежзѕијклљмнњопрстќуфхцчџш] > Кь;
Ќ > КЬ;
ќ > кь;

Ѕ } [абвгдѓежзѕијклљмнњопрстќуфхцчџш] > Дз;
Ѕ > ДЗ;
ѕ > дз;

Џ } [абвгдѓежзѕијклљмнњопрстќуфхцчџш] > Дж;
Џ > ДЖ;
џ > дж;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[Йй] { [Йй] > ;

::Null;

йи > и;
йИ > и;
Йи > И;
ЙИ > И;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > ;
[:^Letter:] { [ъЪьЬ] > ;
[ъЪ] } [:^Letter:] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
