export const mkRuRules = `
$lower = [абвгдѓежзѕијклљмнњопрстќуфхцчџш];
$cons = [бвгджзклмнпрстфхцчшѓѕљњќџБВГДЖЗКЛМНПРСТФХЦЧШЃЅЉЊЌЏ];

$cons { Ја > Ья;
$cons { ЈА > ЬЯ;
$cons { ја > ья;
$cons { Ју > Ью;
$cons { ЈУ > ЬЮ;
$cons { ју > ью;

Ја > Я;
ЈА > Я;
ја > я;
Ју > Ю;
ЈУ > Ю;
ју > ю;

$cons { Је > Ье;
$cons { ЈЕ > ЬЕ;
$cons { је > ье;

Је > Е;
ЈЕ > Е;
је > е;
$cons { Јо > Ьо;
$cons { ЈО > ЬО;
$cons { јо > ьо;
Јо > Йо;
ЈО > ЙО;
јо > йо;
Ј > Й;
ј > й;

Ља > Ля;
ЉА > ЛЯ;
ља > ля;
Љу > Лю;
ЉУ > ЛЮ;
љу > лю;
Љо > Льо;
ЉО > ЛЬО;
љо > льо;
Ље > Ле;
ЉЕ > ЛЕ;
ље > ле;
Љи > Ли;
ЉИ > ЛИ;
љи > ли;
Љ } $lower > Ль;
Љ > ЛЬ;
љ > ль;

Ња > Ня;
ЊА > НЯ;
ња > ня;
Њу > Ню;
ЊУ > НЮ;
њу > ню;
Њо > Ньо;
ЊО > НЬО;
њо > ньо;
Ње > Не;
ЊЕ > НЕ;
ње > не;
Њи > Ни;
ЊИ > НИ;
њи > ни;
Њ } $lower > Нь;
Њ > НЬ;
њ > нь;

Ѓа > Гя;
ЃА > ГЯ;
ѓа > гя;
Ѓу > Гю;
ЃУ > ГЮ;
ѓу > гю;
Ѓо > Гьо;
ЃО > ГЬО;
ѓо > гьо;
Ѓе > Ге;
ЃЕ > ГЕ;
ѓе > ге;
Ѓи > Ги;
ЃИ > ГИ;
ѓи > ги;
Ѓ } $lower > Гь;
Ѓ > ГЬ;
ѓ > гь;

Ќа > Кя;
ЌА > КЯ;
ќа > кя;
Ќу > Кю;
ЌУ > КЮ;
ќу > кю;
Ќо > Кьо;
ЌО > КЬО;
ќо > кьо;
Ќе > Ке;
ЌЕ > КЕ;
ќе > ке;
Ќи > Ки;
ЌИ > КИ;
ќи > ки;
Ќ } $lower > Кь;
Ќ > КЬ;
ќ > кь;

Ѕ } $lower > Дз;
Ѕ > ДЗ;
ѕ > дз;

Џ } $lower > Дж;
Џ > ДЖ;
џ > дж;
`;
