export const mkUkRules = `
Александар > Олександр;
Ана > Ганна;
Димитар > Дмитро;
Елена > Олена;
Јован > Іван;
Никола > Микола;
Петар > Петро;
Стефан > Степан;
Марија > Марія;
Софија > Софія;
Филип > Пилип;
Катарина > Катерина;
Ивана > Іванна;
Христијан > Християн;
Туризам > Туризм;
Хемија > Хімія;

И } Ј > І;
и } ј > і;
И } Е > І;
и } е > і;

ИО > ІО;
Ио > Іо;
ио > іо;

[БПВМФбпвмф] { ЈА > ’Я;
[БПВМФбпвмф] { Ја > ’Я;
[БПВМФбпвмф] { ја > ’я;
[БПВМФбпвмф] { ЈЕ > ’Є;
[БПВМФбпвмф] { Је > ’Є;
[БПВМФбпвмф] { је > ’є;
[БПВМФбпвмф] { ЈУ > ’Ю;
[БПВМФбпвмф] { Ју > ’Ю;
[БПВМФбпвмф] { ју > ’ю;
[БПВМФбпвмф] { ЈИ > ’Ї;
[БПВМФбпвмф] { Ји > ’Ї;
[БПВМФбпвмф] { ји > ’ї;

ЈА > Я;
Ја > Я;
ја > я;
ЈЕ > Є;
Је > Є;
је > є;
ЈИ > Ї;
Ји > Ї;
ји > ї;
ЈО > ЙО;
Јо > Йо;
јо > йо;
ЈУ > Ю;
Ју > Ю;
ју > ю;
Ј > Й;
ј > й;

ЛЈО > ЛЬО;
Лјо > Льо;
лјо > льо;
ЉА > ЛЯ;
Ља > Ля;
ља > ля;
ЉЕ > ЛЄ;
Ље > Лє;
ље > лє;
ЉИ > ЛІ;
Љи > Лі;
љи > лі;
ЉО > ЛЬО;
Љо > Льо;
љо > льо;
ЉУ > ЛЮ;
Љу > Лю;
љу > лю;
Љ > ЛЬ;
љ > ль;

ЊА > НЯ;
Ња > Ня;
ња > ня;
ЊЕ > НЄ;
Ње > Нє;
ње > нє;
ЊИ > НІ;
Њи > Ні;
њи > ні;
ЊО > НЬО;
Њо > Ньо;
њо > ньо;
ЊУ > НЮ;
Њу > Ню;
њу > ню;
Њ > НЬ;
њ > нь;

ЃА > ҐЯ;
Ѓа > Ґя;
ѓа > ґя;
ЃЕ > ҐЄ;
Ѓе > Ґє;
ѓе > ґє;
ЃИ > ҐІ;
Ѓи > Ґі;
ѓи > ґі;
ЃО > ҐЬО;
Ѓо > Ґьо;
ѓо > ґьо;
ЃУ > ҐЮ;
Ѓу > Ґю;
ѓу > ґю;
Ѓ > ҐЬ;
ѓ > ґь;

ЌА > КЯ;
Ќа > Кя;
ќа > кя;
ЌЕ > КЄ;
Ќе > Кє;
ќе > кє;
ЌИ > КІ;
Ќи > Кі;
ќи > кі;
ЌО > КЬО;
Ќо > Кьо;
ќо > кьо;
ЌУ > КЮ;
Ќу > Кю;
ќу > кю;
Ќ > КЬ;
ќ > кь;

ЛСКИ > ЛЬСЬКИЙ;
Лски > Льський;
лски > льський;
ЛСКА > ЛЬСЬКА;
Лска > Льська;
лска > льська;
ски > ський;
ска > ська;

ЦИ > ЦІ;
Ци > Ці;
ци > ці;

Ѕ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШЯЄІЇЮ] > ДЗ;
Ѕ > Дз;
ѕ > дз;

Џ } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШЯЄІЇЮ] > ДЖ;
Џ > Дж;
џ > дж;

ИА > ІЯ;
Иа > Ія;
иа > ія;

[:^Letter:] { И > І;
[:^Letter:] { и > і;

[аеиоуяєіїюАЕИОУЯЄІЇЮ] { Е } [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШЯЄІЇЮ] > Є;
[аеиоуяєіїюАЕИОУЯЄІЇЮ] { Е > Є;
[аеиоуяєіїюАЕИОУЯЄІЇЮ] { е > є;

::Null;

ШЧ > Щ;
Шч > Щ;
шЧ > щ;
шч > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { йа > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { йА > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { Йа > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { ЙА > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { йе > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { йЕ > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { Йе > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { ЙЕ > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { йі > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { йІ > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { Йі > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { ЙІ > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { йу > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { йУ > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { Йу > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { ЙУ > \\'Ю;

йа > я;
йА > Я;
Йа > Я;
ЙА > Я;

йе > є;
йЕ > Є;
Йе > Є;
ЙЕ > Є;

йі > ї;
йІ > Ї;
Йі > Ї;
ЙІ > Ї;

йу > ю;
йУ > Ю;
Йу > Ю;
ЙУ > Ю;

::Null;

[:^Letter:] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[:^Letter:] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { ь } [ЯЮЄЇяюєї] > \\';
[БПВМФГҐКХРбпвмфгґкхр] { Ь } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюя] { ь > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { Ь > ;
[:^Letter:] { ь > ;
[:^Letter:] { Ь > ;
[ЖЧШЩжчшщ] { ь > ;
[ЖЧШЩжчшщ] { Ь > ;
[Ьь] } [Ьь] > ;

[:^Letter:] { \\' > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { ь > ;
\\' { Ь > ;
ь } \\' > ;
Ь } \\' > ;
\\' { \\' > ;
`;
