export const mkUkRules = `
$vowels = [аеиоуяєіїюАЕИОУЯЄІЇЮ];
$upper = [АБВГДЃЕЖЗЅИЈКЛЉМНЊОПРСТЌУФХЦЧЏШЯЄІЇЮ];
$labial = [БПВМФбпвмф];

Александар > Олександр;
Ана > Ганна;
Димитар > Дмитро;
Елена > Олена;
Јован > Іван;
Никола > Микола;
Петар > Петро;
Стефан > Степан;
Марија > Марія;
Софија > Софія;
Филип > Пилип;
Катарина > Катерина;
Ивана > Іванна;
Христијан > Християн;
Туризам > Туризм;
Хемија > Хімія;

И } Ј > І;
и } ј > і;
И } Е > І;
и } е > і;

ИО > ІО;
Ио > Іо;
ио > іо;

$labial { ЈА > ’Я;
$labial { Ја > ’Я;
$labial { ја > ’я;
$labial { ЈЕ > ’Є;
$labial { Је > ’Є;
$labial { је > ’є;
$labial { ЈУ > ’Ю;
$labial { Ју > ’Ю;
$labial { ју > ’ю;
$labial { ЈИ > ’Ї;
$labial { Ји > ’Ї;
$labial { ји > ’ї;

ЈА > Я;
Ја > Я;
ја > я;
ЈЕ > Є;
Је > Є;
је > є;
ЈИ > Ї;
Ји > Ї;
ји > ї;
ЈО > ЙО;
Јо > Йо;
јо > йо;
ЈУ > Ю;
Ју > Ю;
ју > ю;
Ј > Й;
ј > й;

ЛЈО > ЛЬО;
Лјо > Льо;
лјо > льо;
ЉА > ЛЯ;
Ља > Ля;
ља > ля;
ЉЕ > ЛЄ;
Ље > Лє;
ље > лє;
ЉИ > ЛІ;
Љи > Лі;
љи > лі;
ЉО > ЛЬО;
Љо > Льо;
љо > льо;
ЉУ > ЛЮ;
Љу > Лю;
љу > лю;
Љ > ЛЬ;
љ > ль;

ЊА > НЯ;
Ња > Ня;
ња > ня;
ЊЕ > НЄ;
Ње > Нє;
ње > нє;
ЊИ > НІ;
Њи > Ні;
њи > ні;
ЊО > НЬО;
Њо > Ньо;
њо > ньо;
ЊУ > НЮ;
Њу > Ню;
њу > ню;
Њ > НЬ;
њ > нь;

ЃА > ҐЯ;
Ѓа > Ґя;
ѓа > ґя;
ЃЕ > ҐЄ;
Ѓе > Ґє;
ѓе > ґє;
ЃИ > ҐІ;
Ѓи > Ґі;
ѓи > ґі;
ЃО > ҐЬО;
Ѓо > Ґьо;
ѓо > ґьо;
ЃУ > ҐЮ;
Ѓу > Ґю;
ѓу > ґю;
Ѓ > ҐЬ;
ѓ > ґь;

ЌА > КЯ;
Ќа > Кя;
ќа > кя;
ЌЕ > КЄ;
Ќе > Кє;
ќе > кє;
ЌИ > КІ;
Ќи > Кі;
ќи > кі;
ЌО > КЬО;
Ќо > Кьо;
ќо > кьо;
ЌУ > КЮ;
Ќу > Кю;
ќу > кю;
Ќ > КЬ;
ќ > кь;

ЛСКИ > ЛЬСЬКИЙ;
Лски > Льський;
лски > льський;
ЛСКА > ЛЬСЬКА;
Лска > Льська;
лска > льська;
ски > ський;
ска > ська;

ЦИ > ЦІ;
Ци > Ці;
ци > ці;

Ѕ } $upper > ДЗ;
Ѕ > Дз;
ѕ > дз;

Џ } $upper > ДЖ;
Џ > Дж;
џ > дж;

ИА > ІЯ;
Иа > Ія;
иа > ія;

[^[:L:]] { И > І;
[^[:L:]] { и > і;
^И > І;
^и > і;

$vowels { Е } $upper > Є;
$vowels { Е > Є;
$vowels { е > є;
`;
