export const ruBgRules = `
$hard = [ЖЧШЩЦжчшщц];
$cons = [БВГДЗКЛМНПРСТФХбвгдзклмнпрстфх];
$not_o = [^оО];

ский > ски;
Ский > Ски;
СКИЙ > СКИ;

ская > ска;
Ская > Ска;
СКАЯ > СКА;

цкий > цки;
Цкий > Цки;
ЦКИЙ > ЦКИ;

цкая > цка;
Цкая > Цка;
ЦКАЯ > ЦКА;

сс > с;
Сс > С;
СС > С;

$hard { ё > о;
$hard { Ё > О;

$cons { ё > ьо;
$cons { Ё } [:Lower:] > Ьо;
$cons { Ё > ЬО;

ье > ие;
Ье > Ие;
ЬЕ > ИЕ;
ья > ия;
Ья > Ия;
ЬЯ > ИЯ;
ью > ию;
Ью > Ию;
ЬЮ > ИЮ;
ьи > и;
Ьи > И;
ЬИ > И;
йя > я;
Йя > Я;
ЙЯ > Я;

ё > йо;
Ё } [:Lower:] > Йо;
Ё > ЙО;

э > е;
Э > Е;
ы > и;
Ы > И;

ь } $not_o >;
Ь } $not_o >;
ъ >;
Ъ >;

::Null;

[Аа] { [Аа] > ;
[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Дд] { [Дд] > ;
[Ее] { [Ее] > ;
[Жж] { [Жж] > ;
[Зз] { [Зз] > ;
[Ии] { [Ии] > ;
[Йй] { [Йй] > ;
[Кк] { [Кк] > ;
[Лл] { [Лл] > ;
[Мм] { [Мм] > ;
[Нн] { [Нн] > ;
[Оо] { [Оо] > ;
[Пп] { [Пп] > ;
[Рр] { [Рр] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Уу] { [Уу] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[йЙ] } [иИ] > ;
[:^Letter:] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;

ь } [аеиуАЕИУ] > й;
Ь } [аеиуАЕИУ] > Й;
ь } [яюъЯЮЪ] > ;
Ь } [яюъЯЮЪ] > ;
[ъЪьЬ] } [:^Letter:] > ;

::Null;

йа > я;
Йа > Я;
йА > Я;
ЙА > Я;

йу > ю;
Йу > Ю;
йУ > Ю;
ЙУ > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
