export const ruBgRules = `
ский > ски;
Ский > Ски;
СКИЙ > СКИ;

ская > ска;
Ская > Ска;
СКАЯ > СКА;

цкий > цки;
Цкий > Цки;
ЦКИЙ > ЦКИ;

цкая > цка;
Цкая > Цка;
ЦКАЯ > ЦКА;

сс > с;
Сс > С;
СС > С;

[ЖЧШЩЦжчшщц] { ё > о;
[ЖЧШЩЦжчшщц] { Ё > О;

[БВГДЗКЛМНПРСТФХбвгдзклмнпрстфх] { ё > ьо;
[БВГДЗКЛМНПРСТФХбвгдзклмнпрстфх] { Ё } [:Lower:] > Ьо;
[БВГДЗКЛМНПРСТФХбвгдзклмнпрстфх] { Ё > ЬО;

ье > ие;
Ье > Ие;
ЬЕ > ИЕ;
ья > ия;
Ья > Ия;
ЬЯ > ИЯ;
ью > ию;
Ью > Ию;
ЬЮ > ИЮ;
ьи > и;
Ьи > И;
ЬИ > И;
йя > я;
Йя > Я;
ЙЯ > Я;

ё > йо;
Ё } [:Lower:] > Йо;
Ё > ЙО;

э > е;
Э > Е;
ы > и;
Ы > И;

ь } [^оО] >;
Ь } [^оО] >;
ъ >;
Ъ >;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Дд] { [Дд] > ;
[Жж] { [Жж] > ;
[Зз] { [Зз] > ;
[Йй] { [Йй] > ;
[Кк] { [Кк] > ;
[Лл] { [Лл] > ;
[Мм] { [Мм] > ;
[Нн] { [Нн] > ;
[Пп] { [Пп] > ;
[Рр] { [Рр] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[:^Letter:] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;

[ьЬ] } [:^Letter:] > ;
[ьЬ] } [^оО] > ;
ъ } [:^Letter:] > и;
Ъ } [:^Letter:] > И;

::Null;

йа > я;
Йа > Я;
йА > Я;
ЙА > Я;

йу > ю;
Йу > Ю;
йУ > Ю;
ЙУ > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
