export const ruLatnRules = `
::NFC;

ДЖ } [:Lu:] > DŽ;
[:Lu:] { ДЖ > DŽ;
ДЖ > Dž;
Дж > Dž;
дж > dž;

ДЗ } [:Lu:] > DZ;
[:Lu:] { ДЗ > DZ;
ДЗ > Dz;
Дз > Dz;
дз > dz;

Щ } [:Lu:] > ŠČ;
[:Lu:] { Щ > ŠČ;
Щ > Šč;
щ > šč;

Ц } [:Lu:] > TS;
[:Lu:] { Ц > TS;
Ц > Ts;
ц > ts;

Ю } [:Lu:] > YU;
[:Lu:] { Ю > YU;
Ю > Yu;
ю > yu;

Я } [:Lu:] > YA;
[:Lu:] { Я > YA;
Я > Ya;
я > ya;

Ё } [:Lu:] > YO;
[:Lu:] { Ё > YO;
Ё > Yo;
ё > yo;

ЛЬ > Ľ;
Ль > Ľ;
ль > ľ;

НЬ > Ń;
Нь > Ń;
нь > ń;

ДЬ > Đ;
Дь > Đ;
дь > đ;

[:^Letter:] { Е } [:Lu:] > YE;
[:^Letter:] { Е > Ye;
[:^Letter:] { е > ye;

[АЕЁИОУЫЭЮЯаеёиоуыэюяAaEeIiOoUuYyÏïĽľŃńĐđ] { Е } [:Lu:] > YE;
[АЕЁИОУЫЭЮЯAEIOUYÏĽŃĐ] { Е > YE;
[АЕЁИОУЫЭЮЯаеёиоуыэюяAaEeIiOoUuYyÏïĽľŃńĐđ] { Е > Ye;
[АЕЁИОУЫЭЮЯаеёиоуыэюяAaEeIiOoUuYyÏïĽľŃńĐđ] { е > ye;

ЪЕ > \\'YE;
ъЕ > \\'Ye;
Ъе > \\'ye;
ъе > \\'ye;
ЬЕ > YE;
ьЕ > Ye;
Ье > ye;
ье > ye;

::Null;

А > A;
а > a;
Б > B;
б > b;
В > V;
в > v;
Г > G;
г > g;
Д > D;
д > d;
Е > E;
е > e;
Ж > Ž;
ж > ž;
З > Z;
з > z;
И > I;
и > i;
Й > Y;
й > y;
К > K;
к > k;
Л > L;
л > l;
М > M;
м > m;
Н > N;
н > n;
О > O;
о > o;
П > P;
п > p;
Р > R;
р > r;
С > S;
с > s;
Т > T;
т > t;
У > U;
у > u;
Ф > F;
ф > f;
Х > X;
х > x;
Ч > Č;
ч > č;
Ш > Š;
ш > š;
Ы > Ï;
ы > ï;
Э > E;
э > e;
[Ъъ] > \\';
[Ьь] > ;
`;
