export const ruLatnRules = `
::NFC;

ДЖ } [:Upper:] > DŽ;
[:Upper:] { ДЖ > DŽ;
ДЖ > Dž;
Дж > Dž;
дж > dž;

ДЗ } [:Upper:] > DZ;
[:Upper:] { ДЗ > DZ;
ДЗ > Dz;
Дз > Dz;
дз > dz;

Щ } [:Upper:] > ŠČ;
[:Upper:] { Щ > ŠČ;
Щ > Šč;
щ > šč;

Ц } [:Upper:] > TS;
[:Upper:] { Ц > TS;
Ц > Ts;
ц > ts;

Ю } [:Upper:] > YU;
[:Upper:] { Ю > YU;
Ю > Yu;
ю > yu;

Я } [:Upper:] > YA;
[:Upper:] { Я > YA;
Я > Ya;
я > ya;

Ё } [:Upper:] > YO;
[:Upper:] { Ё > YO;
Ё > Yo;
ё > yo;

[:^Letter:] { Е } [:Upper:] > YE;
[:^Letter:] { Е > Ye;
[:^Letter:] { е > ye;

[АЕЁИОУЫЭЮЯаеёиоуыэюя] { Е } [:Upper:] > YE;
[АЕЁИОУЫЭЮЯаеёиоуыэюя] { Е > Ye;
[АЕЁИОУЫЭЮЯаеёиоуыэюя] { е > ye;

[ЪЬъь] { Е } [:Upper:] > YE;
[ЪЬъь] { Е > Ye;
[ЪЬъь] { е > ye;

ЛЬ > Ľ;
Ль > Ľ;
ль > ľ;

НЬ > Ń;
Нь > Ń;
нь > ń;

ТЬ > Ć;
Ть > Ć;
ть > ć;

ДЬ > Đ;
Дь > Đ;
дь > đ;

::Null;

А > A;
а > a;
Б > B;
б > b;
В > V;
в > v;
Г > G;
г > g;
Д > D;
д > d;
Е > E;
е > e;
Ж > Ž;
ж > ž;
З > Z;
з > z;
И > I;
и > i;
Й > Y;
й > y;
К > K;
к > k;
Л > L;
л > l;
М > M;
м > m;
Н > N;
н > n;
О > O;
о > o;
П > P;
п > p;
Р > R;
р > r;
С > S;
с > s;
Т > T;
т > t;
У > U;
у > u;
Ф > F;
ф > f;
Х > X;
х > x;
Ч > Č;
ч > č;
Ш > Š;
ш > š;
Ы > Ï;
ы > ï;
Э > E;
э > e;
[Ъъ] > \\';
[Ьь] > ;
`;
