export const ruUkRules = `
Александрович > Олександрович;
Александровна > Олександрівна;
Александр > Олександр;
Алексеевич > Олексійович;
Алексеевна > Олексіївна;
Алексей > Олексій;
Анатольевич > Анатолійович;
Анатольевна > Анатоліївна;
Анатолий > Анатолій;
Васильевич > Васильович;
Васильевна > Василівна;
Василий > Василь;
Владимирович > Володимирович;
Владимировна > Володимирівна;
Владимир > Володимир;
Григорьевич > Григорович;
Григорьевна > Григорівна;
Григорий > Григорій;
Дмитриевич > Дмитрович;
Дмитриевна > Дмитрівна;
Дмитрий > Дмитро;
Евгеньевич > Євгенійович;
Евгеньевна > Євгенівна;
Евгений > Євген;
Ильинична > Іллівна;
Ильич > Ілліч;
Илья > Ілля;
Михайлович > Михайлович;
Михайловна > Михайлівна;
Михаил > Михайло;
Николаевич > Миколайович;
Николаевна > Миколаївна;
Николай > Микола;
Сергеевич > Сергійович;
Сергеевна > Сергіївна;
Сергей > Сергій;
Юрьевич > Юрійович;
Юрьевна > Юріївна;
Юрий > Юрій;
Андреевич > Андрійович;
Андреевна > Андріївна;
Андрей > Андрій;
Антонович > Антонович;
Антоновна > Антонівна;
Анна > Ганна;
Артемович > Артемович;
Артемовна > Артемівна;
Артем > Артем;
Афанасьевич > Опанасович;
Афанасьевна > Опанасівна;
Афанасий > Опанас;
Богданович > Богданович;
Богдановна > Богданівна;
Богдан > Богдан;
Валерьевич > Валерійович;
Валерьевна > Валеріївна;
Валерий > Валерій;
Викторович > Вікторович;
Викторовна > Вікторівна;
Виктор > Віктор;
Витальевич > Віталійович;
Витальевна > Віталіївна;
Виталий > Віталій;
Вячеславович > В'ячеславович;
Вячеславовна > В'ячеславівна;
Вячеслав > В'ячеслав;
Геннадьевич > Геннадійович;
Геннадьевна > Геннадіївна;
Геннадий > Геннадій;
Георгиевич > Георгійович;
Георгиевна > Георгіївна;
Георгий > Георгій;
Глебович > Глібович;
Глебовна > Глібівна;
Глеб > Гліб;
Данилович > Данилович;
Даниловна > Данилівна;
Даниил > Данило;
Дарья > Дар'я;
Евдокия > Євдокія;
Егорович > Єгорович;
Егоровна > Єгорівна;
Егор > Єгор;
Екатерина > Катерина;
Елена > Олена;
Елизавета > Єлизавета;
Ефимович > Юхимович;
Ефимовна > Юхимівна;
Ефим > Юхим;
Игоревич > Ігорович;
Игоревна > Ігорівна;
Игорь > Ігор;
Иосифович > Йосипович;
Иосифовна > Йосипівна;
Иосиф > Йосип;
Кириллович > Кирилович;
Кирилловна > Кирилівна;
Кирилл > Кирило;
Константинович > Костянтинович;
Константиновна > Костянтинівна;
Константин > Костянтин;
Ксения > Ксенія;
Львович > Львович;
Львовна > Львівна;
Лев > Лев;
Мария > Марія;
Матвеевич > Матвійович;
Матвеевна > Матвіївна;
Матвей > Матвій;
Надежда > Надія;
Наталья > Наталія;
Наталия > Наталія;
Никитович > Микитович;
Никитична > Микитівна;
Никитич > Микитович;
Никита > Микита;
Павлович > Павлович;
Павловна > Павлівна;
Павел > Павло;
Петрович > Петрович;
Петровна > Петрівна;
Петр > Петро;
Романович > Романович;
Романовна > Романівна;
Роман > Роман;
Светлана > Світлана;
Софья > Софія;
Степанович > Степанович;
Степановна > Степанівна;
Степан > Степан;
Татьяна > Тетяна;
Тимофеевич > Тимофійович;
Тимофеевна > Тимофіївна;
Тимофей > Тимофій;
Ульяна > Уляна;
Федорович > Федорович;
Федоровна > Федорівна;
Федор > Федір;
Филиппович > Пилипович;
Филипповна > Пилипівна;
Филипп > Пилип;
Эдуардович > Едуардович;
Эдуардовна > Едуардівна;
Эдуард > Едуард;
Яковлевич > Якович;
Яковлевна > Яківна;
Яков > Яків;
Иванович > Іванович;
Ивановна > Іванівна;
Арсеньевич > Арсенійович;
Арсеньевна > Арсеніївна;
Галина > Галина;
Марина > Марина;
Белгород > Бєлгород;
Менделеев > Мендєлєєв;
Поволжье > Поволжя;
Северсталь > Сєвєрсталь;
Цветаева > Цвєтаєва;

Евна } [:^Letter:] > Івна;
евна } [:^Letter:] > івна;

Овна } [:^Letter:] > Івна;
овна } [:^Letter:] > івна;

[сц] { кий } > ький;
[СЦ] { КИЙ } > ЬКИЙ;
[сц] { кая } > ька;
[СЦ] { КАЯ } > ЬКА;

сси > сі;
Сси > Сі;
ССИ > СІ;

ец } [:^Letter:] > ець;
Ец } [:^Letter:] > Ець;
ЕЦ } [:^Letter:] > ЕЦЬ;

с { к } [:^Letter:] > ь к;
С { К } [:^Letter:] > Ь К;

[ЖЦЧШЩжцчшщ] { Ё } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄІЇҐ] > О;
[ЖЦЧШЩжцчшщ] { Ё } > о;
[ЖЦЧШЩжцчшщ] { ё } > о;

[БВГДЖЗЙКЛМНПРСТФХЦЧШЩбвгджзйклмнпрстфхцчшщҐґ] { Ё } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄІЇҐ] > ЬО;
[БВГДЖЗЙКЛМНПРСТФХЦЧШЩбвгджзйклмнпрстфхцчшщҐґ] { Ё } > Ьо;
[БВГДЖЗЙКЛМНПРСТФХЦЧШЩбвгджзйклмнпрстфхцчшщҐґ] { ё } > ьо;

Ё } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄІЇҐ] > ЙО;
Ё > Йо;
ё > йо;

[БПВМФбпвмф] { Я } > \u0027 Я;
[БПВМФбпвмф] { я } > \u0027 я;
[БПВМФбпвмф] { Ю } > \u0027 Ю;
[БПВМФбпвмф] { ю } > \u0027 ю;
[БПВМФбпвмф] { Е } > \u0027 Є;
[БПВМФбпвмф] { е } > \u0027 є;

[АЕЁИОУЫЭЮЯаеёиоуыэюяЄІЇєії] { Е } > Є;
[АЕЁИОУЫЭЮЯаеёиоуыэюяЄІЇєії] { е } > є;
[ЬЪьъ'’‘\`´ʼ] { Е } > Є;
[ЬЪьъ'’‘\`´ʼ] { е } > є;
[:^Letter:] { Е } > Є;
[:^Letter:] { е } > є;

[АЕЁИОУЫЭЮЯаеёиоуыэюяЄІЇєії] { И } > Ї;
[АЕЁИОУЫЭЮЯаеёиоуыэюяЄІЇєії] { и } > ї;
[ЬЪьъ'’‘\`´ʼ] { И } > Ї;
[ЬЪьъ'’‘\`´ʼ] { и } > ї;
[ЖЦЧШЩжцчшщ] { И } > И;
[ЖЦЧШЩжцчшщ] { и } > и;
[ДТЗСЦЖШЧРдтзсцжшчр] { И } > И;
[ДТЗСЦЖШЧРдтзсцжшчр] { и } > и;
И > І;
и > і;

Ъ > ’;
ъ > ’;
Ы > И;
ы > и;
Э > Е;
э > е;

::Null;

ШЧ > Щ;
Шч > Щ;
шЧ > щ;
шч > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { йа > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { йА > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { Йа > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { ЙА > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { йе > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { йЕ > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { Йе > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { ЙЕ > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { йі > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { йІ > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { Йі > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { ЙІ > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { йу > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { йУ > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { Йу > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { ЙУ > \\'Ю;

йа > я;
йА > Я;
Йа > Я;
ЙА > Я;

йе > є;
йЕ > Є;
Йе > Є;
ЙЕ > Є;

йі > ї;
йІ > Ї;
Йі > Ї;
ЙІ > Ї;

йу > ю;
йУ > Ю;
Йу > Ю;
ЙУ > Ю;

::Null;

[:^Letter:] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[:^Letter:] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { ь } [ЯЮЄЇяюєї] > \\';
[БПВМФГҐКХРбпвмфгґкхр] { Ь } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюя] { ь > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { Ь > ;
[:^Letter:] { ь > ;
[:^Letter:] { Ь > ;
[ЖЧШЩжчшщ] { ь > ;
[ЖЧШЩжчшщ] { Ь > ;
[Ьь] } [Ьь] > ;

[:^Letter:] { \\' > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { ь > ;
\\' { Ь > ;
ь } \\' > ;
Ь } \\' > ;
\\' { \\' > ;
`;
