export const ukBgRules = `
$apos = ['’‘\`´ʼ"];
$upper = [А-ЯЄІЇҐ];

Україна > Украйна;
УКРАЇНА > УКРАЙНА;
Київ > Киев;
КИЇВ > КИЕВ;

ґ > г;
Ґ > Г;
є > е;
Є > Е;
і > и;
І > И;
ї > и;
Ї > И;

Щ } $upper > ШЧ;
Щ > Шч;
щ > шч;

$apos > ;

ьо > \uE000;
Ьо > \uE001;
ЬО > \uE002;
ьО > \uE003;

Ь > ;
ь > ;

::Null;

\uE000 > ьо;
\uE001 > Ьо;
\uE002 > ЬО;
\uE003 > ьО;

нн > н;
Нн > Н;
НН > Н;
жж > ж;
Жж > Ж;
ЖЖ > Ж;
сс > с;
Сс > С;
СС > С;
лл > л;
Лл > Л;
ЛЛ > Л;
чч > ч;
Чч > Ч;
ЧЧ > Ч;
тт > т;
Тт > Т;
ТТ > Т;
вв > в;
Вв > В;
ВВ > В;

ский > ски;
Ский > Ски;
СКИЙ > СКИ;
цкий > цки;
Цкий > Цки;
ЦКИЙ > ЦКИ;
зкий > зки;
Зкий > Зки;
ЗКИЙ > ЗКИ;
`;
