export const ukBgRules = `
$apos = ['’‘\`´ʼ"];
$upper = [А-ЯЄІЇҐ];

Україна > Украйна;
УКРАЇНА > УКРАЙНА;
Київ > Киев;
КИЇВ > КИЕВ;

ґ > г;
Ґ > Г;
є > е;
Є > Е;
і > и;
І > И;
ї > и;
Ї > И;

Щ } $upper > ШЧ;
Щ > Шч;
щ > шч;

$apos > ;

ьо > \uE000;
Ьо > \uE001;
ЬО > \uE002;
ьО > \uE003;

Ь > ;
ь > ;

::Null;

\uE000 > ьо;
\uE001 > Ьо;
\uE002 > ЬО;
\uE003 > ьО;

нн > н;
Нн > Н;
НН > Н;
жж > ж;
Жж > Ж;
ЖЖ > Ж;
сс > с;
Сс > С;
СС > С;
лл > л;
Лл > Л;
ЛЛ > Л;
чч > ч;
Чч > Ч;
ЧЧ > Ч;
тт > т;
Тт > Т;
ТТ > Т;
вв > в;
Вв > В;
ВВ > В;

ский > ски;
Ский > Ски;
СКИЙ > СКИ;
цкий > цки;
Цкий > Цки;
ЦКИЙ > ЦКИ;
зкий > зки;
Зкий > Зки;
ЗКИЙ > ЗКИ;

::Null;

[Аа] { [Аа] > ;
[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Дд] { [Дд] > ;
[Ее] { [Ее] > ;
[Жж] { [Жж] > ;
[Зз] { [Зз] > ;
[Ии] { [Ии] > ;
[Йй] { [Йй] > ;
[Кк] { [Кк] > ;
[Лл] { [Лл] > ;
[Мм] { [Мм] > ;
[Нн] { [Нн] > ;
[Оо] { [Оо] > ;
[Пп] { [Пп] > ;
[Рр] { [Рр] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Уу] { [Уу] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[йЙ] } [иИ] > ;
[:^Letter:] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > и;
[бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] { Й } [бвгджзйклмнрстфхцчшщБВГДЖЗЙКЛМНРСТФХЦЧШЩ] > И;

ь } [аеиуАЕИУ] > й;
Ь } [аеиуАЕИУ] > Й;
ь } [яюъЯЮЪ] > ;
Ь } [яюъЯЮЪ] > ;
[ъЪьЬ] } [:^Letter:] > ;

::Null;

йа > я;
Йа > Я;
йА > Я;
ЙА > Я;

йу > ю;
Йу > Ю;
йУ > Ю;
ЙУ > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
