export const ukBgRules = `
$apos = ['’‘\`´ʼ"];
$upper = [А-ЯЄІЇҐ];

Україна > Украйна;
УКРАЇНА > УКРАЙНА;
Київ > Киев;
КИЇВ > КИЕВ;

ґ > г;
Ґ > Г;
є > е;
Є > Е;
і > и;
І > И;
ї > и;
Ї > И;

Щ } $upper > ШЧ;
Щ > Шч;
щ > шч;

$apos > ;

ьо > \uE000;
Ьо > \uE001;
ЬО > \uE002;
ьО > \uE003;

Ь > ;
ь > ;

::Null;

\uE000 > ьо;
\uE001 > Ьо;
\uE002 > ЬО;
\uE003 > ьО;

нн > н;
Нн > Н;
НН > Н;
жж > ж;
Жж > Ж;
ЖЖ > Ж;
сс > с;
Сс > С;
СС > С;
лл > л;
Лл > Л;
ЛЛ > Л;
чч > ч;
Чч > Ч;
ЧЧ > Ч;
тт > т;
Тт > Т;
ТТ > Т;
вв > в;
Вв > В;
ВВ > В;

ский > ски;
Ский > Ски;
СКИЙ > СКИ;
цкий > цки;
Цкий > Цки;
ЦКИЙ > ЦКИ;
зкий > зки;
Зкий > Зки;
ЗКИЙ > ЗКИ;

::Null;

аа > а;
АА > А;
бб > б;
ББ > Б;
вв > в;
ВВ > В;
гг > г;
ГГ > Г;
дд > д;
ДД > Д;
ее > е;
ЕЕ > Е;
жж > ж;
ЖЖ > Ж;
зз > з;
ЗЗ > З;
ии > и;
ИИ > И;
йй > й;
ЙЙ > Й;
кк > к;
КК > К;
лл > л;
ЛЛ > Л;
мм > м;
ММ > М;
нн > н;
НН > Н;
оо > о;
ОО > О;
пп > п;
ПП > П;
рр > р;
РР > Р;
сс > с;
СС > С;
тт > т;
ТТ > Т;
уу > у;
УУ > У;
фф > ф;
ФФ > Ф;
хх > х;
ХХ > Х;
цц > ц;
ЦЦ > Ц;
чч > ч;
ЧЧ > Ч;
шш > ш;
ШШ > Ш;
щщ > щ;
ЩЩ > Щ;
ъъ > ъ;
ЪЪ > Ъ;
ьь > ь;
ЬЬ > Ь;
юю > ю;
ЮЮ > Ю;
яя > я;
ЯЯ > Я;

::Null;

йа > я;
ЙА > Я;
йу > ю;
ЙУ > Ю;
шт > щ;
ШТ > Щ;
`;
