// Ukrainian National (2010) transliteration system

export const ukEnRules = `
['’‘\`´ʼ] > ;

ЗГ > ZGH;
Зг > Zgh;
зГ > zGH;
зг > zgh;

[:^Letter:] { Є } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > YE;
[:^Letter:] { Є } > Ye;
[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Є } > IE;
Є } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > IE;
Є > Ie;
[:^Letter:] { є } > ye;
є > ie;

[:^Letter:] { Ю } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > YU;
[:^Letter:] { Ю } > Yu;
[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Ю } > IU;
Ю } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > IU;
Ю > Iu;
[:^Letter:] { ю } > yu;
ю > iu;

[:^Letter:] { Я } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > YA;
[:^Letter:] { Я } > Ya;
[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Я } > IA;
Я } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > IA;
Я > Ia;
[:^Letter:] { я } > ya;
я > ia;

[:^Letter:] { Ї } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > YI;
[:^Letter:] { Ї } > Yi;
[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Ї } > I;
Ї } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > I;
Ї > I;
[:^Letter:] { ї } > yi;
ї > i;

[:^Letter:] { Й } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > Y;
[:^Letter:] { Й } > Y;
[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Й } > I;
Й } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > I;
Й > I;
[:^Letter:] { й } > y;
й > i;

[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Щ } > SHCH;
Щ } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > SHCH;
Щ > Shch;
щ > shch;

[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Ж } > ZH;
Ж } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > ZH;
Ж > Zh;
ж > zh;

[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Х } > KH;
Х } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > KH;
Х > Kh;
х > kh;

[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Ц } > TS;
Ц } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > TS;
Ц > Ts;
ц > ts;

[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Ч } > CH;
Ч } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > CH;
Ч > Ch;
ч > ch;

[АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] { Ш } > SH;
Ш } [АБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ[:Upper:]] > SH;
Ш > Sh;
ш > sh;

А > A;
Б > B;
В > V;
Г > H;
Ґ > G;
Д > D;
Е > E;
З > Z;
И > Y;
І > I;
К > K;
Л > L;
М > M;
Н > N;
О > O;
П > P;
Р > R;
С > S;
Т > T;
У > U;
Ф > F;
Ь > ;
а > a;
б > b;
в > v;
г > h;
ґ > g;
д > d;
е > e;
з > z;
и > y;
і > i;
к > k;
л > l;
м > m;
н > n;
о > o;
п > p;
р > r;
с > s;
т > t;
у > u;
ф > f;
ь > ;

::Null;

[wW] { [wW] > ;
[yY] { [yY] > ;
[hH] { [hH] > ;
[iI] { [iIyY] } [:^Letter:] > ;
[yY] { [iIyY] } [:^Letter:] > ;
[:^Letter:] { [cC] } [kK] > ;

::Null;

[kK] { [kK] } [hH] > ;
[gG] { [gG] } [hH] > ;
`;
