export const urArRules = `
ا { [ہۂ] } [:^Letter:] > ه;
و { [ہۂ] } [:^Letter:] > ه;
الل { [ہۂ] } [:^Letter:] > ه;
[:^Letter:] ی { [ہۂ] } [:^Letter:] > ه;
[:^Letter:] ک { [ہۂ] } [:^Letter:] > ه;
[:^Letter:] ن { [ہۂ] } [:^Letter:] > ه;
[ہۂ] } [:^Letter:] > ة;
َ { ی } [:^Letter:] > ى;
[یے] ٰ > ى;
پھ > ف;
تھ > ث;
چھ > ش;

::Null;

پ > ب;
ٹ > ت;
چ > تش;
ڈ > د;
ڑ > ر;
ژ > ز;
گ > غ;
ک > ك;
ں > ن;
[یےۓ] > ي;
[ہھۂ] > ه;
ۃ > ة;

::Null;

۰ > ٠;
۱ > ١;
۲ > ٢;
۳ > ٣;
۴ > ٤;
۵ > ٥;
۶ > ٦;
۷ > ٧;
۸ > ٨;
۹ > ٩;

::Null;

اا > آ;
أا > آ;
إا > آ;
آا > آ;

::Null;

[:^Letter:] { ة > ت;
[:^Letter:] { ى > ي;

::Null;

ة } [:Letter:] > ت;
ى } [:Letter:] > ي;
`;
