export const zhBgRules = `
[āáǎàɑɐæ] > a;
[ēéěèê] > e;
[īíǐì] > i;
[ōóǒò] > o;
[ūúǔù] > u;
[ǖǘǚǜv] > ü;

[:^Letter:] { ['’‘\`´ʼ] > ;
['’‘\`´ʼ] } [:^Letter:] > ;

::Null;

yang > ян;
ying > ин;
yong > юн;
yuan > юен;
yüan > юен;
yue > юе;
yüe > юе;
yun > юн;
yün > юн;
yao > яо;
yan > ян;
you > йоу;
ya > я;
ye > е;
yin > ин;
yi > и;
yu > ю;
yo > йо;

wang > уан;
weng > уън;
wai > уай;
wei > уей;
wan > уан;
wen > уън;
wa > уа;
wo > уо;
wu > у;

juan > дзюен;
quan > цюен;
xuan > сюен;
jüan > дзюен;
qüan > цюен;
xüan > сюен;
jue > дзюе;
que > цюе;
xue > сюе;
jüe > дзюе;
qüe > цюе;
xüe > сюе;
jun > дзюн;
qun > цюн;
xun > сюн;
jün > дзюн;
qün > цюн;
xün > сюн;
ju > дзю;
qu > цю;
xu > сю;
jü > дзю;
qü > цю;
xü > сю;

zhi > джъ;
chi > чъ;
shi > шъ;
ri > жъ;
zi > дзъ;
ci > цъ;
si > съ;

iang > ян;
iong > юн;
uang > уан;
ueng > уън;

ang > ан;
eng > ън;
ing > ин;
ong > ун;
ian > иен;
iao > яо;
uai > уай;
uan > уан;
üan > юен;

ai > ай;
ei > ей;
ui > уей;
ao > ао;
ou > оу;
iu > ю;
ie > ие;
ia > я;
in > ин;
un > ун;
ün > юн;
ua > уа;
uo > уо;
ue > юе;
üe > юе;
er > ър;
an > ан;
en > ън;

ng > н;

zh > дж;
ch > ч;
sh > ш;
r > ж;
z > дз;
c > ц;
s > с;
b > б;
p > п;
m > м;
f > ф;
d > д;
t > т;
n > н;
l > л;
g > г;
k > к;
h > х;
j > дз;
q > ц;
x > с;
w > у;
y > й;

a > а;
o > о;
e > ъ;
i > и;
u > у;
ü > ю;

['’‘\`´ʼ] > ;

::Null;

а { а > ;
б { б > ;
в { в > ;
г { г > ;
д { д > ;
е { е > ;
ж { ж > ;
з { з > ;
и { и > ;
й { й > ;
к { к > ;
л { л > ;
м { м > ;
н { н > ;
о { о > ;
п { п > ;
р { р > ;
с { с > ;
т { т > ;
у { у > ;
ф { ф > ;
х { х > ;
ц { ц > ;
ч { ч > ;
ш { ш > ;
щ { щ > ;
ъ { ъ > ;
ь { ь > ;
ю { ю > ;
я { я > ;

::Null;

й } и > ;
[:^Letter:] { й } [бвгджзйклмнрстфхцчшщ] > и;
[бвгджзйклмнрстфхцчшщ] { й } [бвгджзйклмнрстфхцчшщ] > и;

ь } [аеиу] > й;
ь } [яюъ] > ;
[ъь] } [:^Letter:] > ;

::Null;

йа > я;
йу > ю;
шт > щ;

::Title;
`;
