export const koBgRules = `
seoul > сеул;
pyeongyang > пхенян;

chyae > чхе;
chya > чха;
chyeo > чхо;
chyo > чхо;
chyu > чху;

k } [aeiouwyаеиоуъюя] > кх;
t } [aeiouwyаеиоуъюя] > тх;
p } [aeiouwyаеиоуъюя] > пх;

kk > кк;
tt > тт;
pp > пп;
ss > сс;
jj > чч;
ch > чх;

[чж] { yae > е;
[чж] { ya > а;
[чж] { yeo > о;
[чж] { yo > о;
[чж] { yu > у;

j { yae > е;
j { ya > а;
j { yeo > о;
j { yo > о;
j { yu > у;

[aeiouwyаеиоуъюя] { ui > ъй;
[^[:L:][:M:]] { ui > ъй;
ui > и;
[aeiouwyаеиоуъюя] { eui > ъй;
[^[:L:][:M:]] { eui > ъй;
eui > и;
[^[:L:][:M:]] { yae > йе;
[aeiouwyаеиоуъюя] { yae > йе;
yae > е;
[^[:L:][:M:]] { yeo > йо;
[aeiouwyаеиоуъюя] { yeo > йо;
yeo > ьо;
wae > уе;
[^[:L:][:M:]] { ye > йе;
[aeiouwyаеиоуъюя] { ye > йе;
ye > е;
[^[:L:][:M:]] { yo > йо;
[aeiouwyаеиоуъюя] { yo > йо;
yo > ьо;

wa > уа;
we > уе;
wo > уо;
wi > уи;
oe > уе;
yu > ю;
ya > я;
ae > е;
eo > о;
eu > ъ;
a > а;
e > е;
o > о;
u > у;
i > и;
k > к;
t > т;
p > п;
s > с;
h > х;

[ктпсхчшц] { g > к;
[^[:L:][:M:]] { g > к;
g > г;
[ктпсхчшц] { d > т;
[^[:L:][:M:]] { d > т;
d > д;
[ктпсхчшц] { b > п;
[^[:L:][:M:]] { b > п;
b > б;
[ктпсхчшц] { j > ч;
[^[:L:][:M:]] { j > ч;
j > дж;

ng > н;
ll > лл;
l > л;
r > р;
m > м;
n > н;
\\- > ;

::Null;

б { б > ;
в { в > ;
г { г > ;
ж { ж > ;
й { й > ;
м { м > ;
п { п > ;
с { с > ;
ф { ф > ;
ц { ц > ;
ч { ч > ;
ш { ш > ;
щ { щ > ;
ъ { ъ > ;
ь { ь > ;
ю { ю > ;
я { я > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщ] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[аеиоуъюя] { и } [^бвгджзйклмнпрстфхцчшщ] > й;
[аеиоуъюя] { ьо > йо;
[аеиоуъюя] { ье > йе;

ь } [^[:L:][:M:]] > ;
ь } [^о] > ;

::Null;

[йя] а > я;
[йю] у > ю;
шт > щ;

::Title;
`;
