export const koKkRules = `
yae > яй;
yeo > ё;
wae > вэ;
ya > я;
ye > е;
yo > ё;
yu > ю;
wa > ва;
wo > вө;
we > ве;
wi > ви;
ae > э;
eo > ө;
eui > ый;
eu > ы;
oe > ве;
ui > ый;

[^[:L:][:M:]] { e > э;
e > е;
a > а;
i > и;
o > о;
u > у;

kk > кк;
tt > тт;
pp > пп;
jj > чч;
ss > сс;
ng > ң;

ch } [aeiouyw] > чх;
ch > ч;

[^[:L:][:M:]] { g > к;
[кптсфчхцшщ] { g > к;
g > г;

[^[:L:][:M:]] { d > т;
[кптсфчхцшщ] { d > т;
d > д;

[^[:L:][:M:]] { b > п;
[кптсфчхцшщ] { b > п;
b > б;

[^[:L:][:M:]] { j > ч;
[кптсфчхцшщ] { j > ч;
j > ж;

k } [aeiouyw] > кх;
k > к;

t } [aeiouyw] > тх;
t > т;

p } [aeiouyw] > пх;
p > п;

s > с;
h > х;
m > м;
n > н;
r > р;
l > л;
y > й;
w > в;

::Null;

[^[:L:][:M:]] { ң > н;
[үұ] у > у;

::Null;

ә { ә > ;
ө { ө > ;
у { у > ;
ү { ү > ;
ұ { ұ > ;
і { і > ;
ғ { ғ > ;
ң { ң > ;
һ { һ > ;
ё { ё > ;
щ { щ > ;
й { й > ;
[ьъй] { [ьъ] > ;
ъ } [^[:L:][:M:]] > ;
[аәеёиоөуұүъыіэюя] { ъ } [аәеёиоөуұүъыіэюя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъ] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъ] { й } [^[:L:][:M:]] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъ] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъ] > и;

::Null;

қ } [бвгғджзйкқлмнңпрстфхһцчшщьъ]* [әеіөүэ] > к;
ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъ]* [әеіөүэ] > г;
[әеіөүэ] [бвгғджзйкқлмнңпрстфхһцчшщьъ]* { қ > к;
[әеіөүэ] [бвгғджзйкқлмнңпрстфхһцчшщьъ]* { ғ > г;

::Title;
`;
