export const koRuRules = `
seoul > сеул;
pyeongyang > пхеньян;

ng } [aeiouywаеёиоуыэюя] > нъ;
k } [aeiouywаеёиоуыэюя] > кх;
t } [aeiouywаеёиоуыэюя] > тх;
p } [aeiouywаеёиоуыэюя] > пх;

chyae > чхэ;
chya > чха;
chyeo > чхо;
chyo > чхо;
chyu > чху;

[чж] { yae > э;
[чж] { ya > а;
[чж] { yeo > о;
[чж] { yo > о;
[чж] { yu > у;

j { yae > э;
ch { yae > э;
j { ya > а;
ch { ya > а;
j { yeo > о;
ch { yeo > о;
j { yo > о;
ch { yo > о;
j { yu > у;
ch { yu > у;

[aeiouywаеёиоуыэюя] { ui > ый;
[:^Letter:] { ui > ый;
ui > и;

[aeiouywаеёиоуыэюя] { eui > ый;
[:^Letter:] { eui > ый;
eui > и;

yae > йя;
wae > вэ;
yeo > ё;
wa > ва;
we > ве;
wo > во;
wi > ви;
oe > ве;
yu > ю;
ya > я;
ae > э;
eo > о;

[:^Letter:] { ye > йе;
ye > е;

yo > ё;
eu > ы;

a > а;

[:^Letter:] { e > э;
e > е;

o > о;
u > у;
i > и;

kk > кк;
tt > тт;
pp > пп;
ss > сс;
jj > чч;
ch > чх;

k > к;
t > т;
p > п;
s > с;
h > х;

[ктпсхчщшц] { g > к;
[:^Letter:] { g > к;
g > г;

[ктпсхчщшц] { d > т;
[:^Letter:] { d > т;
d > д;

[ктпсхчщшц] { b > п;
[:^Letter:] { b > п;
b > б;

[ктпсхчщшц] { j > ч;
[:^Letter:] { j > ч;
j > дж;

ng > н;
ll > лл;
l > ль;
r > р;
m > м;
n > н;

\\- > ;

::Null;

[жшчщ] { ы > и;

ё { ё > ;
й { й > ;
х { х > ;
ш { ш > ;
щ { щ > ;
ы { ы > ;
[ьъй] { [ьъ] > ;

::Null;

[щъыь] { [ий] а > я;
[щъыь] { [ий] о > ё;
[щъыь] { [ий] е > е;
[щъыь] { [ий] у > ю;

[бвгджзйклмнпрстфхцчшщ] { йа > ья;
[бвгджзйклмнпрстфхцчшщ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщ] { йе > ье;
[бвгджзйклмнпрстфхцчшщ] { йу > ью;
[бвгджзйклмнпрстфхцчшщ] { йи > ьи;

йи > и;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщ] > и;
[бвгджзйклмнпрстфхцчшщьъ] { й } [:^Letter:] > и;
[бвгджзйклмнпрстфхцчшщьъ] { й } [бвгджзйклмнпрстфхцчшщ] > и;

[аоуэыиеёюя] { и } [:^Letter:] > й;

::Null;

[бвгджзйклмнпрстфхцчшщ] { ъ } [бвгджзклмнпрстфхцчшщ] > ;
ъ } [:^Letter:] > ;
ъ } [аоуэыи] > ;
[аоуэыиеёюя] { ъ > ;
[:^Letter:] { [ъь] > ;
[ьъй] { [ьъ] > ;

::Title;
`;
