export const koTgRules = `
::NFC;

seoul > сеул;
pyeongyang > пхенян;

kk > кк;
tt > тт;
pp > пп;
ss > сс;
jj > чч;
ch > чх;

ng } [aeiouwy] > нг;
ng > н;

[^[:L:][:M:]] { yae > йэ;
[аеёиоуыэюяӣӯй] { yae > йэ;
yae > е;
wae > ве;
[^[:L:][:M:]] { ae > э;
[аеёиоуыэюяӣӯй] { ae > э;
ae > е;
oe > ве;

wi > ви;
ui > ӣи;

wa > ва;
wo > во;

we > ве;

ya > я;
yeo > ё;
yo > ё;
yu > ю;
ye > е;

eo > о;
eu > ӣ;

k } [aeiouwy] > кх;
t } [aeiouwy] > тх;
p } [aeiouwy] > пх;

k > к;
t > т;
p > п;

[^[:L:][:M:]] { g > к;
[ктпсчхҳ] { g > к;
g > г;

[^[:L:][:M:]] { d > т;
[ктпсчхҳ] { d > т;
d > д;

[^[:L:][:M:]] { b > п;
[ктпсчхҳ] { b > п;
b > б;

[^[:L:][:M:]] { j > ч;
[ктпсчхҳ] { j > ч;
j > ҷ;

[^[:L:][:M:]] { e > э;
[аеёиоуыэюяӣӯй] { e > э;

e > е;
a > а;
i > и;
o > о;
u > у;
s > с;
h > ҳ;
m > м;
n > н;
r > р;
l > л;
c > ч;



::Null;

щ > шч;
ц > с;
ы > и;
ь > ;

::Null;

[^[:L:][:M:]] { ъ > ;
ъ } [^[:L:][:M:]] > ;

[:L:]+ [бвгғджзйкқлмнпрстфхҳчҷш] [иӣ] { а } [^[:L:][:M:]] > я;

::Null;

[^[:L:][:M:]] { ӣ > и;
ӣ } [[:L:][:M:]] > и;

::Null;

[бвгғджзйкқлмнпрстфхҳчҷш] { э > е;

::Null;

[жшчҷ] { ю > у;
[жшчҷ] { я > а;
[жшчҷ] { ё > о;

::Title;
`;
