export const koUkRules = `
seoul > сеул;
pyeongyang > пхеньян;

ng } [aeiouywаеєиіоуюяї'] > н\\';
k } [aeiouywаеєиіоуюяї'] > кх;
t } [aeiouywаеєиіоуюяї'] > тх;
p } [aeiouywаеєиіоуюяї'] > пх;

chyae > чхе;
chya > чха;
chyeo > чхо;
chyo > чхо;
chyu > чху;

[чж] { yae > е;
[чж] { ya > а;
[чж] { yeo > о;
[чж] { yo > о;
[чж] { yu > у;

j { yae > е;
ch { yae > е;
j { ya > а;
ch { ya > а;
j { yeo > о;
ch { yeo > о;
j { yo > о;
ch { yo > о;
j { yu > у;
ch { yu > у;

[aeiouywаеєиіоуюяї'] { ui > ий;
[^[:L:][:M:]] { ui > ий;
ui > і;

[aeiouywаеєиіоуюяї'] { eui > ий;
[^[:L:][:M:]] { eui > ий;
eui > і;

yae > є;
wae > ве;
wa > ва;
we > ве;
wo > во;
wi > ві;
oe > ве;
yu > ю;
ya > я;
ae > е;
eo > о;

[^[:L:][:M:]] { yeo > йо;
[aeiouywаеєиіоуюяї'] { yeo > йо;
yeo > ьо;

[^[:L:][:M:]] { yo > йо;
[aeiouywаеєиіоуюяї'] { yo > йо;
yo > ьо;

ye > є;
eu > и;
a > а;
e > е;
o > о;
u > у;

[aeiouywаеєиіоуюяї'] { i > ї;
i > і;

kk > кк;
tt > тт;
pp > пп;
ss > сс;
jj > чч;
ch > чх;

k > к;
t > т;
p > п;
s > с;
h > г;

[ктпсхчшц] { g > к;
[^[:L:][:M:]] { g > к;
g > ґ;

[ктпсхчшц] { d > т;
[^[:L:][:M:]] { d > т;
d > д;

[ктпсхчшц] { b > п;
[^[:L:][:M:]] { b > п;
b > б;

[ктпсхчшц] { j > ч;
[^[:L:][:M:]] { j > ч;
j > дж;

ng > н;
ll > лл;
l > ль;
r > р;
m > м;
n > н;

\\- > ;

::Null;

і { а } [^[:L:][:M:]] > я;
і { е > є;
[аеєиіїоуюя] { і > ї;
шч > щ;
й { й > ;

[бпвмфгґкхр] { йа > \\'я;
[бпвмфгґкхр] { йе > \\'є;
[бпвмфгґкхр] { йі > \\'ї;
[бпвмфгґкхр] { йу > \\'ю;

йа > я;
йе > є;
йі > ї;
йу > ю;

::Null;

[^[:L:][:M:]] { й } [бвгґджзклмнпрстфхцчшщ] > і;
[бвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[бвгґджзклмнпрстфхцчшщ] { й } [бвгґджзклмнпрстфхцчшщ] > і;

::Null;

[жчшщ] { я > а;
[жчшщ] { ю > у;
[жчшщ] { є > е;

[бпвмфгґкхр] { ь } [яюєї] > \\';
[бпвмфгґкхр] { Ь } [яюєї] > \\';

[аеєиіїоуюя] { ь > ;
[^[:L:][:M:]] { ь > ;
[жчшщ] { ь > ;
ь } ь > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] > ;
[аеєиіїоуюя] { ['’‘\`´ʼ] > ;
['’‘\`´ʼ] { ь > ;
ь } ['’‘\`´ʼ] > ;
['’‘\`´ʼ] { ['’‘\`´ʼ] > ;

::Title;
`;
