export const ruBgRules = `
ский > ски;
Ский > Ски;
СКИЙ > СКИ;

ская > ска;
Ская > Ска;
СКАЯ > СКА;

цкий > цки;
Цкий > Цки;
ЦКИЙ > ЦКИ;

цкая > цка;
Цкая > Цка;
ЦКАЯ > ЦКА;

сс > с;
Сс > С;
СС > С;

[ЖЧШЩЦжчшщц] { ё > о;
[ЖЧШЩЦжчшщц] { Ё > О;

[БВГДЗКЛМНПРСТФХбвгдзклмнпрстфх] { ё > ьо;
[БВГДЗКЛМНПРСТФХбвгдзклмнпрстфх] { Ё } [:Ll:] > Ьо;
[БВГДЗКЛМНПРСТФХбвгдзклмнпрстфх] { Ё > ЬО;

ье > ие;
Ье > Ие;
ЬЕ > ИЕ;
ья > ия;
Ья > Ия;
ЬЯ > ИЯ;
ью > ию;
Ью > Ию;
ЬЮ > ИЮ;
ьи > и;
Ьи > И;
ЬИ > И;
йя > я;
Йя > Я;
ЙЯ > Я;

ё > йо;
Ё } [:Ll:] > Йо;
Ё > ЙО;

э > е;
Э > Е;
ы > и;
Ы > И;

ь } [^оО] >;
Ь } [^оО] >;
ъ >;
Ъ >;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [ЙйьЬ] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [еиоъЕИОЪ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [еиоъЕИОЪ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { и [аяАЯ] > я;
[аеиоуъюяАЕИОУЪЮЯ] { И [аяАЯ] > Я;
[аеиоуъюяАЕИОУЪЮЯ] { и [уюУЮ] > ю;
[аеиоуъюяАЕИОУЪЮЯ] { И [уюУЮ] > Ю;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;

::Null;

[йя] а > я;
[ЙЯ] а > Я;
[йя] А > Я;
[ЙЯ] А > Я;

[йю] у > ю;
[ЙЮ] у > Ю;
[йю] У > Ю;
[ЙЮ] У > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
