export const ruBgRules = `
::NFC;

[сС] [кК] [иИ] { [йЙ] > ;
[сС] [кК] [аА] { [яЯ] > ;
[цЦ] [кК] [иИ] { [йЙ] > ;
[цЦ] [кК] [аА] { [яЯ] > ;

[ЖЧШЩЦжчшщц] { ё > о;
[ЖЧШЩЦжчшщц] { Ё > О;

[бвгдзклмнпрстфхБВГДЗКЛМНПРСТФХ] { Ё > ЬО;
[бвгдзклмнпрстфхБВГДЗКЛМНПРСТФХ] { ё > ьо;

ье > ие;
Ье > Ие;
ьЕ > иЕ;
ЬЕ > ИЕ;

ья > ия;
Ья > Ия;
ьЯ > иЯ;
ЬЯ > ИЯ;

ью > ию;
Ью > Ию;
ьЮ > иЮ;
ЬЮ > ИЮ;

ь [иИ] > и;
Ь [иИ] > И;

й [яЯ] > я;
Й [яЯ] > Я;

[:Lu:] { Ё > ЙО;
Ё } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ЙО;
Ё } [:Lu:] > ЙО;
Ё > Йо;
ё > йо;

э > е;
Э > Е;

ы > и;
Ы > И;

[ьЬ] } [^оО] > ;
[ъЪ] > ;



::Null;

[Бб] { [Бб]+ > ;
[Вв] { [Вв]+ > ;
[Гг] { [Гг]+ > ;
[Жж] { [Жж]+ > ;
[Йй] { [ЙйьЬ]+ > ;
[Кк] { [Кк]+ > ;
[Лл] { [Лл]+ > ;
[Мм] { [Мм]+ > ;
[Нн] { [Нн]+ > ;
[Пп] { [Пп]+ > ;
[Рр] { [Рр]+ > ;
[Сс] { [Сс]+ > ;
[Тт] { [Тт]+ > ;
[Фф] { [Фф]+ > ;
[Хх] { [Хх]+ > ;
[Цц] { [Цц]+ > ;
[Чч] { [Чч]+ > ;
[Шш] { [Шш]+ > ;
[Щщ] { [Щщ]+ > ;
[Ъъ] { [Ъъ]+ > ;
[Ьь] { [Ьь]+ > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [еиоъЕИОЪ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [еиоъЕИОЪ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { и [аяАЯ] > я;
[аеиоуъюяАЕИОУЪЮЯ] { И [аяАЯ] > Я;
[аеиоуъюяАЕИОУЪЮЯ] { и [уюУЮ] > ю;
[аеиоуъюяАЕИОУЪЮЯ] { И [уюУЮ] > Ю;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ьО > йО;
[аеиоуъюяАЕИОУЪЮЯ] { Ьо > Йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ьЕ > йЕ;
[аеиоуъюяАЕИОУЪЮЯ] { Ье > Йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;

::Null;

[йя] [аА] > я;
[ЙЯ] [аА] > Я;

[йю] [уУ] > ю;
[ЙЮ] [уУ] > Ю;

ш [тТ] > щ;
Ш [тТ] > Щ;

::Null;

[:L:]+ [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] [иИ] { а } [^[:L:][:M:]] > я;
[:L:]+ [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] [иИ] { А } [^[:L:][:M:]] > Я;
`;
