export const ruBgRules = `
[сС] [кК] [иИ] { [йЙ] > ;
[сС] [кК] [аА] { [яЯ] > ;
[цЦ] [кК] [иИ] { [йЙ] > ;
[цЦ] [кК] [аА] { [яЯ] > ;

[ЖЧШЩЦжчшщц] { ё > о;
[ЖЧШЩЦжчшщц] { Ё > О;

[БВГДЗКЛМНПРСТФХ] { Ё > ЬО;
[БВГДЗКЛМНПРСТФХ] { ё > Ьо;
[бвгдзклмнпрстфх] { Ё > ьО;
[бвгдзклмнпрстфх] { ё > ьо;

ье > ие;
Ье > Ие;
ьЕ > иЕ;
ЬЕ > ИЕ;

ья > ия;
Ья > Ия;
ьЯ > иЯ;
ЬЯ > ИЯ;

ью > ию;
Ью > Ию;
ьЮ > иЮ;
ЬЮ > ИЮ;

ь [иИ] > и;
Ь [иИ] > И;

й [яЯ] > я;
Й [яЯ] > Я;

[:Lu:] { Ё > ЙО;
Ё } [:Lu:] > ЙО;
Ё > Йо;
ё > йо;

э > е;
Э > Е;

ы > и;
Ы > И;

ь } [^оО] > ;
Ь } [^оО] > ;

ъ > ;
Ъ > ;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [ЙйьЬ] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [еиоъЕИОЪ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [еиоъЕИОЪ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { и [аяАЯ] > я;
[аеиоуъюяАЕИОУЪЮЯ] { И [аяАЯ] > Я;
[аеиоуъюяАЕИОУЪЮЯ] { и [уюУЮ] > ю;
[аеиоуъюяАЕИОУЪЮЯ] { И [уюУЮ] > Ю;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ьО > йО;
[аеиоуъюяАЕИОУЪЮЯ] { Ьо > Йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ьЕ > йЕ;
[аеиоуъюяАЕИОУЪЮЯ] { Ье > Йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;

::Null;

[йя] [аА] > я;
[ЙЯ] [аА] > Я;

[йю] [уУ] > ю;
[ЙЮ] [уУ] > Ю;

ш [тТ] > щ;
Ш [тТ] > Щ;
`;
