export const ruIpaRules = `
::Lower;
::NFC;

в } [пфктсшхцчщ] > ф;
ж } [пфктсшхцчщ] > ш;
з } [пфктсшхцчщ] > с;

в } [^[:L:][:M:]] > ф;
ж } [^[:L:][:M:]] > ш;
з } [^[:L:][:M:]] > с;

::Null;

[бвгдзклмнпрстфх] { я > ʲa;
[бвгдзклмнпрстфх] { ю > ʲu;
[бвгдзклмнпрстфх] { ё > ʲo;
[бвгдзклмнпрстфх] { е > ʲɛ;
[бвгдзклмнпрстфх] { и > ʲi;
[бвгдзклмнпрстфх] { ь > ʲ;

[жшц] { и > ɨ;
[жшц] { е > ɛ;
[жшц] { ё > o;

[чщ] { е > ɛ;
[чщ] { и > i;
[чщ] { ё > o;
[чщ] { ю > u;
[чщ] { я > a;

::Null;

л } ʲ > l;

я > ja;
ю > ju;
ё > jo;
е > jɛ;
и > i;

ь > ;
ъ > ;

щ > ɕː;
ч > t͡ɕ;
ц > t͡s;

а > a;
б > b;
в > v;
г > ɡ;
д > d;
ж > ʐ;
з > z;
й > j;
к > k;
л > ɫ;
м > m;
н > n;
о > o;
п > p;
р > r;
с > s;
т > t;
у > u;
ф > f;
х > x;
ш > ʂ;
ы > ɨ;
э > ɛ;

::Null;

[:Cyrillic:] > ;
`;
