export const ruKkRules = `
::NFC;

[^[:L:][:M:]] { Ң > Н;
[^[:L:][:M:]] { ң > н;

[ҮҰ] У > У;
[ҮҰ] у > У;
[үұ] У > У;
[үұ] у > у;

::Null;

[Әә] { [Әә] > ;
[Өө] { [Өө] > ;
[Уу] { [Уу] > ;
[Үү] { [Үү] > ;
[Ұұ] { [Ұұ] > ;
[Іі] { [Іі] > ;
[Ғғ] { [Ғғ] > ;
[Ңң] { [Ңң] > ;
[Һһ] { [Һһ] > ;
[Ёё] { [Ёё] > ;
[Щщ] { [Щщ] > ;
[Йй] { [Йй] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
[ъЪ] } [^[:L:][:M:]] > ;
[аәеёиоөуұүъыіэюяАӘЕЁИОӨУҰҮЪЫІЭЮЯ] { [ъЪ] } [аәеёиоөуұүъыіэюяАӘЕЁИОӨУҰҮЪЫІЭЮЯ] > ;

::Null;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йа > ья;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йА > ьЯ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йа > Ья;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙА > ЬЯ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йо > ьё;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йО > ьЁ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йо > Ьё;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙО > ЬЁ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йе > ье;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йЕ > ьЕ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йе > Ье;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙЕ > ЬЕ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йу > ью;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йУ > ьЮ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йу > Ью;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙУ > ЬЮ;

[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йи > ьи;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { йИ > ьИ;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Йи > Ьи;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { ЙИ > ЬИ;

[^[:L:][:M:]] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > и;
[^[:L:][:M:]] { Й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > И;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { й } [^[:L:][:M:]] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Й } [^[:L:][:M:]] > И;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > и;
[бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] { Й } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ] > И;

::Null;

Қ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > К;
қ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > к;
Ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > Г;
ғ } [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* [әеіөүэӘЕІӨҮЭ] > г;

[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { Қ > К;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { қ > к;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { Ғ > Г;
[әеіөүэӘЕІӨҮЭ] [бвгғджзйкқлмнңпрстфхһцчшщьъБВГҒДЖЗЙКҚЛМНҢПРСТФХҺЦЧШЩЬЪ]* { ғ > г;
`;
