export const ruLatnRules = `
::NFC;

ДЖ > DŽ;
дЖ > dŽ;
Дж > Dž;
дж > dž;

ДЗ > DZ;
дЗ > dZ;
Дз > Dz;
дз > dz;

Щ } [:Lu:] > ŠČ;
[:Lu:] { Щ > ŠČ;
Щ > Šč;
щ > šč;

Ц } [:Lu:] > TS;
[:Lu:] { Ц > TS;
Ц > Ts;
ц > ts;

Ю } [:Lu:] > YU;
[:Lu:] { Ю > YU;
Ю > Yu;
ю > yu;

Я } [:Lu:] > YA;
[:Lu:] { Я > YA;
Я > Ya;
я > ya;

Ё } [:Lu:] > YO;
[:Lu:] { Ё > YO;
Ё > Yo;
ё > yo;

Л [Ьь] > Ľ;
л [Ьь] > ľ;

Н [Ьь] > Ń;
н [Ьь] > ń;

Д [Ьь] > Đ;
д [Ьь] > đ;

[^[:L:][:M:]] { Е } [:Lu:] > YE;
[^[:L:][:M:]] { Е > Ye;
[^[:L:][:M:]] { е > ye;

[АЕЁИОУЫЭЮЯAEIOUYÏĽŃĐ] { Е > YE;
[АЕЁИОУЫЭЮЯаеёиоуыэюяAaEeIiOoUuYyÏïĽľŃńĐđ] { Е } [:Lu:] > YE;
[АЕЁИОУЫЭЮЯаеёиоуыэюяAaEeIiOoUuYyÏïĽľŃńĐđ] { Е > Ye;
[АЕЁИОУЫЭЮЯаеёиоуыэюяAaEeIiOoUuYyÏïĽľŃńĐđ] { е > ye;

ЪЕ > \\'YE;
ъЕ > \\'yE;
Ъе > \\'Ye;
ъе > \\'ye;

ЬЕ > YE;
ьЕ > yE;
Ье > Ye;
ье > ye;

::Null;

А > A;
а > a;

Б > B;
б > b;

В > V;
в > v;

Г > G;
г > g;

Д > D;
д > d;

[ЕЭ] > E;
[еэ] > e;

Ж > Ž;
ж > ž;

З > Z;
з > z;

И > I;
и > i;

Й > Y;
й > y;

К > K;
к > k;

Л > L;
л > l;

М > M;
м > m;

Н > N;
н > n;

О > O;
о > o;

П > P;
п > p;

Р > R;
р > r;

С > S;
с > s;

Т > T;
т > t;

У > U;
у > u;

Ф > F;
ф > f;

Х > X;
х > x;

Ч > Č;
ч > č;

Ш > Š;
ш > š;

Ы > Ï;
ы > ï;

[Ъъ] > \\';
[Ьь] > ;
`;
