export const ruMKRules = `
ЩЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ШЧО;
ЩЁ > Шчо;
Щё > Шчо;
щё > шчо;

ЛЬЯ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЉА;
ЛЬЯ > Ља;
Лья > Ља;
лья > ља;

ЛЬЮ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЉУ;
ЛЬЮ > Љу;
Лью > Љу;
лью > љу;

ЛЬЕ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЉЕ;
ЛЬЕ > Ље;
Лье > Ље;
лье > ље;

ЛЬИ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЉИ;
ЛЬИ > Љи;
Льи > Љи;
льи > љи;

ЛЬЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЉО;
ЛЬЁ > Љо;
Льё > Љо;
льё > љо;

НЬЯ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЊА;
НЬЯ > Ња;
Нья > Ња;
нья > ња;

НЬЮ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЊУ;
НЬЮ > Њу;
Нью > Њу;
нью > њу;

НЬЕ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЊЕ;
НЬЕ > Ње;
Нье > Ње;
нье > ње;

НЬИ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЊИ;
НЬИ > Њи;
Ньи > Њи;
ньи > њи;

НЬЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЊО;
НЬЁ > Њо;
Ньё > Њо;
ньё > њо;

ЛЮ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЉУ;
ЛЮ > Љу;
Лю > Љу;
лю > љу;

ЛЯ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЉА;
ЛЯ > Ља;
Ля > Ља;
ля > ља;

ЛЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЉО;
ЛЁ > Љо;
Лё > Љо;
лё > љо;

ЛЬ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > Љ;
ЛЬ > Љ;
Ль > Љ;
ль > љ;

НЮ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЊУ;
НЮ > Њу;
Ню > Њу;
ню > њу;

НЯ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЊА;
НЯ > Ња;
Ня > Ња;
ня > ња;

НЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЊО;
НЁ > Њо;
Нё > Њо;
нё > њо;

НЬ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > Њ;
НЬ > Њ;
Нь > Њ;
нь > њ;

ЖЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЖО;
ЖЁ > Жо;
Жё > Жо;
жё > жо;

ЧЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЧО;
ЧЁ > Чо;
Чё > Чо;
чё > чо;

ШЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ШО;
ШЁ > Шо;
Шё > Шо;
шё > шо;

ТЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ТО;
ТЁ > То;
Тё > То;
тё > то;

ДЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ДО;
ДЁ > До;
Дё > До;
дё > до;

ЬЕ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈЕ;
ЬЕ > Је;
Ье > Је;
ье > је;

ЬИ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈИ;
ЬИ > Ји;
Ьи > Ји;
ьи > ји;

ЬЯ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈА;
ЬЯ > Ја;
Ья > Ја;
ья > ја;

ЬЮ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈУ;
ЬЮ > Ју;
Ью > Ју;
ью > ју;

ЬЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈО;
ЬЁ > Јо;
Ьё > Јо;
ьё > јо;

ЪЕ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈЕ;
ЪЕ > Је;
Ъе > Је;
ъе > је;

ЪЯ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈА;
ЪЯ > Ја;
Ъя > Ја;
ъя > ја;

ЪЮ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈУ;
ЪЮ > Ју;
Ъю > Ју;
ъю > ју;

ЪЁ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈО;
ЪЁ > Јо;
Ъё > Јо;
ъё > јо;

ЦКИЙ > ЦКИ;
Цкий > Цки;
цкий > цки;
ЦКАЯ > ЦКА;
Цкая > Цка;
цкая > цка;

СКИЙ > СКИ;
Ский > Ски;
ский > ски;
СКАЯ > СКА;
Ская > Ска;
ская > ска;

СС > С;
Сс > С;
сс > с;
НН > Н;
Нн > Н;
нн > н;
ЙЯ > ЈА;
Йя > Ја;
йя > ја;

Щ } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ШЧ;
Щ > Шч;
щ > шч;

Ю } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈУ;
Ю > Ју;
ю > ју;

Я } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈА;
Я > Ја;
я > ја;

Ё } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ] > ЈО;
Ё > Јо;
ё > јо;

Э > Е;
э > е;

Ы > И;
ы > и;

Й > Ј;
й > ј;

[ЬьЪъ] > ;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

лј > љ;
Лј > Љ;
ЛЈ > Љ;
лЈ > љ;
нј > њ;
Нј > Њ;
НЈ > Њ;
нЈ > њ;
дз > ѕ;
Дз > Ѕ;
ДЗ > Ѕ;
дЗ > ѕ;
дж > џ;
Дж > Џ;
ДЖ > Џ;
дЖ > џ;

Ји > И;
ЈИ > И;
ји > и;
јИ > И;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { ј } [еЕоО] > ;
[АЕИОУаеиоу] { Ј } [еЕоО] > ;

[:^Letter:] { ['’‘\`´ʼ] } [рР] > ;

[:^Letter:] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[:^Letter:] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
