export const ruMKRules = `
[:Lu:] { ЩЁ > ШЧО;
ЩЁ } [:Lu:] > ШЧО;
Щ [Ёё] > Шчо;
щ [Ёё] > шчо;

ЛЬЯ > ЉА;
Лья > Ља;
лья > ља;

ЛЬЮ > ЉУ;
Лью > Љу;
лью > љу;

ЛЬЕ > ЉЕ;
Лье > Ље;
лье > ље;

ЛЬИ > ЉИ;
Льи > Љи;
льи > љи;

ЛЬЁ > ЉО;
Льё > Љо;
льё > љо;

НЬЯ > ЊА;
Нья > Ња;
нья > ња;

НЬЮ > ЊУ;
Нью > Њу;
нью > њу;

НЬЕ > ЊЕ;
Нье > Ње;
нье > ње;

НЬИ > ЊИ;
Ньи > Њи;
ньи > њи;

НЬЁ > ЊО;
Ньё > Њо;
ньё > њо;

ЛЮ > ЉУ;
лЮ > љУ;
Лю > Љу;
лю > љу;

ЛЯ > ЉА;
лЯ > љА;
Ля > Ља;
ля > ља;

ЛЁ > ЉО;
лЁ > љО;
Лё > Љо;
лё > љо;

Л [Ьь] > Љ;
л [Ьь] > љ;

НЮ > ЊУ;
нЮ > њУ;
Ню > Њу;
ню > њу;

НЯ > ЊА;
нЯ > њА;
Ня > Ња;
ня > ња;

НЁ > ЊО;
нЁ > њО;
Нё > Њо;
нё > њо;

Н [Ьь] > Њ;
н [Ьь] > њ;

ЖЁ > ЖО;
жЁ > жО;
Жё > Жо;
жё > жо;

ЧЁ > ЧО;
чЁ > чО;
Чё > Чо;
чё > чо;

ШЁ > ШО;
шЁ > шО;
Шё > Шо;
шё > шо;

ТЁ > ТО;
тЁ > тО;
Тё > То;
тё > то;

ДЁ > ДО;
дЁ > дО;
Дё > До;
дё > до;

ЬЕ > ЈЕ;
ьЕ > јЕ;
Ье > Је;
ье > је;

ЬИ > ЈИ;
ьИ > јИ;
Ьи > Ји;
ьи > ји;

ЬЯ > ЈА;
ьЯ > јА;
Ья > Ја;
ья > ја;

ЬЮ > ЈУ;
ьЮ > јУ;
Ью > Ју;
ью > ју;

ЬЁ > ЈО;
ьЁ > јО;
Ьё > Јо;
ьё > јо;

ЪЕ > ЈЕ;
ъЕ > јЕ;
Ъе > Је;
ъе > је;

ЪЯ > ЈА;
ъЯ > јА;
Ъя > Ја;
ъя > ја;

ЪЮ > ЈУ;
ъЮ > јУ;
Ъю > Ју;
ъю > ју;

ЪЁ > ЈО;
ъЁ > јО;
Ъё > Јо;
ъё > јо;

ЦКИЙ > ЦКИ;
Цкий > Цки;
цкий > цки;

ЦКАЯ > ЦКА;
Цкая > Цка;
цкая > цка;

СКИЙ > СКИ;
Ский > Ски;
ский > ски;

СКАЯ > СКА;
Ская > Ска;
ская > ска;

С [Сс] > С;
с [Сс] > с;

Н [Нн] > Н;
н [Нн] > н;

ЙЯ > ЈА;
йЯ > јА;
Йя > Ја;
йя > ја;

[:Lu:] { Щ > ШЧ;
Щ } [:Lu:] > ШЧ;
Щ > Шч;
щ > шч;

[:Lu:] { Ю > ЈУ;
Ю } [:Lu:] > ЈУ;
Ю > Ју;
ю > ју;

[:Lu:] { Я > ЈА;
Я } [:Lu:] > ЈА;
Я > Ја;
я > ја;

[:Lu:] { Ё > ЈО;
Ё } [:Lu:] > ЈО;
Ё > Јо;
ё > јо;

Э > Е;
э > е;

Ы > И;
ы > и;

Й > Ј;
й > ј;

[ЬьЪъ] > ;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

Л [јЈ] > Љ;
л [јЈ] > љ;
Н [јЈ] > Њ;
н [јЈ] > њ;
Д [зЗ] > Ѕ;
д [зЗ] > ѕ;
Д [жЖ] > Џ;
д [жЖ] > џ;

Ј [иИ] > И;
ј [иИ] > и;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { [јЈ] } [еЕоО] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] } [рР] > ;

[^[:L:][:M:]] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[^[:L:][:M:]] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [^[:L:][:M:]] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [^[:L:][:M:]] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
