export const ruUkRules = `
::NFC;

[:L:] { ([вВ] [иИ] [чЧ]) } [^[:L:][:M:]] > $1;

[:L:] { [ЕО] } [вВ] [нН] [аА] [^[:L:][:M:]] > І;
[:L:] { [ео] } [вВ] [нН] [аА] [^[:L:][:M:]] > і;

[:L:] [сц] { кий > ький;
[:L:] [СЦ] { КИЙ > ЬКИЙ;
[:L:] [сц] { кая > ька;
[:L:] [СЦ] { КАЯ > ЬКА;

сси > сі;
Сси > Сі;
ССИ > СІ;

[:L:] { ец } [^[:L:][:M:]] > ець;
[:L:] { Ец } [^[:L:][:M:]] > Ець;
[:L:] { ЕЦ } [^[:L:][:M:]] > ЕЦЬ;

[:L:] с { к } [^[:L:][:M:]] > ьк;
[:L:] С { К } [^[:L:][:M:]] > ЬК;

[ЖЦЧШЩжцчшщ] { Ё } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄІЇҐ] > О;
[ЖЦЧШЩжцчшщ] { Ё > о;
[ЖЦЧШЩжцчшщ] { ё > о;

[БВГДЖЗЙКЛМНПРСТФХЦЧШЩбвгджзйклмнпрстфхцчшщҐґ] { Ё } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄІЇҐ] > ЬО;
[БВГДЖЗЙКЛМНПРСТФХЦЧШЩбвгджзйклмнпрстфхцчшщҐґ] { Ё > Ьо;
[БВГДЖЗЙКЛМНПРСТФХЦЧШЩбвгджзйклмнпрстфхцчшщҐґ] { ё > ьо;

Ё } [АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄІЇҐ] > ЙО;
Ё > Йо;
ё > йо;

[БПВМФбпвмф] { Я > \\'Я;
[БПВМФбпвмф] { я > \\'я;
[БПВМФбпвмф] { Ю > \\'Ю;
[БПВМФбпвмф] { ю > \\'ю;

[АЕЁИОУЫЭЮЯаеёиоуыэюяЄІЇєії] { Е > Є;
[АЕЁИОУЫЭЮЯаеёиоуыэюяЄІЇєії] { е > є;
[ЬЪьъ'’‘\`´ʼ] { Е > Є;
[ЬЪьъ'’‘\`´ʼ] { е > є;
[^[:L:][:M:]] { Е > Є;
[^[:L:][:M:]] { е > є;

[АЕЁИОУЫЭЮЯаеёиоуыэюяЄІЇєії] { И > Ї;
[АЕЁИОУЫЭЮЯаеёиоуыэюяЄІЇєії] { и > ї;
[ЬЪьъ'’‘\`´ʼ] { И > Ї;
[ЬЪьъ'’‘\`´ʼ] { и > ї;
[ЖЦЧШЩжцчшщ] { И > И;
[ЖЦЧШЩжцчшщ] { и > и;
[ДТЗСЦЖШЧРдтзсцжшчр] { И > И;
[ДТЗСЦЖШЧРдтзсцжшчр] { и > и;
И > І;
и > і;

Ъ > ’;
ъ > ’;
Ы > И;
ы > и;
Э > Е;
э > е;

::Null;

[іІ] { а } [^[:L:][:M:]] > я;
[іІ] { А } [^[:L:][:M:]] > Я;

[іІ] { е > є;
[іІ] { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

Ш [чЧ] > Щ;
ш [чЧ] > щ;

[Йй] { [Йй]+ > ;

[БПВМФГҐКХРбпвмфгґкхр] { й [аА] > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { Й [аА] > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { й [еЕ] > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { Й [еЕ] > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { й [іІ] > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { Й [іІ] > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { й [уУ] > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { Й [уУ] > \\'Ю;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йа > ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йА > ьЯ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йа > Ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙА > ЬЯ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йе > ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йЕ > ьЄ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йе > Ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙЕ > ЬЄ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йі > ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йІ > ьЇ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йі > Ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙІ > ЬЇ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йу > ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йУ > ьЮ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йу > Ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙУ > ЬЮ;

й [аА] > я;
Й [аА] > Я;

й [еЕ] > є;
Й [еЕ] > Є;

й [іІ] > ї;
Й [іІ] > Ї;

й [уУ] > ю;
Й [уУ] > Ю;

::Null;

[^[:L:][:M:]] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[^[:L:][:M:]] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [^[:L:][:M:]] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[^ЖЧШЩЛРжчшщлр] [ЖЧШЩжчшщ] { я > а;
[^ЖЧШЩЛРжчшщлр] [ЖЧШЩжчшщ] { Я > А;
[^ЖЧШЩЛРжчшщлр] [ЖЧШЩжчшщ] { ю > у;
[^ЖЧШЩЛРжчшщлр] [ЖЧШЩжчшщ] { Ю > У;
[^ЖЧШЩЛРжчшщлр] [ЖЧШЩжчшщ] { є > е;
[^ЖЧШЩЛРжчшщлр] [ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { [ьЬ]+ } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюяЖЧШЩжчшщ] { [ьЬ]+ > ;
[^[:L:][:M:]] { [ьЬ]+ > ;
[ЬЪЙьъй] { [ЬЪьъ]+ > ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
