export const bnIpaRules = `
::NFC;

[।॥] > \\.;

::Null;

অ্যা > æ;
অ > ɔ;
আ > a;
ই > i;
ঈ > i;
উ > u;
ঊ > u;
ঋ > ri;
ৠ > ri;
ৡ > li;
ঌ > li;
এ > e;
ঐ > oi;
ও > o;
ঔ > ou;
ক > kɔ;
খ > kʰɔ;
গ > ɡɔ;
ঘ > ɡʱɔ;
ঙ > ŋɔ;
চ > tʃɔ;
ছ > tʃʰɔ;
জ > dʒɔ;
ঝ > dʒʱɔ;
ঞ > nɔ;
ট > ʈɔ;
ঠ > ʈʰɔ;
ড় > ɽɔ;
ঢ় > ɽʱɔ;
য় > jɔ;
ড > ɖɔ;
ঢ > ɖʱɔ;
ণ > nɔ;
ত > t̪ɔ;
থ > t̪ʰɔ;
দ > d̪ɔ;
ধ > d̪ʱɔ;
ন > nɔ;
প > pɔ;
ফ > pʰɔ;
ব > bɔ;
ভ > bʱɔ;
ম > mɔ;
্ { যা > æ;
্ { য > jɔ;
য > dʒɔ;
র > rɔ;
ল > lɔ;
শ > ʃɔ;
ষ > ʃɔ;
স > ʃɔ;
হ > hɔ;
ড় > ɽɔ;
ঢ় > ɽʱɔ;
য় > jɔ;
ৎ > t̪;
ং > ŋ;
ঃ > h;
ঁ > ̃;
় > ;
া > \\_a;
ি > \\_i;
ী > \\_i;
ু > \\_u;
ূ > \\_u;
ৃ > \\_ri;
ে > \\_e;
ৈ > \\_oi;
ো > \\_o;
ৌ > \\_ou;
ঽ > \\';

০ > 0;
১ > 1;
২ > 2;
৩ > 3;
৪ > 4;
৫ > 5;
৬ > 6;
৭ > 7;
৮ > 8;
৯ > 9;

::Null;

ɔ\\_ > ;
\\_ > ;
ɔ্ > ;
্ > ;

::Null;

ɔ } [eæ] > ;
[aeiouɔæ] [̃]? [kɡŋ{tʃ}{dʒ}ʈɖɽtdnpbmjrlʃh] [ʰʱ̪]* { ɔ } [^[:L:][:M:]] > ;

::Null;

[aeiouɔæ] [̃]? [kɡŋ{tʃ}{dʒ}ʈɖɽtdnpbmjrlʃh] [ʰʱ̪]* { ɔ } [kɡŋ{tʃ}{dʒ}ʈɖɽtdnpbmjrlʃh] [ʰʱ̪]* [aeiouɔæ] [̃]? > ;

::Null;

ɔ } ([kɡŋ{tʃ}{dʒ}ʈɖɽtdnpbmjrlʃh] [ʰʱ̪]*)+ [iu] > o;

::Null;

[:Bengali:] > ;
`;
