export const bnLatnRules = `
::NFC;

ওয় > w·;
[অআ] > a;
[ইঈ] > i;
[উঊ] > u;
ঋ > ri;
এ > e;
ঐ > oi;
ও > o;
ঔ > ou;
ক > k·;
খ > kh·;
গ > g·;
ঘ > gh·;
ঙ > ng·;
চ > č·;
ছ > čh·;
য় > y·;
ড় > r·;
ঢ় > rh·;
্যা > ্ä;
্য > ্y·;
[জয] > dž·;
ঝ > džh·;
ঞ > ń·;
[টত] > t·;
[ঠথ] > th·;
[ডদ] > d·;
[ঢধ] > dh·;
[ণন] > n·;
প > p·;
ফ > f·;
ব > b·;
ভ > v·;
ম > m·;
র > r·;
ল > l·;
[শষ] > š·;
স > s·;
হ > h·;
ৎ > t;
ং > ng;
ঃ > h;
ঁ > n;
ঽ > \\';

::Null;

· } [ািীুূৃেৈোৌ্] > ;
া > a;
[িী] > i;
[ুূ] > u;
ৃ > ri;
ে > e;
ৈ > oi;
ো > o;
ৌ > ou;
্ > ;

::Null;

· } [:^Letter:] > ;
· > a;

::Title;
`;
