export const tgLatnRules = `
::NFC;

[^[:L:][:M:]] { Е } [:Lu:] > YE;
[^[:L:][:M:]] { Е > Ye;
[^[:L:][:M:]] { е > ye;

[AÄEÏIÖOUÜŸY] { Е > YE;
[aäeïiöouüÿy\\'] { Е } [:Lu:] > YE;
[aäeïiöouüÿy\\'] { Е > Ye;
[AÄEÏIÖOUÜŸYaeiouöïäüÿy\\'] { е > ye;

[:Lu:] { Ё > YO;
Ё } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > YO;
Ё } [:Lu:] > YO;
Ё > Yo;
ё > yo;

[:Lu:] { Ю > YU;
Ю } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > YU;
Ю } [:Lu:] > YU;
Ю > Yu;
ю > yu;

[:Lu:] { Я > YA;
Я } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > YA;
Я } [:Lu:] > YA;
Я > Ya;
я > ya;

[nN] { Ғ > G;
[nN] { ғ > g;
[:Lu:] { Ғ > GH;
Ғ } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > GH;
Ғ } [:Lu:] > GH;
Ғ > Gh;
ғ > gh;

[:Lu:] { Ҷ > DŽ;
Ҷ } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > DŽ;
Ҷ } [:Lu:] > DŽ;
Ҷ > Dž;
ҷ > dž;

[:Lu:] { Ц > TS;
Ц } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > TS;
Ц } [:Lu:] > TS;
Ц > Ts;
ц > ts;

[:Lu:] { Щ > ŠČ;
Щ } ['’‘\`´ʼ-] [:Lu:] [:Lu:] > ŠČ;
Щ } [:Lu:] > ŠČ;
Щ > Šč;
щ > šč;

А > A;
а > a;

Б > B;
б > b;

В > V;
в > v;

Г > G;
г > g;

Д > D;
д > d;

[ЕЭ] > E;
[еэ] > e;

Ж > Ž;
ж > ž;

З > Z;
з > z;

[ИӢ] > I;
[иӣ] > i;

Й > Y;
й > y;

К > K;
к > k;

Қ > Q;
қ > q;

Л > L;
л > l;

М > M;
м > m;

Н > N;
н > n;

О > O;
о > o;

П > P;
п > p;

Р > R;
р > r;

С > S;
с > s;

Т > T;
т > t;

[УӮ] > U;
[уӯ] > u;

Ф > F;
ф > f;

Х > X;
х > x;

Ҳ > H;
ҳ > h;

Ч > Č;
ч > č;

Ш > Š;
ш > š;

Ы > Ï;
ы > ï;

[ЪЬъь] > \\';

::Null;

[:Cyrillic:] > ;
`;
