export const ukBgRules = `
Україна > Украйна;
УКРАЇНА > УКРАЙНА;
Київ > Киев;
КИЇВ > КИЕВ;

ґ > г;
Ґ > Г;
є > е;
Є > Е;
і > и;
І > И;
ї > и;
Ї > И;

Щ } [:Lu:] > ШЧ;
Щ > Шч;
щ > шч;

['’‘\`´ʼ] > ;

ьо > \uE000;
Ьо > \uE001;
ЬО > \uE002;
ьО > \uE003;

Ь > ;
ь > ;

::Null;

\uE000 > ьо;
\uE001 > Ьо;
\uE002 > ЬО;
\uE003 > ьО;

нн > н;
Нн > Н;
НН > Н;
жж > ж;
Жж > Ж;
ЖЖ > Ж;
сс > с;
Сс > С;
СС > С;
лл > л;
Лл > Л;
ЛЛ > Л;
чч > ч;
Чч > Ч;
ЧЧ > Ч;
тт > т;
Тт > Т;
ТТ > Т;
вв > в;
Вв > В;
ВВ > В;

ский > ски;
Ский > Ски;
СКИЙ > СКИ;
цкий > цки;
Цкий > Цки;
ЦКИЙ > ЦКИ;
зкий > зки;
Зкий > Зки;
ЗКИЙ > ЗКИ;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [Йй] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Фф] { [Фф] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [^бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [^бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;

::Null;

[йя] а > я;
[ЙЯ] а > Я;
[йя] А > Я;
[ЙЯ] А > Я;

[йю] у > ю;
[ЙЮ] у > Ю;
[йю] У > Ю;
[ЙЮ] У > Ю;

шт > щ;
Шт > Щ;
шТ > Щ;
ШТ > Щ;
`;
