export const ukBgRules = `
[уУ] [кК] [рР] [аА] { ї } [нН] [аА] > й;
[уУ] [кК] [рР] [аА] { Ї } [нН] [аА] > Й;
[кК] [иИ] { ї } [вВ] > е;
[кК] [иИ] { Ї } [вВ] > Е;

ґ > г;
Ґ > Г;

є > е;
Є > Е;

[ії] > и;
[ІЇ] > И;

[:Lu:] { Щ > ШЧ;
Щ } [:Lu:] > ШЧ;
Щ > Шч;
щ > шч;

['’‘\`´ʼ] > ;

ьо > \uE000;
Ьо > \uE001;
ЬО > \uE002;
ьО > \uE003;

[ьЬ] > ;

::Null;

\uE000 > ьо;
\uE001 > Ьо;
\uE002 > ЬО;
\uE003 > ьО;

[Нн] { [Нн] > ;
[Лл] { [Лл] > ;

[сзСЗ] [кК] [иИ] { [йЙ] > ;
[сзСЗ] [кК] [аА] { [яЯ] > ;
[цЦ] [кК] [иИ] { [йЙ] > ;
[цЦ] [кК] [аА] { [яЯ] > ;

::Null;

[Бб] { [Бб] > ;
[Вв] { [Вв] > ;
[Гг] { [Гг] > ;
[Жж] { [Жж] > ;
[Йй] { [ЙйьЬ] > ;
[Мм] { [Мм] > ;
[Пп] { [Пп] > ;
[Сс] { [Сс] > ;
[Тт] { [Тт] > ;
[Фф] { [Фф] > ;
[Хх] { [Хх] > ;
[Цц] { [Цц] > ;
[Чч] { [Чч] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ъъ] { [Ъъ] > ;
[Ьь] { [Ьь] > ;
[Юю] { [Юю] > ;
[Яя] { [Яя] > ;

::Null;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { й > и;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Й > И;
[аеиоуъюяАЕИОУЪЮЯ] { и } [еиоъЕИОЪ] > й;
[аеиоуъюяАЕИОУЪЮЯ] { И } [еиоъЕИОЪ] > Й;
[аеиоуъюяАЕИОУЪЮЯ] { и [аяАЯ] > я;
[аеиоуъюяАЕИОУЪЮЯ] { И [аяАЯ] > Я;
[аеиоуъюяАЕИОУЪЮЯ] { и [уюУЮ] > ю;
[аеиоуъюяАЕИОУЪЮЯ] { И [уюУЮ] > Ю;
[аеиоуъюяАЕИОУЪЮЯ] { ьо > йо;
[аеиоуъюяАЕИОУЪЮЯ] { ьО > йО;
[аеиоуъюяАЕИОУЪЮЯ] { Ьо > Йо;
[аеиоуъюяАЕИОУЪЮЯ] { ЬО > ЙО;
[аеиоуъюяАЕИОУЪЮЯ] { ье > йе;
[аеиоуъюяАЕИОУЪЮЯ] { ьЕ > йЕ;
[аеиоуъюяАЕИОУЪЮЯ] { Ье > Йе;
[аеиоуъюяАЕИОУЪЮЯ] { ЬЕ > ЙЕ;

[ьЬ] } [^[:L:][:M:]] > ;
[ьЬ] } [^оО] > ;

::Null;

[йя] [аА] > я;
[ЙЯ] [аА] > Я;

[йю] [уУ] > ю;
[ЙЮ] [уУ] > Ю;

ш [тТ] > щ;
Ш [тТ] > Щ;
`;
