export const ukIpaRules = `
::Lower;

дж > d͡ʒ;
дз > d͡z;
щ > ʃt͡ʃ;

п } [бгґджз] > b;
к } [бгґджз] > ɡ;
с } [бгґджз] > z;
т } [бгґджз] > d;
ф } [бгґджз] > v;
х } [бгґджз] > ɦ;
ц } [бгґджз] > d͡z;
ч } [бгґджз] > d͡ʒ;
ш } [бгґджз] > ʒ;

г } [к т] > x;

бб > bː;
вв > vː;
гг > ɦː;
ґґ > ɡː;
дд > dː;
жж > ʒː;
зз > zː;
кк > kː;
лл > lː;
мм > mː;
нн > nː;
пп > pː;
рр > rː;
сс > sː;
тт > tː;
фф > fː;
хх > xː;
цц > t͡sː;
чч > t͡ʃː;
шш > ʃː;

[дтзслнцв] { я > ʲa;
[дтзслнцв] { ю > ʲu;
[дтзслнцв] { є > ʲɛ;
[дтзслнцв] { і > ʲi;
[дтзслнцв] { ь > ʲ;

d͡z { я > ʲa;
d͡z { ю > ʲu;
d͡z { є > ʲɛ;
d͡z { і > ʲi;
d͡z { ь > ʲ;

[^[:L:][:M:]] { в } [^аеєиіїоуюя] > w;
в } [^аеєиіїоуюя] > w;
в } [^[:L:][:M:]] > w;

::Null;

я > ja;
ю > ju;
є > jɛ;
ї > ji;
і > i;
ь > ;
['’‘\`´ʼ] > ;

а > a;
б > b;
в > v;
г > ɦ;
ґ > ɡ;
д > d;
е > ɛ;
ж > ʒ;
з > z;
и > ɪ;
й > j;
к > k;
л > l;
м > m;
н > n;
о > ɔ;
п > p;
р > r;
с > s;
т > t;
у > u;
ф > f;
х > x;
ц > t͡s;
ч > t͡ʃ;
ш > ʃ;
`;
