export const ukMkRules = `
::NFC;

Київ > Киев;
КИЇВ > КИЕВ;
Львів > Лавов;
ЛЬВІВ > ЛАВОВ;
Харків > Харков;
ХАРКІВ > ХАРКОВ;
Дніпровськ > Днепровск;
ДНІПРОВСЬК > ДНЕПРОВСК;
Дніпро > Днепар;
ДНІПРО > ДНЕПАР;
Запоріжжя > Запорожје;
ЗАПОРІЖЖЯ > ЗАПОРОЖЈЕ;
Ріг > Рог;
РІГ > РОГ;
Вінниця > Виница;
ВІННИЦЯ > ВИНИЦА;
Чернівці > Черновци;
ЧЕРНІВЦІ > ЧЕРНОВЦИ;
Франківськ > Франковск;
ФРАНКІВСЬК > ФРАНКОВСК;
Тернопіль > Тернопол;
ТЕРНОПІЛЬ > ТЕРНОПОЛ;
Рівне > Ровно;
РІВНЕ > РОВНО;
Олена > Елена;
ОЛЕНА > ЕЛЕНА;
Андрій > Андреј;
АНДРІЙ > АНДРЕЈ;
Дмитро > Димитар;
ДМИТРО > ДИМИТАР;
Сергій > Сергеј;
СЕРГІЙ > СЕРГЕЈ;
Володимир > Владимир;
ВОЛОДИМИР > ВЛАДИМИР;
Тетяна > Татјана;
ТЕТЯНА > ТАТЈАНА;
Олександрович > Александрович;
ОЛЕКСАНДРОВИЧ > АЛЕКСАНДРОВИЧ;
Миколаївн > Николаевн;
МИКОЛАЇВН > НИКОЛАЕВН;
Миколайович > Николаевич;
МИКОЛАЙОВИЧ > НИКОЛАЕВИЧ;
Дмитрівн > Димитровн;
ДМИТРІВН > ДИМИТРОВН;
Україна > Украина;
УКРАЇНА > УКРАИНА;
Українськ > Украинск;
УКРАЇНСЬК > УКРАИНСК;
Полісся > Полесје;
ПОЛІССЯ > ПОЛЕСЈЕ;
Укрзалізниця > Укрзалезница;
УКРЗАЛІЗНИЦЯ > УКРЗАЛЕЗНИЦА;
Подільськ > Подолск;
ПОДІЛЬСЬК > ПОДОЛСК;

и [йЙ] > и;
И [йЙ] > И;

ій > еј;
Ій > Еј;
іЙ > еЈ;
ІЙ > ЕЈ;

юріївн > јуриевн;
Юріївн > Јуриевн;
ЮРІЇВН > ЈУРИЕВН;

іївн > еевн;
Іївн > Еевн;
ІЇВН > ЕЕВН;

і } [вВ] [нН] > о;
І } [вВ] [нН] > О;

ї } [вВ] [нН] > е;
Ї } [вВ] [нН] > Е;

йович > евич;
Йович > Евич;
ЙОВИЧ > ЕВИЧ;

льович > љевич;
Льович > Љевич;
ЛЬОВИЧ > ЉЕВИЧ;

іван > иван;
Іван > Иван;
ІВАН > ИВАН;

і } [вВ] > о;
І } [вВ] > О;

щина > штина;
Щина > Штина;
ЩИНА > ШТИНА;

Л [Ьь] > Љ;
л [Ьь] > љ;

Н [Ьь] > Њ;
н [Ьь] > њ;

ЛЄ > ЉЕ;
лЄ > љЕ;
Лє > Ље;
лє > ље;

ЛЮ > ЉУ;
лЮ > љУ;
Лю > Љу;
лю > љу;

ЛЯ > ЉА;
лЯ > љА;
Ля > Ља;
ля > ља;

НЄ > ЊЕ;
нЄ > њЕ;
Нє > Ње;
нє > ње;

НЮ > ЊУ;
нЮ > њУ;
Ню > Њу;
ню > њу;

НЯ > ЊА;
нЯ > њА;
Ня > Ња;
ня > ња;

Д [Жж] > Џ;
д [Жж] > џ;

Д [Зз] > Ѕ;
д [Зз] > ѕ;

ЬО > ЈО;
ьО > јО;
Ьо > Јо;
ьо > јо;

[Ьь ' \u2019 \u02BC \u0060] > ;

Ґ > Г;
ґ > г;

І > И;
і > и;

Й > Ј;
й > ј;

[:Lu:] { Є > ЈЕ;
Є } [:Lu:] > ЈЕ;
Є > Је;
є > је;

[:Lu:] { Ї > ЈИ;
Ї } [:Lu:] > ЈИ;
Ї > Ји;
ї > ји;

[:Lu:] { Ю > ЈУ;
Ю } [:Lu:] > ЈУ;
Ю > Ју;
ю > ју;

[:Lu:] { Я > ЈА;
Я } [:Lu:] > ЈА;
Я > Ја;
я > ја;

[:Lu:] { Щ > ШЧ;
Щ } [:Lu:] > ШЧ;
Щ > Шч;
щ > шч;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

Л [јЈ] > Љ;
л [јЈ] > љ;
Н [јЈ] > Њ;
н [јЈ] > њ;
Д [зЗ] > Ѕ;
д [зЗ] > ѕ;
Д [жЖ] > Џ;
д [жЖ] > џ;

Ј [иИ] > И;
ј [иИ] > и;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { [јЈ] } [еЕоО] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] } [рР] > ;

[^[:L:][:M:]] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[^[:L:][:M:]] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [^[:L:][:M:]] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [^[:L:][:M:]] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
