export const ukMkRules = `
Київ > Киев;
КИЇВ > КИЕВ;
Львів > Лавов;
ЛЬВІВ > ЛАВОВ;
Харків > Харков;
ХАРКІВ > ХАРКОВ;
Дніпровськ > Днепровск;
ДНІПРОВСЬК > ДНЕПРОВСК;
Дніпро > Днепар;
ДНІПРО > ДНЕПАР;
Запоріжжя > Запорожје;
ЗАПОРІЖЖЯ > ЗАПОРОЖЈЕ;
Ріг > Рог;
РІГ > РОГ;
Вінниця > Виница;
ВІННИЦЯ > ВИНИЦА;
Чернівці > Черновци;
ЧЕРНІВЦІ > ЧЕРНОВЦИ;
Франківськ > Франковск;
ФРАНКІВСЬК > ФРАНКОВСК;
Тернопіль > Тернопол;
ТЕРНОПІЛЬ > ТЕРНОПОЛ;
Рівне > Ровно;
РІВНЕ > РОВНО;
Олена > Елена;
ОЛЕНА > ЕЛЕНА;
Андрій > Андреј;
АНДРІЙ > АНДРЕЈ;
Дмитро > Димитар;
ДМИТРО > ДИМИТАР;
Сергій > Сергеј;
СЕРГІЙ > СЕРГЕЈ;
Володимир > Владимир;
ВОЛОДИМИР > ВЛАДИМИР;
Тетяна > Татјана;
ТЕТЯНА > ТАТЈАНА;
Олександрович > Александрович;
ОЛЕКСАНДРОВИЧ > АЛЕКСАНДРОВИЧ;
Миколаївн > Николаевн;
МИКОЛАЇВН > НИКОЛАЕВН;
Миколайович > Николаевич;
МИКОЛАЙОВИЧ > НИКОЛАЕВИЧ;
Дмитрівн > Димитровн;
ДМИТРІВН > ДИМИТРОВН;
Україна > Украина;
УКРАЇНА > УКРАИНА;
Українськ > Украинск;
УКРАЇНСЬК > УКРАИНСК;
Полісся > Полесје;
ПОЛІССЯ > ПОЛЕСЈЕ;
Укрзалізниця > Укрзалезница;
УКРЗАЛІЗНИЦЯ > УКРЗАЛЕЗНИЦА;
Подільськ > Подолск;
ПОДІЛЬСЬК > ПОДОЛСК;

ий > и;
Ий > И;
ИЙ > И;
ій > еј;
Ій > Еј;
ІЙ > ЕЈ;
Юріївн > Јуриевн;
ЮРІЇВН > ЈУРИЕВН;
іївн > еевн;
Іївн > Еевн;
ІЇВН > ЕЕВН;
івн > овн;
Івн > Овн;
ІВН > ОВН;
ївн > евн;
Ївн > Евн;
ЇВН > ЕВН;
йович > евич;
Йович > Евич;
ЙОВИЧ > ЕВИЧ;
льович > љевич;
Льович > Љевич;
ЛЬОВИЧ > ЉЕВИЧ;
Івано > Ивано;
ІВАНО > ИВАНО;
Іван > Иван;
ІВАН > ИВАН;
ів > ов;
Ів > Ов;
ІВ > ОВ;
щина > штина;
Щина > Штина;
ЩИНА > ШТИНА;

ЛЬ > Љ;
Ль > Љ;
ль > љ;

НЬ > Њ;
Нь > Њ;
нь > њ;

ЛЄ } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Ље;
ЛЄ > ЉЕ;
Лє > Ље;
лє > ље;

ЛЮ } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Љу;
ЛЮ > ЉУ;
Лю > Љу;
лю > љу;

ЛЯ } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Ља;
ЛЯ > ЉА;
Ля > Ља;
ля > ља;

НЄ } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Ње;
НЄ > ЊЕ;
Нє > Ње;
нє > ње;

НЮ } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Њу;
НЮ > ЊУ;
Ню > Њу;
ню > њу;

НЯ } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Ња;
НЯ > ЊА;
Ня > Ња;
ня > ња;

ДЖ > Џ;
Дж > Џ;
дж > џ;

ДЗ > Ѕ;
Дз > Ѕ;
дз > ѕ;

ЬО } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Јо;
ЬО > ЈО;
Ьо > Јо;
ьо > јо;

[Ьь ' \u2019 \u02BC \u0060] > ;

Ґ > Г;
ґ > г;

І > И;
і > и;

Й > Ј;
й > ј;

Є } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Је;
Є > ЈЕ;
є > је;

Ї } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Ји;
Ї > ЈИ;
ї > ји;

Ю } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Ју;
Ю > ЈУ;
ю > ју;

Я } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Ја;
Я > ЈА;
я > ја;

Щ } [абвгґдеєжзиіїйклмнопрстуфхцчшщьюя] > Шч;
Щ > ШЧ;
щ > шч;

::Null;

[аА] { [аА] > ;
[бБ] { [бБ] > ;
[вВ] { [вВ] > ;
[гГ] { [гГ] > ;
[дД] { [дД] > ;
[ѓЃ] { [ѓЃ] > ;
[еЕ] { [еЕ] > ;
[жЖ] { [жЖ] > ;
[зЗ] { [зЗ] > ;
[ѕЅ] { [ѕЅ] > ;
[иИ] { [иИ] > ;
[јЈ] { [јЈ] > ;
[кК] { [кК] > ;
[лЛ] { [лЛ] > ;
[љЉ] { [љЉ] > ;
[мМ] { [мМ] > ;
[нН] { [нН] > ;
[њЊ] { [њЊ] > ;
[оО] { [оО] > ;
[пП] { [пП] > ;
[рР] { [рР] > ;
[сС] { [сС] > ;
[тТ] { [тТ] > ;
[ќЌ] { [ќЌ] > ;
[уУ] { [уУ] > ;
[фФ] { [фФ] > ;
[хХ] { [хХ] > ;
[цЦ] { [цЦ] > ;
[чЧ] { [чЧ] > ;
[џЏ] { [џЏ] > ;
[шШ] { [шШ] > ;

::Null;

лј > љ;
Лј > Љ;
ЛЈ > Љ;
лЈ > љ;
нј > њ;
Нј > Њ;
НЈ > Њ;
нЈ > њ;
дз > ѕ;
Дз > Ѕ;
ДЗ > Ѕ;
дЗ > ѕ;
дж > џ;
Дж > Џ;
ДЖ > Џ;
дЖ > џ;

Ји > И;
ЈИ > И;
ји > и;
јИ > И;

Иа > Ија;
ИА > ИЈА;
иа > ија;
иА > иЈА;

[АЕИОУаеиоу] { ј } [еЕоО] > ;
[АЕИОУаеиоу] { Ј } [еЕоО] > ;

[^[:L:][:M:]] { ['’‘\`´ʼ] } [рР] > ;

[^[:L:][:M:]] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[^[:L:][:M:]] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > и;
[бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] { Ј } [бвгдѓжзѕјклљмнњпрстќфхцчџшБВГДЃЖЗЅЈКЛЉМНЊПРСТЌФХЦЧЏШ] > И;
`;
