export const ukRuRules = `
::NFC;

[:L:] { ([вВ] [иИ] [чЧ]) } [^[:L:][:M:]] > $1;

[:L:] [сС] { [ьЬ] } [кК] [иИ] [йЙ] [^[:L:][:M:]] > ;

[:L:] { ська } [^[:L:][:M:]] > ская;
[:L:] { Ська } [^[:L:][:M:]] > Ская;
[:L:] { СЬКА } [^[:L:][:M:]] > СКАЯ;

[:L:] { ські } [^[:L:][:M:]] > ские;
[:L:] { Ські } [^[:L:][:M:]] > Ские;
[:L:] { СЬКІ } [^[:L:][:M:]] > СКИЕ;

[:L:] { цька } [^[:L:][:M:]] > цкая;
[:L:] { Цька } [^[:L:][:M:]] > Цкая;
[:L:] { ЦЬКА } [^[:L:][:M:]] > ЦКАЯ;

[:L:] [цЦ] { [ьЬ] } [кК] > ;

[:L:] [еЕ] [цЦ] { [ьЬ] } [^[:L:][:M:]] > ;

Ь [оО] > Ё;
ь [оО] > ё;

Й [оО] > Ё;
й [оО] > ё;

Ґ > Г;
ґ > г;

[ЕЄ] > Е;
[еє] > е;

[ЖШЧЩГКХПБВМФжшчщгкхпбвмф] { И > И;
[ЖШЧЩГКХПБВМФжшчщгкхпбвмф] { и > и;
И > Ы;
и > ы;

[ІЇ] > И;
[ії] > и;

['’‘\`´ʼ] } [:Lu:] > Ъ;
[:Lu:] { ['’‘\`´ʼ] > Ъ;
['’‘\`´ʼ] > ъ;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[лЛ] { л } [^[:L:][:M:]] > ль;
[лЛ] { Л } [^[:L:][:M:]] > ЛЬ;
[лЛ] { л } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > ль;
[лЛ] { Л } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > ЛЬ;

[Ёё] { [Ёё]+ > ;
[Йй] { [Йй]+ > ;
[Хх] { [Хх]+ > ;
[Шш] { [Шш]+ > ;
[Щщ] { [Щщ]+ > ;
[Ыы] { [Ыы]+ > ;
[ьъЬЪйЙ] { [ьъЬЪ]+ > ;

::Null;

[щЩъЪыЫьЬ] { [ий] [аА] > я;
[щЩъЪыЫьЬ] { [ИЙ] [аА] > Я;
[щЩъЪыЫьЬ] { [ий] [оО] > ё;
[щЩъЪыЫьЬ] { [ИЙ] [оО] > Ё;
[щЩъЪыЫьЬ] { [ий] [еЕ] > е;
[щЩъЪыЫьЬ] { [ИЙ] [еЕ] > Е;
[щЩъЪыЫьЬ] { [ий] [уУ] > ю;
[щЩъЪыЫьЬ] { [ИЙ] [уУ] > Ю;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йа > ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йА > ьЯ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йа > Ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙА > ЬЯ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йо > ьо;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йО > ьО;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йо > Ьо;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙО > ЬО;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йё > ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЁ > ьЁ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йё > Ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЁ > ЬЁ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йе > ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЕ > ьЕ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йе > Ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЕ > ЬЕ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йу > ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йУ > ьЮ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йу > Ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙУ > ЬЮ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йи > ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йИ > ьИ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йи > Ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙИ > ЬИ;

й [иИ] > и;
Й [иИ] > И;

::Null;

[:L:]+ [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] [иИ] { а } [^[:L:][:M:]] > я;
[:L:]+ [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] [иИ] { А } [^[:L:][:M:]] > Я;

[^[:L:][:M:]] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[^[:L:][:M:]] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [^[:L:][:M:]] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [^[:L:][:M:]] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[аоэыиеёюяАОЭЫИЕЁЮЯ] { и } [^[:L:][:M:]] > й;
[аоэыиеёюяАОЭЫИЕЁЮЯ] { И } [^[:L:][:M:]] > Й;

::Null;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ]+ } [бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] > ;
[ъЪ]+ } [^[:L:][:M:]] > ;
[ъЪ]+ } [аоуэыиАОУЭЫИ] > ;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { [ъЪ]+ > ;
[^[:L:][:M:]] { [ъЪьЬ]+ > ;
[ьъЬЪйЙ] { [ьъЬЪ]+ > ;
`;
