export const bgIpaRules = `
::Lower;

б } [пфктшсцчщ] > п;
в } [пфктшсцчщ] > ф;
г } [пфктшсцчщ] > к;
д } [пфктшсцчщ] > т;
ж } [пфктшсцчщ] > ш;
з } [пфктшсцчщ] > с;

п } [бгджз] > б;
ф } [бгджз] > в;
к } [бгджз] > г;
т } [бгджз] > д;
ш } [бгджз] > ж;
с } [бгджз] > з;

б } [^[:L:][:M:]] > п;
в } [^[:L:][:M:]] > ф;
г } [^[:L:][:M:]] > к;
д } [^[:L:][:M:]] > т;
ж } [^[:L:][:M:]] > ш;
з } [^[:L:][:M:]] > с;

::Null;

щ > ʃt;
ч > t͡ʃ;
ц > t͡s;
дж > d͡ʒ;
дз > d͡z;

[бвгдзклмнпрстфх] { я > ʲa;
[бвгдзклмнпрстфх] { ю > ʲu;
ь о > ʲo;
я > ja;
ю > ju;

л } [еи] > l;

а > a;
б > b;
в > v;
г > ɡ;
д > d;
е > ɛ;
ж > ʒ;
з > z;
и > i;
й > j;
к > k;
л > ɫ;
м > m;
н > n;
о > ɔ;
п > p;
р > r;
с > s;
т > t;
у > u;
ф > f;
х > x;
ш > ʃ;
ъ > ɤ;
ь > ʲ;
`;
