export const bgRuRules = `
[:^Letter:] { е > э;
[:^Letter:] { Е > Э;

[бБ] { ъ } [лЛ] [гГ] [аА] [рР] > о;
[бБ] { Ъ } [лЛ] [гГ] [аА] [рР] > О;
[пП] { ъ } [рР] [вВ] > е;
[пП] { Ъ } [рР] [вВ] > Е;
[сС] { ъ } [рР] [бБ] > е;
[сС] { Ъ } [рР] [бБ] > Е;
[вВ] { ъ } [зЗ] > о;
[вВ] { Ъ } [зЗ] > О;
[сС] { ъ > о;
[сС] { Ъ > О;

[бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [рлРЛ] [:^Letter:] > ;
[бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [:^Letter:] > ;

[:^Letter:] { ъ > и;
[:^Letter:] { Ъ > И;

[жшчцЖШЧЦ] { ъ > е;
[жшчцЖШЧЦ] { Ъ > Е;

ъ > ы;
Ъ > Ы;

[бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] { йо > ё;
[бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] { Йо > Ё;
[бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] { ЙО > Ё;

ьо > ё;
Ьо > Ё;
ЬО > Ё;

Щ } [:Ll:] > Шт;
Щ > ШТ;
щ > шт;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[Ёё] { [Ёё] > ;
[Йй] { [Йй] > ;
[Хх] { [Хх] > ;
[Шш] { [Шш] > ;
[Щщ] { [Щщ] > ;
[Ыы] { [Ыы] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;

::Null;

[щЩъЪыЫьЬ] { [ий] [аА] > я;
[щЩъЪыЫьЬ] { [ИЙ] [аА] > Я;
[щЩъЪыЫьЬ] { [ий] [оО] > ё;
[щЩъЪыЫьЬ] { [ИЙ] [оО] > Ё;
[щЩъЪыЫьЬ] { [ий] [еЕ] > е;
[щЩъЪыЫьЬ] { [ИЙ] [еЕ] > Е;
[щЩъЪыЫьЬ] { [ий] [уУ] > ю;
[щЩъЪыЫьЬ] { [ИЙ] [уУ] > Ю;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йа > ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йА > ьЯ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йа > Ья;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙА > ЬЯ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йо > ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йО > ьЁ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йо > Ьё;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙО > ЬЁ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йе > ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЕ > ьЕ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йе > Ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЕ > ЬЕ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йу > ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йУ > ьЮ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йу > Ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙУ > ЬЮ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йи > ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йИ > ьИ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йи > Ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙИ > ЬИ;

й [иИ] > и;
Й [иИ] > И;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [:^Letter:] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [:^Letter:] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { и } [:^Letter:] > й;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { И } [:^Letter:] > Й;

::Null;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] > ;
[ъЪ] } [:^Letter:] > ;
[ъЪ] } [аоуэыиАОУЭЫИ] > ;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { [ъЪ] > ;
[:^Letter:] { [ъЪьЬ] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
