export const bgUkRules = `
::NFC;

с } к [аАиИ] > сь;
С } К [аАиИ] > СЬ;
С } к [аАиИ] > Сь;

[аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] { е > є;
[аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] { Е > Є;
[аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] { и > ї;
[аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] { И > Ї;
и } [аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] > і;
И } [аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] > І;
и } й > і;
И } й > І;
и } Й > і;
И } Й > І;
[^[:L:][:M:]] { и > і;
[^[:L:][:M:]] { И > І;
[бпвмфгкхлнБПВМФГКХЛН] { и > і;
[бпвмфгкхлнБПВМФГКХЛН] { И > І;

ъ > и;
Ъ > И;

::Null;

[іІ] { а } [^[:L:][:M:]] > я;
[іІ] { А } [^[:L:][:M:]] > Я;

[іІ] { е > є;
[іІ] { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

Ш [чЧ] > Щ;
ш [чЧ] > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { й [аА] > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { Й [аА] > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { й [еЕ] > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { Й [еЕ] > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { й [іІ] > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { Й [іІ] > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { й [уУ] > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { Й [уУ] > \\'Ю;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йа > ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йА > ьЯ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йа > Ья;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙА > ЬЯ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йе > ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йЕ > ьЄ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йе > Ьє;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙЕ > ЬЄ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йі > ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йІ > ьЇ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йі > Ьї;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙІ > ЬЇ;

[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йу > ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { йУ > ьЮ;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { Йу > Ью;
[ДЖЗЛНСТЦЧШЩджзлнстцчшщ] { ЙУ > ЬЮ;

й [аА] > я;
Й [аА] > Я;

й [еЕ] > є;
Й [еЕ] > Є;

й [іІ] > ї;
Й [іІ] > Ї;

й [уУ] > ю;
Й [уУ] > Ю;

::Null;

[^[:L:][:M:]] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[^[:L:][:M:]] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [^[:L:][:M:]] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { [ьЬ] } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюяЖЧШЩжчшщ] { [ьЬ] > ;
[^[:L:][:M:]] { [ьЬ] > ;
[ЬЪЙьъй] { [ЬЪьъ] > ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
