export const bgUkRules = `
с } к [аАиИ] > сь;
С } К [аАиИ] > СЬ;
С } к [аАиИ] > Сь;

[аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] { е > є;
[аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] { Е > Є;
[аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] { и > ї;
[аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] { И > Ї;
и } [аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] > і;
И } [аеєиіїоуъюяАЕЄИІЇОУЪЮЯ] > І;
и } й > і;
И } й > І;
и } Й > і;
И } Й > І;
[^[:L:][:M:]] { и > і;
[^[:L:][:M:]] { И > І;
[бпвмфгкхлнБПВМФГКХЛН] { и > і;
[бпвмфгкхлнБПВМФГКХЛН] { И > І;

ъ > и;
Ъ > И;

::Null;

і { а } [^[:L:][:M:]] > я;
І { а } [^[:L:][:M:]] > я;
і { А } [^[:L:][:M:]] > Я;
І { А } [^[:L:][:M:]] > Я;

і { е > є;
І { е > є;
і { Е > Є;
І { Е > Є;

[АЕЄИІЇОУЮЯаеєиіїоуюя] { і > ї;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { І > Ї;

ШЧ > Щ;
Шч > Щ;
шЧ > щ;
шч > щ;

[Йй] { [Йй] > ;

[БПВМФГҐКХРбпвмфгґкхр] { йа > \\'я;
[БПВМФГҐКХРбпвмфгґкхр] { йА > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { Йа > \\'Я;
[БПВМФГҐКХРбпвмфгґкхр] { ЙА > \\'Я;

[БПВМФГҐКХРбпвмфгґкхр] { йе > \\'є;
[БПВМФГҐКХРбпвмфгґкхр] { йЕ > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { Йе > \\'Є;
[БПВМФГҐКХРбпвмфгґкхр] { ЙЕ > \\'Є;

[БПВМФГҐКХРбпвмфгґкхр] { йі > \\'ї;
[БПВМФГҐКХРбпвмфгґкхр] { йІ > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { Йі > \\'Ї;
[БПВМФГҐКХРбпвмфгґкхр] { ЙІ > \\'Ї;

[БПВМФГҐКХРбпвмфгґкхр] { йу > \\'ю;
[БПВМФГҐКХРбпвмфгґкхр] { йУ > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { Йу > \\'Ю;
[БПВМФГҐКХРбпвмфгґкхр] { ЙУ > \\'Ю;

йа > я;
йА > Я;
Йа > Я;
ЙА > Я;

йе > є;
йЕ > Є;
Йе > Є;
ЙЕ > Є;

йі > ї;
йІ > Ї;
Йі > Ї;
ЙІ > Ї;

йу > ю;
йУ > Ю;
Йу > Ю;
ЙУ > Ю;

::Null;

[^[:L:][:M:]] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[^[:L:][:M:]] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [^[:L:][:M:]] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [^[:L:][:M:]] > І;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > і;
[БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] { Й } [БВГҐДЖЗКЛМНПРСТФХЦЧШЩбвгґджзклмнпрстфхцчшщ] > І;

::Null;

[ЖЧШЩжчшщ] { я > а;
[ЖЧШЩжчшщ] { Я > А;
[ЖЧШЩжчшщ] { ю > у;
[ЖЧШЩжчшщ] { Ю > У;
[ЖЧШЩжчшщ] { є > е;
[ЖЧШЩжчшщ] { Є > Е;

[БПВМФГҐКХРбпвмфгґкхр] { ь } [ЯЮЄЇяюєї] > \\';
[БПВМФГҐКХРбпвмфгґкхр] { Ь } [ЯЮЄЇяюєї] > \\';

[АЕЄИІЇОУЮЯаеєиіїоуюя] { ь > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { Ь > ;
[^[:L:][:M:]] { ь > ;
[^[:L:][:M:]] { Ь > ;
[ЖЧШЩжчшщ] { ь > ;
[ЖЧШЩжчшщ] { Ь > ;
[Ьь] } [Ьь] > ;

[^[:L:][:M:]] { \\' > ;
\\' } [^[:L:][:M:]] > ;
[АЕЄИІЇОУЮЯаеєиіїоуюя] { \\' > ;
\\' { [Ьь] > ;
[Ьь] } \\' > ;
\\' { \\' > ;
`;
