export { supportedLanguages } from "languages";
export { Language } from "types/languages";
export { transliterate } from "transliterate";

// *** EXPERIMENTS ***

import { transliterate } from "transliterate";
import { RBT } from "icu-transliterator";
import { ipaArRules } from "constants/ipa-ar.rules";
const test = async () => {
  // console.log(
  //   await transliterate(
  //     "София, Пловдив, Варна, Бургас, Русе, Стара Загора, Плевен, Сливен, Добрич, Шумен, Перник, Ямбол, Хасково, Пазарджик, Благоевград, Велико Търново, Габрово, Видин, Монтана, Разград, Иван Петров Георгиев, Мария Иванова Димитрова, Георги Стоянов Николов, Елена Петрова Василева, Димитър Христов Иванов, Анна Тодорова Костова, Никола Александров Петров, Катерина Стефанова Илиева, Христо Михайлов Георгиев, Светлана Бориславова Попова, Петър Владимиров Ангелов, Даниела Атанасова Маринова, Александър Костадинов Павлов, Виолета Емилова Симеонова, Боян Красимиров Иванов, Мариана Николова Петрова, Стефан Димитров Георгиев, Цветелина Иванова Стоянова, Кирил Петров Василев, Десислава Георгиева Михайлова, Пловдивска Стара Планина, Варненска Корабостроителна Компания, Софийски Технологични Решения, Бургаска Нефтена Рафинерия, Русенска Дунавска Логистика, Великотърновски Исторически Турове, Пловдивска Електроника, Софийски Млечни Продукти, Варненски Морски Транспорт, Старозагорски Винопроизводители, Габровски Текстилни Фабрики, Плевенски Машиностроителни Работилници, Благоевградска Тютюнева Компания, Шуменска Пивоварна, Добричка Земеделска Техника, Хасковска Розоварна, Ямболска Зърнопреработвателна, Пернишка Металообработваща, Монтанска Строителна Материали, Разградски Торов Завод, Сливенски Килимарски Производители",
  //     { input: "bg", output: "uk" },
  //   ),
  // );

  const transliterator = RBT.fromRules(ipaArRules);
  console.log(
    transliterator.transliterate(`
`),
  );
};
test();
