export { scripts, languages } from "helpers/constants";
export { Script, Language } from "types";
export { transliterate } from "transliterate";

// *** EXPERIMENTS ***

import { transliterate } from "transliterate";
const test = async () => {
  console.log(
    await transliterate(
      "दिल्ली, मुंबई, कोलकाता, चेन्नई, बेंगलुरु, हैदराबाद, अहमदाबाद, पुणे, जयपुर, लखनऊ, कानपुर, नागपुर, इंदौर, भोपाल, विशाखापत्तनम, पटना, लुधियाना, आगरा, वाराणसी, अमृतसर, राहुल कुमार शर्मा, प्रिया सिंह यादव, अमित पटेल जोशी, स्नेहा गुप्ता वर्मा, विकास मिश्रा तिवारी, नेहा कुमारी चौहान, रोहन दास गुप्ता, आकांक्षा राय सिन्हा, सौरभ मेहता अग्रवाल, काव्या शर्मा कपूर, अर्जुन यादव ठाकुर, रिया खन्ना मलिक, कृष्णा प्रसाद त्रिपाठी, माया देवी चौधरी, सिद्धार्थ नायक राव, अनन्या पांडे शाह, विवेक भारद्वाज सक्सेना, दीक्षा जैन गोयल, अभिषेक रस्तोगी गर्ग, सारा खान शेख, टाटा संस, रिलायंस इंडस्ट्रीज, इन्फोसिस लिमिटेड, एचसीएल टेक्नोलॉजीज, विप्रो लिमिटेड, भारती एयरटेल, एचडीएफसी बैंक, आइसीआइसीआइ बैंक, स्टेट बैंक ऑफ इंडिया, लार्सन एंड टुब्रो, महिंद्रा एंड महिंद्रा, आदित्य बिरला ग्रुप, वेदांता लिमिटेड, सन फार्मास्यूटिकल्स, डॉ रेड्डीज लैबोरेटरीज, टाइटन कंपनी, हिंदुस्तान यूनिलीवर, नेस्ले इंडिया, आइटीसी लिमिटेड, बजाज ऑटो, कोलगेट पाल्मोलिव इंडिया, ब्रिटानिया इंडस्ट्रीज, डाबर इंडिया, गोडरेज कंज्यूमर प्रोडक्ट्स",
      { from: "hi", to: "fr" },
    ),
  );
};
test();
