export { supportedLanguages } from "languages";
export { Language } from "types/languages";
export { transliterate } from "transliterate";

// *** EXPERIMENTS ***

import { transliterate } from "transliterate";
import { RBT } from "icu-transliterator";
import { elLatnRules } from "constants/el-latn.rules";
const test = async () => {
  // console.log(
  //   await transliterate(
  //     `Αθήνα, Θεσσαλονίκη, Πάτρα, Ηράκλειο, Λάρισα, Βόλος, Ιωάννινα, Καλαμάτα, Χανιά, Ρόδος, Κέρκυρα, Μύκονος, Θήρα, Κρήτη, Μακεδονία, Πελοπόννησος, Όλυμπος, Σπάρτη, Δελφοί, Μυκήνες, Ιωάννης Γεώργιος Παπαδόπουλος, Μαρία Ελένη Παπαδοπούλου, Νικόλαος Δημήτριος Καραγιάννης, Αικατερίνη Χριστίνα Κωνσταντίνου, Γεώργιος Αντώνιος Στεφανίδης, Ελένη Βασιλική Παπαδοπούλου, Δημήτριος Ιωάννης Ανδρέου, Σοφία Γεωργία Λαμπράκη, Χριστίνα Παυλίνα Δημητρίου, Αντώνιος Μιχαήλ Κυριακίδης, Άννα Κωνσταντίνα Βασιλείου, Κωνσταντίνος Σταύρος Παπακωνσταντίνου, Βασιλική Ιωάννα Μιχαηλίδου, Πέτρος Αθανάσιος Γεωργιάδης, Φωτεινή Νικολέτα Παναγιώτου, Σταύρος Δημήτριος Λαζαρίδης, Αθανασία Μαρία Καραγιάννη, Μιχαήλ Παύλος Χατζηδάκης, Ειρήνη Αντωνία Σταματίου, Αλέξανδρος Γεώργιος Αλεξάνδρου, Εθνική Τράπεζα της Ελλάδος, Τράπεζα Πειραιώς, Ελληνικά Πετρέλαια, Δημόσια Επιχείρηση Ηλεκτρισμού, Οργανισμός Τηλεπικοινωνιών Ελλάδος, Ελληνική Εταιρεία Αεροπορικών Μεταφορών, Εταιρεία Ύδρευσης και Αποχέτευσης Αθηνών, Εθνική Ασφαλιστική Εταιρεία, Ελληνική Εταιρεία Φυσικού Αερίου, Οργανισμός Λιμένων Πειραιώς, Ελληνική Βιομηχανία Τροφίμων και Ποτών, Εταιρεία Παραγωγής και Εμπορίας Φαρμάκων, Τράπεζα Αττικής, Εθνική Εταιρεία Κατασκευής Αυτοκινήτων, Οργανισμός Σιδηροδρόμων Ελλάδος, Εταιρεία Ανάπτυξης Τεχνολογίας Πληροφορικής, Ασφαλιστική Εταιρεία Ευρώπη, Βιομηχανική Εταιρεία Επεξεργασίας Μετάλλων, Ελληνική Εταιρεία Ναυτιλίας και Μεταφορών, Εθνική Εταιρεία Ανανεώσιμων Πηγών Ενέργειας
  // `,
  //     { from: "el", to: "en" },
  //   ),
  // );
  console.log(
    RBT.fromRules(elLatnRules)
      .transliterate(`Αθήνα, Θεσσαλονίκη, Πάτρα, Ηράκλειο, Λάρισα, Βόλος, Ιωάννινα, Καλαμάτα, Χανιά, Ρόδος, Κέρκυρα, Μύκονος, Θήρα, Κρήτη, Μακεδονία, Πελοπόννησος, Όλυμπος, Σπάρτη, Δελφοί, Μυκήνες, Ιωάννης Γεώργιος Παπαδόπουλος, Μαρία Ελένη Παπαδοπούλου, Νικόλαος Δημήτριος Καραγιάννης, Αικατερίνη Χριστίνα Κωνσταντίνου, Γεώργιος Αντώνιος Στεφανίδης, Ελένη Βασιλική Παπαδοπούλου, Δημήτριος Ιωάννης Ανδρέου, Σοφία Γεωργία Λαμπράκη, Χριστίνα Παυλίνα Δημητρίου, Αντώνιος Μιχαήλ Κυριακίδης, Άννα Κωνσταντίνα Βασιλείου, Κωνσταντίνος Σταύρος Παπακωνσταντίνου, Βασιλική Ιωάννα Μιχαηλίδου, Πέτρος Αθανάσιος Γεωργιάδης, Φωτεινή Νικολέτα Παναγιώτου, Σταύρος Δημήτριος Λαζαρίδης, Αθανασία Μαρία Καραγιάννη, Μιχαήλ Παύλος Χατζηδάκης, Ειρήνη Αντωνία Σταματίου, Αλέξανδρος Γεώργιος Αλεξάνδρου, Εθνική Τράπεζα της Ελλάδος, Τράπεζα Πειραιώς, Ελληνικά Πετρέλαια, Δημόσια Επιχείρηση Ηλεκτρισμού, Οργανισμός Τηλεπικοινωνιών Ελλάδος, Ελληνική Εταιρεία Αεροπορικών Μεταφορών, Εταιρεία Ύδρευσης και Αποχέτευσης Αθηνών, Εθνική Ασφαλιστική Εταιρεία, Ελληνική Εταιρεία Φυσικού Αερίου, Οργανισμός Λιμένων Πειραιώς, Ελληνική Βιομηχανία Τροφίμων και Ποτών, Εταιρεία Παραγωγής και Εμπορίας Φαρμάκων, Τράπεζα Αττικής, Εθνική Εταιρεία Κατασκευής Αυτοκινήτων, Οργανισμός Σιδηροδρόμων Ελλάδος, Εταιρεία Ανάπτυξης Τεχνολογίας Πληροφορικής, Ασφαλιστική Εταιρεία Ευρώπη, Βιομηχανική Εταιρεία Επεξεργασίας Μετάλλων, Ελληνική Εταιρεία Ναυτιλίας και Μεταφορών, Εθνική Εταιρεία Ανανεώσιμων Πηγών Ενέργειας
`),
  );
};
test();
