export { supportedLanguages } from "helpers/languages";
export { Language } from "types";
export { transliterate } from "transliterate";

// *** EXPERIMENTS ***

import { transliterate } from "transliterate";
const test = async () => {
  console.log(
    await transliterate(
      "Արարատ, Գեղամա, Դեբեդ, Եղեգնաձոր, Զանգեզուր, Էջմիածին, Թալին, Ժայռավան, Իջևան, Լոռի, Խոսրով, Ծաղկաձոր, Կապան, Հրազդան, Ձորագետ, Ղափան, Մարտունի, Յոթնաղբյուր, Նոյեմբերյան, Շիրակ, Արամ Վարդանի Կարապետյան, Բագրատ Հակոբի Սարգսյան, Գայանե Արմենի Մնացականյան, Դավիթ Ռոբերտի Ավետիսյան, Ելենա Սուրենի Գրիգորյան, Զավեն Գուրգենի Մարտիրոսյան, Էդուարդ Միքայելի Դանիելյան, Թամարա Լևոնի Բաղդասարյան, Իշխան Սամվելի Պողոսյան, Լուսինե Կարենի Հարությունյան, Խաչիկ Աշոտի Մելքոնյան, Ծովինար Տիգրանի Նազարյան, Կորյուն Էրիկի Մանուկյան, Հասմիկ Պարույրի Թովմասյան, Ձոնիկ Վազգենի Ստեփանյան, Ղուկաս Արտակի Պետրոսյան, Մարիամ Սևակի Ալեքսանյան, Նարեկ Ֆելիքսի Գևորգյան, Շանթ Ռազմիկի Խաչատրյան, Ոսկան Մայիսի Ենոքյան, Հայաստան Էլեկտրոնիկս, Ծիրան Հրատարակչություն, Արևային Տեխնոլոգիաներ, Լուսին Շինարարություն, Ոսկե Վազ Գինեգործարան, Բարձրավոլտ Ցանցեր, Կանաչ Աշխարհ, Փյունիկ Տեքստիլ, Ադամանդ Ոսկերչական Տուն, Սևան Ձկնաբուծարան, Արագած Տրանսպորտ, Մայր Հող Գյուղատնտեսություն, Անի Հյուրանոցային Համալիր, Տիգրան Մեծ Տպագրատուն, Էրեբունի Բժշկական Կենտրոն, Մուրացան Դեղատուն, Հյուսիսային Պողոտա Ռիելթի, Գառնի Կաթնամթերք, Վարդանանց Առողջապահություն, Զանգակ Գրատուն",
      { from: "hy", to: "ka" },
    ),
  );
  //
  // console.log(
  //   checkAllSymbolsToBePresentInString(
  //     "abcdefghijklmnopqrstuvwxyzâæçêðôõøăčďęħĩŋœťũžơưɐɑɒɓɔɕɖɗɘəɚɛɜɝɟɡɢɣɤɥɦɧɨɪɫɭɯɱɲɳɵɹɽɾʀʁʂʃʈʉʊʋʌʎʏʐʑʒʔʕʝʰʱʲʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡βθχẽ",
  //     ``,
  //   ),
  // );
};
test();
