export { scripts, languages } from "helpers/constants";
export { Script, Language } from "types";
export { transliterate } from "transliterate";

// *** EXPERIMENTS ***

import { transliterate } from "transliterate";
const test = async () => {
  console.log(
    await transliterate(
      "ירושלים, תל אביב יפו, חיפה, באר שבע, נצרת, טבריה, צפת, אילת, ראשון לציון, פתח תקווה, אשדוד, נתניה, חולון, בני ברק, רמת גן, הרצליה, כפר סבא, מודיעין מכבים רעות, בית שמש, מעלה אדומים, אברהם יצחק כהן, שרה רבקה לוי, דוד משה מזרחי, מרים לאה פרץ, יונתן שמואל אברהם, נועה חנה פרידמן, איתי אלכסנדר כץ, מאיה שלומית אשכנזי, גיא בנימין ביטון, תמר בתיה שפירא, רועי יהודה מלכה, עדי רחל גולדשטיין, דניאל אהרון סבג, הילה מלכה חדד, יובל ישראל ברקוביץ, רוני שירה דיין, מתן פנחס אזולאי, שירה אילנה וייס, עומר שלמה גבאי, מיכל זהבה שוורץ, התעשייה האווירית לישראל, בנק הפועלים בעירבון מוגבל, שירותי בריאות כללית, חברת החשמל לישראל, בנק לאומי לישראל, אל על נתיבי אוויר לישראל, שופרסל חברה להשקעות, שטראוס גרופ ניהול, טבע תעשיות פרמצבטיות, פלאפון תקשורת בעירבון מוגבל, סלקום ישראל בעירבון מוגבל, פרטנר תקשורת בעירבון מוגבל, אסם השקעות בעירבון מוגבל, מפעלי ים המלח, מקורות חברת המים הלאומית, רכבת ישראל בעירבון מוגבל, התעשייה הצבאית לישראל, בנק דיסקונט לישראל, מגדל חברה לביטוח, הראל השקעות בביטוח ושירותים פיננסיים",
      { from: "he", to: "en" },
    ),
  );
};
test();
