export { supportedLanguages } from "helpers/languages";
export { Language } from "types";
export { transliterate } from "transliterate";

// *** EXPERIMENTS ***

import { checkAllSymbolsToBePresentInString, checkDisallowedSymbols } from "helpers/checkSymbols";
import { transliterate } from "transliterate";
import { RBT } from "icu-transliterator";
const test = async () => {
  // console.log(
  //   await transliterate(
  //     `القدس, بغداد, طنجة, مسقط, المنامة, بيروت, الخرطوم, تلمسان, بنغازي, حلب, نواكشوط, جيبوتي, صفاقس, جبل طارق, وادي النيل, صلالة, مكة المكرمة, إربد, تطوان, تعز, محمد عبد الرحمن الفاسي, يوسف إبراهيم الحوسني, فاطمة صالح المري, سارة جاسم الغامدي, خالد وليد الزهراني, عمر حسن الشمري, ليلى كمال العبيدي, زينب محمود الرشيدي, علي حمزة البلوشي, مريم سيف الناصري, إيمان ناصر الكندري, فهد سليمان العتيبي, نورة حمد التميمي, ماجد عدنان السعدي, ريم منير القحطاني, بدر عصام الحربي, منى توفيق الدوسري, حمد عيسى الهاجري, لولوة مساعد المطيري, سامي رائد الخالدي, شركة النبراس للخدمات النفطية, مؤسسة الأفق للتجارة العامة, مصنع الرواد للصناعات الثقيلة, مجموعة الهلال للاستثمارات المالية, وكالة الصقور للسياحة والسفر, مطابع التميز الفنية, مختبرات الحياة للتحاليل الطبية, مدارس القمة العالمية, فندق اللؤلؤة السياحي, مطاعم الضيافة العربية, شركة البنيان للمقاولات الإنشائية, مؤسسة الثريا للطاقة المتجددة, شركة السنابل للمنتجات الغذائية, مصنع الياقوت للمجوهرات, مجموعة المسار للحلول التقنية, شركة الأمانة للتأمين التكافلي, مؤسسة الشراع للملاحة البحرية, شركة الواحة للزراعة الحديثة, مكتبة الحكمة للنشر والتوزيع, شركة المنارة للخدمات اللوجستية
  // `,
  //     { from: "ar", to: "zh" },
  //   ),
  // );
  // console.log(RBT.fromRules(ipaBsRules).transliterate(""));
  console.log(
    checkAllSymbolsToBePresentInString(
      "abcdefghijklmnopqrstuvwxyzâæçêðôõøăčďęħĩŋœťũžơưɐɑɒɓɔɕɖɗɘəɚɛɜɝɟɡɢɣɤɥɦɧɨɪɫɭɯɱɲɳɵɹɽɾʀʁʂʃʈʉʊʋʌʎʏʐʑʒʔʕʝʰʱʲʷʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡βθχẽ",
      ``,
    ),
  );
};
test();
