export const hiArRules = `
::NFC;

॰ > \\.;
ॲ > ऍ;

::Null;

[।॥] > \\.;
ऽ > ;
ॐ > اوم;
ज ् ञ > غْي;
[^[:L:][:M:]] { अ > اَ;
[^[:L:][:M:]] { आ > آ;
[^[:L:][:M:]] { इ > اِ;
[^[:L:][:M:]] { ई > إي;
[^[:L:][:M:]] { उ > اُ;
[^[:L:][:M:]] { ऊ > او;
[^[:L:][:M:]] { ऋ > رِ;
[^[:L:][:M:]] { ॠ > رِي;
[^[:L:][:M:]] { ए } [^[:L:][:M:]] > إي;
[^[:L:][:M:]] { ए > إي;
[^[:L:][:M:]] { ऐ } [^[:L:][:M:]] > اَي;
[^[:L:][:M:]] { ऐ > اَي;
[^[:L:][:M:]] { ओ > او;
[^[:L:][:M:]] { औ > أَو;
[^[:L:][:M:]] { ऑ > آ;
अ > ءَ;
आ > ا;
इ > ئِ;
ई > ئي;
उ > أُ;
ऊ > أُو;
ऋ > رِ;
ॠ > رِي;
ए } [^[:L:][:M:]] > ئي;
ए > ئي;
ऐ } [^[:L:][:M:]] > َئي;
ऐ > َئي;
ओ > أُو;
औ > أَو;
ऑ > آ;
े } [^[:L:][:M:]] > ي;
े > ي;
ै } [^[:L:][:M:]] > َي;
ै > َي;
ा > ا;
ि > ِ;
ी > ي;
ु > ُ;
ू > و;
ृ > رِ;
ॄ > رِي;
ो > و;
ौ > َو;
ॉ > ا;
् > ْ;
ं } [पफफ़बभम] > م;
ं > ن;
ँ } [पफफ़बभम] > م;
ँ > ن;
ः > ه;
क़ > ق;
ख़ > خ;
ग़ > غ;
ज़ > ز;
ड़ > ر;
ढ़ > ره;
फ़ > ف;
य़ > ز;
श़ > ز;
झ़ > ز;
ख > كه;
घ > غه;
छ > تشه;
झ > جه;
ठ > طه;
ढ > ده;
थ > ته;
ध > ده;
फ > فه;
भ > به;
क > ك;
ग > غ;
[ङञण] > ن;
च > تش;
ज > ج;
ट > ط;
ड > د;
त > ت;
द > د;
न > ن;
प > ب;
ब > ب;
म > م;
य > ي;
र > ر;
[लळ] > ل;
व > و;
[शष] > ش;
स > س;
ह > ه;
ऌ > لِر;
ऍ > أَ;

० > ٠;
१ > ١;
२ > ٢;
३ > ٣;
४ > ٤;
५ > ٥;
६ > ٦;
७ > ٧;
८ > ٨;
९ > ٩;

::Null;

[:Devanagari:] > ;

::Null;

\\? > ؟;
';' > ؛;
',' } [^0-9٠-٩۰-۹] > ،;



::Null;

اا > آ;
أا > آ;
إا > آ;
آا > آ;

::Null;

[^[:L:][:M:]] { ة > ت;
[^[:L:][:M:]] { ى > ي;

::Null;

ة } [:L:] > ت;
ى } [:L:] > ي;
ي ي { ي+ > ;
`;
