export const hiIpaRules = `
::Lower;

\u200C > ;
\u200D > ;

ं}क > ŋ;
ं}ख > ŋ;
ं}ग > ŋ;
ं}घ > ŋ;
ं}च > ɲ;
ं}छ > ɲ;
ं}ज > ɲ;
ं}झ > ɲ;
ं}ट > ɳ;
ं}ठ > ɳ;
ं}ड > ɳ;
ं}ढ > ɳ;
ं}त > n;
ं}थ > n;
ं}द > n;
ं}ध > n;
ं}प > m;
ं}फ > m;
ं}ब > m;
ं}भ > m;
ं > ̃;

ज्ञ > ɡjə;

क़् > q;
ख़् > x;
ग़् > ɣ;
ज़् > z;
ड़् > ɽ;
ढ़् > ɽʱ;
फ़् > f;
य़् > j;

क् > k;
ख् > kʰ;
ग् > ɡ;
घ् > ɡʱ;
ङ् > ŋ;
च् > t͡ʃ;
छ् > t͡ʃʰ;
ज् > d͡ʒ;
झ् > d͡ʒʱ;
ञ् > ɲ;
ट् > ʈ;
ठ् > ʈʰ;
ड् > ɖ;
ढ् > ɖʱ;
ण् > ɳ;
त् > t̪;
थ् > t̪ʰ;
द् > d̪;
ध् > d̪ʱ;
न् > n;
प् > p;
फ् > pʰ;
ब् > b;
भ् > bʱ;
म् > m;
य् > j;
र् > ɾ;
ल् > l;
ळ् > ɭ;
व् > ʋ;
श् > ʃ;
ष् > ʂ;
स् > s;
ह् > ɦ;

क़ > qə;
ख़ > xə;
ग़ > ɣə;
ज़ > zə;
ड़ > ɽə;
ढ़ > ɽʱə;
फ़ > fə;
य़ > jə;

क > kə;
ख > kʰə;
ग > ɡə;
घ > ɡʱə;
ङ > ŋə;
च > t͡ʃə;
छ > t͡ʃʰə;
ज > d͡ʒə;
झ > d͡ʒʱə;
ञ > ɲə;
ट > ʈə;
ठ > ʈʰə;
ड > ɖə;
ढ > ɖʱə;
ण > ɳə;
त > t̪ə;
थ > t̪ʰə;
द > d̪ə;
ध > d̪ʱə;
न > nə;
प > pə;
फ > pʰə;
ब > bə;
भ > bʱə;
म > mə;
य > jə;
र > ɾə;
ल > lə;
ळ > ɭə;
व > ʋə;
श > ʃə;
ष > ʂə;
स > sə;
ह > ɦə;

अ > ə;
आ > aː;
इ > ɪ;
ई > iː;
उ > ʊ;
ऊ > uː;
ऋ > ɾɪ;
ॠ > ɾiː;
ऌ > li;
ॡ > liː;
ए > eː;
ऐ > ɛː;
ओ > oː;
औ > ɔː;
ऑ > ɔ;
ऍ > ɛ;
ॐ > oːm;
ऽ > ʔ;

::Null;

əा > aː;
əि > ɪ;
əी > iː;
əु > ʊ;
əू > uː;
əृ > ɾɪ;
əॄ > ɾiː;
əॅ > æ;
əॆ > e;
əे > eː;
əै > ɛː;
əॉ > ɔ;
əॊ > o;
əो > oː;
əौ > ɔː;

् > ;

ँ > ̃;
ः > h;

::Null;

[əaɪiʊueoɛæɔː̃] t͡ʃ [̪ʰʱ͡]* { ə } [:^Letter:] > ;
[əaɪiʊueoɛæɔː̃] d͡ʒ [̪ʰʱ͡]* { ə } [:^Letter:] > ;

[əaɪiʊueoɛæɔː̃] [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* { ə } [:^Letter:] > ;

[kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* [kɡŋɲʈɖɳnpbʃʂsɦqxɣzʒɽftd] [̪ʰʱ͡]* { ə } [:^Letter:] > ;
[kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* t͡ʃ [̪ʰʱ͡]* { ə } [:^Letter:] > ;
[kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* d͡ʒ [̪ʰʱ͡]* { ə } [:^Letter:] > ;

::Null;

[əaɪiʊueoɛæɔː̃] t͡ʃ [̪ʰʱ͡]* { ə } t͡ʃ [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;
[əaɪiʊueoɛæɔː̃] t͡ʃ [̪ʰʱ͡]* { ə } d͡ʒ [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;
[əaɪiʊueoɛæɔː̃] t͡ʃ [̪ʰʱ͡]* { ə } [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;

[əaɪiʊueoɛæɔː̃] d͡ʒ [̪ʰʱ͡]* { ə } t͡ʃ [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;
[əaɪiʊueoɛæɔː̃] d͡ʒ [̪ʰʱ͡]* { ə } d͡ʒ [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;
[əaɪiʊueoɛæɔː̃] d͡ʒ [̪ʰʱ͡]* { ə } [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;

[əaɪiʊueoɛæɔː̃] [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* { ə } t͡ʃ [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;
[əaɪiʊueoɛæɔː̃] [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* { ə } d͡ʒ [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;
[əaɪiʊueoɛæɔː̃] [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* { ə } [kɡŋɲʈɖɳnpbmjɾlʋʃʂsɦqxɣzʒɽfɭtd] [̪ʰʱ͡]* [əaɪiʊueoɛæɔː̃] > ;

j̃ > jə̃;
ʋ̃ > ʋə̃;
`;
