export const ipaFaRules = `
::Null;
::NFC;

ẽ > e ̃;
ĩ > i ̃;
õ > o ̃;
ũ > u ̃;

[ʰʱʲʷ'’ʼˈˌ̧̇ːˠˤ˥˧˩̝̟̥̩̪̯͈̊̚͡] > ;

::Null;

tʃ > چ;
dʒ > ج;
tɕ > چ;
dʑ > ج;
tʂ > چ;
dʐ > ج;
ʈʂ > چ;
ɖʐ > ج;

::Null;

[^[:Letter:][:Mark:]] { [ɑɒâ] > آ;
[^[:Letter:][:Mark:]] { [iɪɨĩ] > ای;
[^[:Letter:][:Mark:]] { [uʊũɯưʉy] > او;
[^[:Letter:][:Mark:]] { [aæɐăʌ] > اَ;
[^[:Letter:][:Mark:]] { [eɛəɜɘɚɝęêœøơẽ] > اِ;
[^[:Letter:][:Mark:]] { [oɔɵôõɤʏ] > اُ;
[aæɐăʌ] } [^[:Letter:][:Mark:]] > ا;
[eɛəɜɘɚɝęêœøơẽ] } [^[:Letter:][:Mark:]] > ه;
[oɔɵôõɤʏ] } [^[:Letter:][:Mark:]] > و;
[ɑɒâiɪɨĩyuʊũɯưʉaæɐăʌeɛəɜɘɚɝęêœøơẽoɔɵôõɤʏآایوَُِ] { [aæɐăʌ] > اَ;
[ɑɒâiɪɨĩyuʊũɯưʉaæɐăʌeɛəɜɘɚɝęêœøơẽoɔɵôõɤʏآایوَُِ] { [eɛəɜɘɚɝęêœøơẽ] > اِ;
[ɑɒâiɪɨĩyuʊũɯưʉaæɐăʌeɛəɜɘɚɝęêœøơẽoɔɵôõɤʏآایوَُِ] { [oɔɵôõɤʏ] > اُ;

::Null;

[oɔɵôõɤ] } ̃ > و;
̃ > ن;
[ɑɒâ] > ا;
[iɪɨĩ] > ی;
[uʊũɯưʉy] > و;
[aæɐăʌ] > َ;
[eɛəɜɘɚɝęêœøơẽ] > ِ;
[oɔɵôõɤʏ] > ُ;
[bɓ] > ب;
p > پ;
[tťʈ] > ت;
θ > ث;
[dďɖɗ] > د;
ð > ذ;
[ck] > ک;
[gɡ] > گ;
[qɢ] > ق;
ɟ > ج;
ʔ > ء;
ʕ > ع;
[fɸ] > ف;
[vʋβwɰɥ] > و;
s > س;
z > ز;
[ʃɧçɕʂ] > ش;
[ʒžʐʑ] > ژ;
č > چ;
[xχ] > خ;
ɣ > غ;
[hɦ] > ه;
ħ > ح;
[mɱ] > م;
[nɲɳ] > ن;
ŋ > نگ;
[lɫɭʎ] > ل;
[rɾɹɽʀʁ] > ر;
[jʝ] > ی;
`;
