export const ipaBnRules = `
::Null;
::NFC;

['’ˈˌːˠˤ˥˧˩̝̟̥̩̪̯͈̃̊̚͡ʼ̧̇]>;

::Null;

n } [kɡgɢ] > ঙ্;
n } [cɟč] > ঞ্;
n } [ʈɖ] > ণ্;
t[ʃɕ][ʰh] > ছ্;
t[ʃɕ] > চ্;
d[ʒʑ][ʰʱɦh] > ঝ্;
d[ʒʑ] > জ্;
b[ʰʱɦh] > ভ্;
p[ʰh] > ফ্;
d[ʰʱɦh] > ধ্;
ð[ʰh] > ধ্;
ɖ[ʰʱɦh] > ঢ্;
ɗ[ʰʱɦh] > ঢ্;
t[ʰh] > থ্;
θ[ʰh] > থ্;
ʈ[ʰh] > ঠ্;
g[ʰʱɦh] > ঘ্;
ɡ[ʰʱɦh] > ঘ্;
ɢ[ʰʱɦh] > ঘ্;
k[ʰh] > খ্;
c[ʰh] > ছ্;
ɟ[ʰʱɦh] > ঝ্;
[^[:Letter:][:Mark:]] { j > য্;
[aɑɐɒâăʌəɘɚæeɛɜɝɤêęœẽiɪĩɨyʏưuʊũʉɯoɔɵõøơô] { j > য়্;
j > য্;
[^[:Letter:][:Mark:]] { w > ওয়্;
[aɑɐɒâăʌəɘɚæeɛɜɝɤêęœẽiɪĩɨyʏưuʊũʉɯoɔɵõøơô] { w > ওয়্;
w > ব্;

::Null;

[bɓ] > ব্;
p > প্;
[dðď] > দ্;
[ɖɗ] > ড্;
[tθť] > ত্;
ʈ > ট্;
[gɡɢɣɰ] > গ্;
k > ক্;
q > ক্;
[cč] > চ্;
ɟ > জ্;
[mɱ] > ম্;
[nɲ] > ন্;
ɳ > ণ্;
ŋ > ঙ্;
[sɕ] > স্;
[ʃç] > শ্;
ʂ > ষ্;
[zʑʐʒž] > জ্;
[rɹɾʀʁ] > র্;
ɽ > ড়্;
[lɫɭʎ] > ল্;
[hɦħʕɧ] > হ্;
[vʋβ] > ভ্;
[fɸ] > ফ্;
[xχ] > খ্;
[ʝɥ] > য্;
ʔ > ;
ʲ > য্;
ʷ > ব্;
[ʰʱ] > ;

::Null;

[aɑɐɒâă] > আ;
[ʌəɘ] > অ;
ɚ > অর্;
æ > অ্যা;
[eɛɤêęœẽ] > এ;
ɜ > আ;
ɝ > আর্;
[iɪĩɨyʏư] > ই;
[uʊũʉɯ] > উ;
[oɔɵõøơô] > ও;

::Null;

্আ > া;
্অ্যা > ্যা;
্অ>;
্এ > ে;
্ই > ি;
্উ > ু;
্ও > ো;

::Null;

অা > আ;
[অআইঈউঊঋৠঌৡএঐওঔ] { া > আ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ি > ই;
[অআইঈউঊঋৠঌৡএঐওঔ] { ী > ঈ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ু > উ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ূ > ঊ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ৃ > ঋ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ৄ > ৠ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ৢ > ঌ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ৣ > ৡ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ে > এ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ৈ > ঐ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ো > ও;
[অআইঈউঊঋৠঌৡএঐওঔ] { ৌ > ঔ;
[অআইঈউঊঋৠঌৡএঐওঔ] { ্ > ;
[^[:Letter:][:Mark:]] { া > আ;
[^[:Letter:][:Mark:]] { ি > ই;
[^[:Letter:][:Mark:]] { ী > ঈ;
[^[:Letter:][:Mark:]] { ু > উ;
[^[:Letter:][:Mark:]] { ূ > ঊ;
[^[:Letter:][:Mark:]] { ৃ > ঋ;
[^[:Letter:][:Mark:]] { ৄ > ৠ;
[^[:Letter:][:Mark:]] { ৢ > ঌ;
[^[:Letter:][:Mark:]] { ৣ > ৡ;
[^[:Letter:][:Mark:]] { ে > এ;
[^[:Letter:][:Mark:]] { ৈ > ঐ;
[^[:Letter:][:Mark:]] { ো > ও;
[^[:Letter:][:Mark:]] { ৌ > ঔ;
[^[:Letter:][:Mark:]] { ্ > ;
`;
