export const ipaHeRules = `
::Null;
::NFD;

ç } [:^Letter:] > ך;
ç > כ;

[͈̚ˈˌː'’̇ˑ̇˥˦˧˨˩ˤʷʲʱʰˠⁿˡ̪̺̻̥̬̚ʴʵʶˢˣꜛꜜ↑↓↗↘ʼ͜͡‖|̧̩̯̟̊˞̨̛̝̂̆] > ;

::Null;

tʃ } [:^Letter:] > ץ׳;
tɕ } [:^Letter:] > ץ׳;
ʈʂ } [:^Letter:] > ץ׳;
tʃ > צ׳;
dʒ > ג׳;
ts } [:^Letter:] > ץ;
ts > צ;
dz > ז;
tɕ > צ׳;
dʑ > ג׳;
ʈʂ > צ׳;
ɖʐ > ג׳;
č } [:^Letter:] > ץ׳;
č > צ׳;
ž > ז׳;
ď > ג;
ť > ק;

[bɓʙ] > ב;
[vʋʍwɥβ] > ו;
[f] } [:^Letter:] > ף;
[fpɸƥ] > פ;
[mɱ] } [:^Letter:] > ם;
[mɱ] > מ;
[tʈt̪] > ט;
[dɖd̪dʱɗ] > ד;
[θ] > ת;
[ð] > ד;
[nɲɳɴ] } [:^Letter:] > ן;
[nɲɳɴ] > נ;
ŋ } [ɡgɢɠɟʄɣ] > נ;
ŋ > נג;
[sʂɕ] > ס;
[zʐʑ] > ז;
[ʃɧ] > ש;
[ʒ] > ז׳;
[^[:Letter:]'׳] { [ɝɚ] > אר;
[ɝɚ] > ר;
[rɾɹʀʁɻɽ] > ר;
[lɫʎɭʟ] > ל;
[jʝɰ] > י;
[kqc] > ק;
[ɡgɢɠɟʄɣ] > ג;
[hɦ] > ה;
[xχ] } [:^Letter:] > ך;
[xχ] > כ;
[ħʜ] > ח;
[ʕʢ] > ע;
[ʔʡ] > א;

̃ } [:^Letter:] > ן;
̃ > נ;

[^[:Letter:]'׳] { [aɑæɒɐʌəɤɵɞ] > א;
[^[:Letter:]'׳] { [eɛɘɜ] > א;
[^[:Letter:]'׳] { [iɪyʏɨ] > אי;
[^[:Letter:]'׳] { [uʊoɔœøʉɯ] > או;

[aɑæɒɐʌəɤɵɞ] } [aɑæɒɐʌəɤɵɞ] > א;
[aɑæɒɐʌəɤɵɞ] } [eɛɘɜ] > א;
[aɑæɒɐʌəɤɵɞ] } [iɪyʏɨ] > א;
[aɑæɒɐʌəɤɵɞ] } [uʊoɔœøʉɯ] > א;

[eɛɘɜ] } [aɑæɒɐʌəɤɵɞ] > א;
[eɛɘɜ] } [eɛɘɜ] > א;
[eɛɘɜ] } [iɪyʏɨ] > י;
[eɛɘɜ] } [uʊoɔœøʉɯ] > א;

[iɪyʏɨ] } [aɑæɒɐʌəɤɵɞ] > יא;
[iɪyʏɨ] } [eɛɘɜ] > יא;
[iɪyʏɨ] } [iɪyʏɨ] > י;
[iɪyʏɨ] } [uʊoɔœøʉɯ] > י;

[uʊoɔœøʉɯ] } [aɑæɒɐʌəɤɵɞ] > וא;
[uʊoɔœøʉɯ] } [eɛɘɜ] > וא;
[uʊoɔœøʉɯ] } [iɪyʏɨ] > וא;
[uʊoɔœøʉɯ] } [uʊoɔœøʉɯ] > ;

[aɑæɒɐʌəɤɵɞ] } [^[:Letter:]'׳] > ה;
[eɛɘɜ] } [^[:Letter:]'׳] > ה;
[iɪyʏɨ] } [^[:Letter:]'׳] > י;
[uʊoɔœøʉɯ] } [^[:Letter:]'׳] > ו;

[aɑæɒɐʌəɤɵɞ] > ;
[eɛɘɜ] > ;
[iɪyʏɨ] > י;
[uʊoɔœøʉɯ] > ו;

::Null;

יי { י > ;
וו { ו > ;

ך } [:Letter:] > כ;
ם } [:Letter:] > מ;
ן } [:Letter:] > נ;
ף } [:Letter:] > פ;
ץ } [:Letter:] > צ;
כ } [:^Letter:] > ך;
מ } [:^Letter:] > ם;
נ } [:^Letter:] > ן;
צ } [^[:Letter:]'׳] > ץ;
`;
