export const ipaLvRules = `
::Null;

t͡s > c;
ts > c;
d͡z > dz;
dz > dz;
t͡ʃ > č;
tʃ > č;
d͡ʒ > dž;
dʒ > dž;
t͡ɕ > č;
tɕ > č;
d͡ʑ > dž;
dʑ > dž;
t͡ʂ > č;
tʂ > č;
d͡ʐ > dž;
dʐ > dž;

[kq] ʲ > ķ;
[gɡɢ] ʲ > ģ;
[lɫɭ] ʲ > ļ;
[nɳŋ] ʲ > ņ;

[aɑɐɒâăʌ] ː > ā;
[ɚɝ] ː > ēr;
[eɛæəɘɜœøêęẽ] ː > ē;
[iɪɨyʏĩ]ː > ī;
[oɔɤɯɵôõơ] ː > o;
[uʊʉũư] ː > ū;

[ɑɐɒâăʌ] > a;
[ɚɝ] > er;
[ɛæəɘɜœøêęẽ] > e;
[ɪɨyʏĩ] > i;
[ɔɤɵôõơɯ] > o;
[ʊʉũư] > u;

c > ķ;
[ɟď] > ģ;
ť > ķ;

q > k;
[ɡɢɣɰ] > g;
[wβʋ] > v;
θ > t;
[ðɖɗ] > d;
[ɕʂʃ] > š;
[ʑʐʒ] > ž;
[xχɦɧħʕç] > h;
[ʁɾʀɹɽ] > r;
ɱ > m;
ɲ > ņ;
[ɳŋ] > n;
[ɫɭ] > l;
ʎ > ļ;
[ɥʝ] > j;
ɓ > b;
ʈ > t;
ɸ > f;

[͈̚ʔ'’ˈˌ˥˧˩̝̟̥̩̪̯̃̊ʼ̧̇ˠˤʰʱʷʲː͡] > ;

::Null;

[ķģļņšžč] { j > ;
dž { j > ;
j { ie > e;
b { b > ;
c { c > ;
d { d > ;
f { f > ;
g { g > ;
h { h > ;
j { j > ;
k { k > ;
p { p > ;
s { s > ;
t { t > ;
v { v > ;
z { z > ;
š { š > ;
ž { ž > ;
č { č > ;
ķ { ķ > ;
ģ { ģ > ;
ļ { ļ > ;
ņ { ņ > ;
dz { dz > ;
dž { dž > ;

[:^Letter:] l { l > ;
[:^Letter:] m { m > ;
[:^Letter:] n { n > ;
[:^Letter:] r { r > ;
l { l } [:^Letter:] > ;
m { m } [:^Letter:] > ;
n { n } [:^Letter:] > ;
r { r } [:^Letter:] > ;
`;
