export const ipaSrRules = `
::Null;

t͡s > c;
ts > c;
t͡ʃ > č;
tʃ > č;
t͡ɕ > ć;
tɕ > ć;
d͡ʒ > dž;
dʒ > dž;
d͡ʑ > đ;
dʑ > đ;

nʲ > nj;
lʲ > lj;
tʲ > ć;
dʲ > đ;
kʲ > ć;
gʲ > đ;

ɲ > nj;
ʎ > lj;

ɓ > b;
[θťʈ] > t;
ď > đ;
[ðɖɗ] > d;
ɟ > đ;
[ɡɢɣɰ] > g;
[çħɦɧχx] > h;
[ŋɳ] > n;
ɱ > m;
[ɹɽɾʀʁ] > r;
[ɫɭ] > l;
[ʂʃɕ] > š;
[ʐʑʒ] > ž;
[ʝɥ] > j;
[βʋw] > v;
q > k;
ɸ > f;

[ɐɑɒæâăʌ] > a;
[ɛɜɝɘəɚêęẽœ] > e;
[ɨɪĩʏy] > i;
[ɔɵôõøơɤ] > o;
[ʊʉũưɯ] > u;

[͈̚ʰʱʲʷ'’ʼˈ̇ˌ̧ːˠˤ˥˧˩̝̟̥̩̪̯̃̊͡ʔʕ] > ;

::Null;

i { a > ja;
i { e > je;
i { u > ju;

::Null;

dz { dz > ;
dž { dž > ;
lj { lj > ;
nj { nj > ;

::Null;

a { a > ;
e { e > ;
i { i > ;
o { o > ;
u { u > ;
b { b > ;
c { c > ;
č { č > ;
ć { ć > ;
d { d > ;
đ { đ > ;
f { f > ;
g { g > ;
h { h > ;
j { j > ;
k { k > ;
l { l > ;
m { m > ;
n { n > ;
p { p > ;
r { r > ;
s { s > ;
š { š > ;
t { t > ;
v { v > ;
z { z > ;
ž { ž > ;
`;
