export const latnHyRules = `
::Null;

DŽ > Ջ;
Dž > Ջ;
dž > ջ;

DZ > Ձ;
Dz > Ձ;
dz > ձ;

GH > Ղ;
Gh > Ղ;
gh > ղ;

IJ > ԷՅ;
Ij > Էյ;
ij > էյ;

KH > Խ;
Kh > Խ;
kh > խ;

NG > ՆԳ;
Ng > Նգ;
ng > նգ;

TH > Թ;
Th > Թ;
th > թ;

TS > Ց;
Ts > Ց;
ts > ց;

::Null;

[:^Letter:] { E > Է;
[:^Letter:] { e > է;
[:^Letter:] { O > Օ;
[:^Letter:] { o > օ;

[:Lu:] { U > ՈՒ;
U } [:Lu:] > ՈՒ;
U > Ու;
u > ու;

[:Lu:] { Ü > ՅՈՒ;
Ü } [:Lu:] > ՅՈՒ;
Ü > Յու;
ü > յու;

[:Lu:] { Ń > ՆՅ;
Ń } [:Lu:] > ՆՅ;
Ń > Նյ;
ń > նյ;

[:Lu:] { Ľ > ԼՅ;
Ľ } [:Lu:] > ԼՅ;
Ľ > Լյ;
ľ > լյ;

A > Ա;
a > ա;
Ä > Է;
ä > է;
B > Բ;
b > բ;
Ć > Ճ;
ć > ճ;
Č > Չ;
č > չ;
D > Դ;
d > դ;
Đ > Ջ;
đ > ջ;
E > Ե;
e > ե;
F > Ֆ;
f > ֆ;
G > Գ;
g > գ;
H > Հ;
h > հ;
I > Ի;
i > ի;
Ï > Ը;
ï > ը;
K > Կ;
k > կ;
L > Լ;
l > լ;
M > Մ;
m > մ;
N > Ն;
n > ն;
O > Ո;
o > ո;
Ö > Օ;
ö > օ;
P > Պ;
p > պ;
Q > Ք;
q > ք;
R > Ր;
r > ր;
S > Ս;
s > ս;
Š > Շ;
š > շ;
T > Տ;
t > տ;
V > Վ;
v > վ;
W > Վ;
w > վ;
X > Խ;
x > խ;
Y > Յ;
y > յ;
Ÿ > Յ;
ÿ > յ;
Z > Զ;
z > զ;
Ž > Ժ;
ž > ժ;
\\' > ՚;
· > ;

::Null;

[:^Letter:] { ր > ռ;
[:^Letter:] { Ր > Ռ;
[:^Letter:] { յի > ի;
[:^Letter:] { Յի > Ի;
[:^Letter:] { ՅԻ > Ի;
[:^Letter:] { յԻ > Ի;
[:^Letter:] { յե > ե;
[:^Letter:] { Յե > Ե;
[:^Letter:] { յԵ > Ե;
[:^Letter:] { ՅԵ > Ե;
յէ > յե;
Յէ > Յե;
ՅԷ > ՅԵ;
յԷ > յԵ;
յօ > յո;
Յօ > Յո;
ՅՕ > ՅՈ;
յՕ > յՈ;
եօ > եո;
Եօ > Եո;
ԵՕ > ԵՈ;
եՕ > եՈ;
րր > ռռ;
Րր > Ռռ;
րՐ > ռՌ;
ՐՐ > ՌՌ;
յյ > յ;
յՅ > յ;
Յյ > Յ;
ՅՅ > Յ;
[:^Letter:] { ւ > վ;
[:^Letter:] { Ւ > Վ;
[^ոՈ] { ւ > վ;
[^ոՈ] { Ւ > Վ;
`;
