export const latnRuRules = `
::Null;

DŽ > ДЖ;
Dž > Дж;
dž > дж;

DZ > ДЗ;
Dz > Дз;
dz > дз;

TS > Ц;
Ts > Ц;
ts > ц;

TH > Т;
Th > Т;
th > т;

GH > Г;
Gh > Г;
gh > г;

NG > НГ;
Ng > Нг;
ng > нг;

KH > Х;
Kh > Х;
kh > х;

[:^Letter:] { IJ > ЭЙ;
[АЕИЫОЁУЮЯаеиыоёуюя] { IJ > ЭЙ;
IJ > ЕЙ;
[:^Letter:] { Ij > Эй;
[АЕИЫОЁУЮЯаеиыоёуюя] { Ij > Эй;
Ij > Ей;
[:^Letter:] { ij > эй;
[АЕИЫОЁУЮЯаеиыоёуюя] { ij > эй;
ij > ей;

[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YA > ЬЯ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Ya > Ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { ya > ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YÄ > ЬЯ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yä > Ья;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yä > ья;
[БВГДЖЗКЛМНПРСФХЦЧШЩбвгджзклмнпрсфхцчшщ] { YE > ЬЕ;
[БВГДЖЗКЛМНПРСФХЦЧШЩбвгджзклмнпрсфхцчшщ] { Ye > Ье;
[БВГДЖЗКЛМНПРСФХЦЧШЩбвгджзклмнпрсфхцчшщ] { ye > ье;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YI > ЬИ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yi > Ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yi > ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YÏ > ЬИ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yï > Ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yï > ьи;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YO > ЬЁ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yo > Ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yo > ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YÖ > ЬЁ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yö > Ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yö > ьё;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YU > ЬЮ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yu > Ью;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yu > ью;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { YÜ > ЬЮ;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { Yü > Ью;
[БВГДЖЗКЛМНПРСТФХЦЧШЩбвгджзклмнпрстфхцчшщ] { yü > ью;

Y [AÄ] > Я;
Y [aä] > Я;
y [aä] > я;

YE > Е;
Ye > Е;
ye > е;

YI > И;
Yi > И;
yi > и;
YÏ > ЙЫ;
Yï > Йы;
yï > йы;

Y [OÖ] > Ё;
Y [oö] > Ё;
y [oö] > ё;

Y [UÜ] > Ю;
Y [uü] > Ю;
y [uü] > ю;

[:^Letter:] { E > Э;
[:^Letter:] { e > э;
[АЕИЫОЁУЮЯаеиыоёуюя] { E > Э;
[АЕИЫОЁУЮЯаеиыоёуюя] { e > э;

[:^Letter:] { Ä > Э;
[:^Letter:] { ä > э;
[АЕИЫОЁУЮЯаеиыоёуюя] { Ä > Э;
[АЕИЫОЁУЮЯаеиыоёуюя] { ä > э;

ĽA > ЛЯ;
Ľa > Ля;
ľa > ля;
ĽÄ > ЛЯ;
Ľä > Ля;
ľä > ля;
ĽE > ЛЕ;
Ľe > Ле;
ľe > ле;
ĽI > ЛИ;
Ľi > Ли;
ľi > ли;
ĽO > ЛЁ;
Ľo > Лё;
ľo > лё;
ĽÖ > ЛЁ;
Ľö > Лё;
ľö > лё;
ĽU > ЛЮ;
Ľu > Лю;
ľu > лю;
ĽÜ > ЛЮ;
Ľü > Лю;
ľü > лю;

ŃA > НЯ;
Ńa > Ня;
ńa > ня;
ŃÄ > НЯ;
Ńä > Ня;
ńä > ня;
ŃE > НЕ;
Ńe > Не;
ńe > не;
ŃI > НИ;
Ńi > Ни;
ńi > ни;
ŃO > НЁ;
Ńo > Нё;
ńo > нё;
ŃÖ > НЁ;
Ńö > Нё;
ńö > нё;
ŃU > НЮ;
Ńu > Ню;
ńu > ню;
ŃÜ > НЮ;
Ńü > Ню;
ńü > ню;

Đ } [:Ll:] > Дж;
Đ > ДЖ;
đ > дж;

Ľ } [:Ll:] > Ль;
Ľ > ЛЬ;
ľ > ль;
Ń } [:Ll:] > Нь;
Ń > НЬ;
ń > нь;

A > А;
a > а;
B > Б;
b > б;
Č > Ч;
č > ч;
Ć > Ч;
ć > ч;
D > Д;
d > д;
[EÄ] > Е;
[eä] > е;
F > Ф;
f > ф;
G > Г;
g > г;
H > Х;
h > х;
[IŸ] > И;
[iÿ] > и;
Ï > Ы;
ï > ы;
K > К;
k > к;
L > Л;
l > л;
M > М;
m > м;
N > Н;
n > н;
O > О;
o > о;
Ö > Ё;
ö > ё;
P > П;
p > п;
Q > К;
q > к;
R > Р;
r > р;
S > С;
s > с;
Š > Ш;
š > ш;
T > Т;
t > т;
U > У;
u > у;
Ü > Ю;
ü > ю;
[VW] > В;
[vw] > в;
X > Х;
x > х;
Y > Й;
y > й;
Z > З;
z > з;
Ž > Ж;
ž > ж;
\\' > ь;
· > ъ;

::Null;

[жшчщЖШЧЩ] { ы > и;
[жшчщЖШЧЩ] { Ы > И;

[Йй] { [Йй] > ;

::Null;

[ьъЬЪ] { й [аА] > я;
[ьъЬЪ] { Й [аА] > Я;
[ьъЬЪ] { й [оО] > ё;
[ьъЬЪ] { Й [оО] > Ё;
[ьъЬЪ] { й [еЕ] > е;
[ьъЬЪ] { Й [еЕ] > Е;
[ьъЬЪ] { й [уУ] > ю;
[ьъЬЪ] { Й [уУ] > Ю;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йа > иа;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йА > иА;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йа > Иа;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙА > ИА;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йо > ио;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йО > иО;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йо > Ио;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙО > ИО;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йе > ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йЕ > ьЕ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йе > Ье;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙЕ > ЬЕ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йу > ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йУ > ьЮ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йу > Ью;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙУ > ЬЮ;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йи > ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { йИ > ьИ;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { Йи > Ьи;
[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { ЙИ > ЬИ;

й [иИ] > и;
Й [иИ] > И;

[:^Letter:] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[:^Letter:] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [:^Letter:] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [:^Letter:] > И;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > и;
[бвгджзйклмнпрстфхцчшщьъБВГДЖЗЙКЛМНПРСТФХЦЧШЩЬЪ] { Й } [бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] > И;

::Null;

[бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ] { [ъЪ] } [бвгджзклмнпрстфхцчшщБВГДЖЗКЛМНПРСТФХЦЧШЩ] > ;
[ъЪ] } [:^Letter:] > ;
[ъЪ] } [аоуэыиАОУЭЫИ] > ;
[аоуэыиеёюяАОУЭЫИЕЁЮЯ] { [ъЪ] > ;
[:^Letter:] { [ъЪьЬ] > ;
[ьъЬЪйЙ] { [ьъЬЪ] > ;
`;
